[
  {
    "price": "$2500",
    "title": "► Luxury downtown Bristol - 2 bedroom STONE HARBOUR condo",
    "href": "https://providence.craigslist.org/apa/d/bristol-luxury-downtown-bristol-2/7058725599.html",
    "description": [
      "2 bedroom, 1 bath, 1200 sf luxury condo available for April 15th occupancy.",
      "1st floor condo is located on the street side of the development. High-end kitchen appliances, gas fireplace, and hardwood floors. Common amenities include pool and fitness center, and extensive landscaped grounds. Outdoor unassigned parking in a common lot, or nearby on-street parking.",
      "Stone Harbour has a private marina and residents have the option to rent a boat slip on an annual basis for an additional fee.",
      "Minimum 1 year lease with good references and credit check required. No smoking within the building. Small pets considered."
    ],
    "duplicates": []
  },
  {
    "price": "$1200",
    "title": "Amazing Home Available Now",
    "href": "https://providence.craigslist.org/apa/d/bristol-amazing-home-available-now/7047977358.html",
    "description": [
      "Fully furnished, nicely maintained. Great neighborhood located 1 mile from Rodger Williams University! Two blocks from park, bus line and beach. Ten minute walk to downtown Bristol. Spacious backyard including private driveway and off street parking. Bright sunny living room, eat-in kitchen, large basement with storage space and laundry. Lawn care is included. First month's rent and security deposit due at signing. Approval based on credit check and reference required. RWU Grad students & Faculty welcome! Owner pays for trash, sewer and lawn care. Tenant responsible for utilities. Wired for high speed internet."
    ],
    "duplicates": []
  },
  {
    "price": "$1500",
    "title": "Apartment for Rent",
    "href": "https://providence.craigslist.org/apa/d/bristol-apartment-for-rent/7057831810.html",
    "description": [
      "Completely renovated first floor2 bedroom located in downtown Bristol.  New kitchen, new flooring, laundry is in unit. Walk to shops, restaurants, bike path, town common and Bristol harbor. Large fenced in yard."
    ],
    "duplicates": [
      null,
      null,
      null
    ]
  },
  {
    "price": "$900",
    "title": "Apartment for Rent",
    "href": "https://providence.craigslist.org/apa/d/bristol-apartment-for-rent/7051494980.html",
    "description": [
      "Cute 1 bedroom cottage close to downtown Bristol. Off street parking, yard, gas heat. Available February 1st."
    ],
    "duplicates": []
  },
  {
    "price": "$1350",
    "title": "Apartment for Rent",
    "href": "https://providence.craigslist.org/apa/d/bristol-apartment-for-rent/7030917459.html",
    "description": [
      "Very nice 1st floor apartment in a great section of Bristol.  Apartment features an updated kitchen, beautiful hardwoods, washer/dryer hookups in the unit, off street parking.  Deck overlooks a nice yard. Gas heat.",
      "A must see unit!"
    ],
    "duplicates": []
  },
  {
    "price": "$1500",
    "title": "Apartment for Rent",
    "href": "https://southcoast.craigslist.org/apa/d/bristol-apartment-for-rent/7020035212.html",
    "description": [
      "Just renovated 1st floor 2 bedroom apartment close to downtown, restaurants, shops and harbor.  Good size rooms, fenced yard, washer/dryer hookups, granite counters. Available Dec. 1st."
    ],
    "duplicates": []
  },
  {
    "price": "$2100",
    "title": "$2100 / 4br - Bristol Rental in friendly neighborhood - RWU Welcome",
    "href": "https://providence.craigslist.org/apa/d/bristol-br-bristol-rental-in-friendly/7057801827.html",
    "description": [
      "Bristol - 4BR / 2Bath home in a friendly neighborhood. RWU students (UG & Grad.) welcome. Available as early as February 2020. Washer/dryer, dishwasher and microwave, updated kitchen, unfinished basement, large deck and off street parking. Spacious property features a HUGE master bedroom and 3 other nice rooms, and open living room. This home is five minutes from campus and three minutes from downtown.  Just became available for this and next school year.",
      "The backyard is very large and it comes with a deck to enjoy the nice weather. The house has hardwood floors which is extremely nice to keep clean. If you have any questions, please feel to contact Linda at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$700",
    "title": "UTILITIES INCLUDED. King Philip Inn.  SAMSON REALTY 5406",
    "href": "https://providence.craigslist.org/apa/d/bristol-utilities-included-king-philip/7048929634.html",
    "description": [
      "About This Property:",
      "First floor studio including utilities.  Near CVS Plaza and other stores.  Close to Roger Williams University.  Great space with an amazing price!",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 5406    samsoneastbay",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 5406992677075224.5979998381959217705829740510703587066559487280993082380855902635992180281478044607247083919095401105692359682022531713187610314013466095399321610661169188846560736464"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$625",
    "title": "UTILITIES INCLUDED. King Philip Inn.  SAMSON REALTY 5424",
    "href": "https://providence.craigslist.org/apa/d/bristol-utilities-included-king-philip/7045137461.html",
    "description": [
      "About This Property:",
      "Good sized studio  including utilities.   CVS, Video store, Pizza, Laundry and Convenience store all next door.  Close to Roger Williams University and a short drive to Newport.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 5424    samsoneastbay",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 54242005251761886.6962620210689514652272488232544606773876444646061660568555842419278946029024094667562460460877946030554892072163362709641801590548938698846985832201075046024002158592"
    ],
    "duplicates": []
  },
  {
    "price": "$2475",
    "title": "3 BR spacious townhouse condo, excellent location Bristol North Farm",
    "href": "https://providence.craigslist.org/apa/d/warren-3-br-spacious-townhouse-condo/7057549939.html",
    "description": [
      "3-level townhouse in Bristol's North Farm. Unit has central AC, wall-to-wall carpeting, double-door closets, fireplace, and 2-car attached garage. Direct access to the bike path, tennis courts, pool and yacht club, private dock and beach, gated entry."
    ],
    "duplicates": []
  },
  {
    "price": "$1200",
    "title": "First Floor Two Bedroom in Historic Bristol Home",
    "href": "https://providence.craigslist.org/apa/d/bristol-first-floor-two-bedroom-in/7057445908.html",
    "description": [
      "Enjoy life in quaint Bristol, RI. This first floor, two bedroom unit features charming historic built-ins, an extra large living room, high ceilings, in-unit washer/dryer and a large back yard. Gas heat with on street parking. Walk to downtown, waterfront, common and bike path. Property owner is seeking a tenant with positive credit, landlord and employment references. The property owner maybe be willing to negotiate for one cat as a pet in this unit.  Sorry, no dogs. Looking to lease for Feb 1 but, for the right tenant, the owner may be willing consider a March lease."
    ],
    "duplicates": []
  },
  {
    "price": "$1000",
    "title": "Two Bedrooms on First Floor Granite and Stainless Kitchen",
    "href": "https://providence.craigslist.org/apa/d/bristol-two-bedrooms-on-first-floor/7057443629.html",
    "description": [
      "Be close to all that Bristol has to offer within walking distance. This first floor two bedroom has brand new flooring and carpets throughout. Stainless steel appliances with granite counters. Tastefully decorated with neutral colors and finishes throughout. Completely renovated a little over a year ago. RWU upperclassmen and grad students may be considered with a positive rental history and a parental guarantee. This unit is available February 1 but the owner would consider March 1 for the right tenant. Sorry, no pets."
    ],
    "duplicates": []
  },
  {
    "price": "$1050",
    "title": "Large 2 Bed,  Parking, Heat and Water Inc.",
    "href": "https://providence.craigslist.org/apa/d/bristol-large-2-bed-parking-heat-and/7057053462.html",
    "description": [
      "Large 2 bedroom, 24 unit building in beautiful Bristol, RI.  Off street parking, and appliances included.  Small pet ok.  Rent is 1050.00 a month, heat and water are included.  Security deposit of $1050. is required.",
      "Small pet is ok.",
      "Please TEXT",
      "show contact info",
      "email to schedule an appointment."
    ],
    "duplicates": []
  },
  {
    "price": "$1500",
    "title": "$1500 - 3BR - 3 Bedroom Apartment",
    "href": "https://providence.craigslist.org/apa/d/bristol-br-3-bedroom-apartment/7051278920.html",
    "description": [
      "Recently renovated Apartment",
      "Fantastic 3-bedroom apartment available for rent. New tile bathroom tile and vanity. Updated kitchen cabinets, countertop, sink W/ faucet, new tile backsplash and fresh paint.",
      "Only minutes from downtown and RWU. Great backyard. Features include kitchen appliances, new windows, gas heat, free storage, and free washer & dryer in basement. Must be respectful of other tenants in the building. This is Unit #2.",
      "Available Immediately. Just $1,500 per month."
    ],
    "duplicates": []
  },
  {
    "price": "$1500",
    "title": "Perfectly situated charming home 2 blocks from the sea",
    "href": "https://providence.craigslist.org/apa/d/bristol-perfectly-situated-charming/7052290784.html",
    "description": [
      "Home is located in historic and charming Bristol, Rhode Island. Flanking the sea, the town is peppered with restaurants, parks, boutique shops and antique stores.",
      "\tThis sun-filled home boasts three bedrooms, 1 full bath, large modern kitchen, living room and library. Relax in the private backyard and enjoy cocktails or coffee on the sundeck.",
      "\tThis home is only 1 block from the parade route. Celebrate the festivities include the 2 week concert series, carnival, and fireworks.",
      "\tThe house is conveniently located just 13 miles north of Newport. Newport offers beaches, shopping, restaurants, and Gilded Age mansions.",
      "DETAILS:",
      "\tFurnished or unfurnished rental.",
      "\tBedrooms: 3 (There are  and 1 full bed in the bedrooms upstairs. The couch in living room is a new and comfortable pullout + 2 queen beds )",
      "\tBathrooms: 1 full bath",
      "\tTwo vehicles can fit in the driveway. There is no overnight parking on the street.",
      "\tPets Allowed: Yes",
      "\t2 month security deposit",
      "\t3 month lease with utilities included in rent."
    ],
    "duplicates": []
  },
  {
    "price": "$1100",
    "title": "Updated 1 bed on 2nd floor",
    "href": "https://providence.craigslist.org/apa/d/bristol-updated-1-bed-on-2nd-floor/7040146577.html",
    "description": [
      "Spacious 1 bed apartment with gleaming hardwood floors, updated kitchen and bath, coin op laundry on same floor and off street parking!  First and security plus credit score/references required.  No housing vouchers, pets are negotiable on a case to case basis.....Water included in rent price!"
    ],
    "duplicates": []
  },
  {
    "price": "$3500",
    "title": "5 Bedroom 2.5 bath",
    "href": "https://providence.craigslist.org/apa/d/bristol-5-bedroom-25-bath/7054986588.html",
    "description": [
      "FOR SALE OR RENT!  Rent is $3500 & utilities  or.  FOR SALE at $559,900",
      "Academic rentals welcome.",
      "5bedroom 2.5 bath! Amazing neighborhood in Hopeworth. This beautiful home on a half acre lot backed wooded hiking path and a private beach is available for rent or sale! RWU students & the war college  are welcome!",
      "Please call me - Alison Sweeney- owner...I’d love to show it to you.",
      "show contact info",
      "Thank you."
    ],
    "duplicates": []
  },
  {
    "price": "$1000",
    "title": "$1000 / 2br - 800ft2 - 2 bed 3rd floor quiet dead end street near down",
    "href": "https://providence.craigslist.org/apa/d/bristol-br-800ft2-2-bed-3rd-floor-quiet/7040672596.html",
    "description": [
      "available January 2, 2020 near downtown,, 800 sq. feet has a deck , 5 min walk downtown 800 sq. ft. bars, pubs , restaurants and stores all near by within walking distance"
    ],
    "duplicates": []
  },
  {
    "price": "$1350",
    "title": "Spacious first floor 1 bed/office All utilities !!",
    "href": "https://providence.craigslist.org/apa/d/bristol-spacious-first-floor-1-bed/7035124132.html",
    "description": [
      "Charming first floor apartment in convenient location close to town! Hardwood floors, bedroom plus bonus room for office! Eat in kitchen plus dining room space! Laundry in basement and off street parking.  all utilities included!  First and security plus credit check and references required.  Sorry no pets."
    ],
    "duplicates": []
  },
  {
    "price": "$1950",
    "title": "Location!2 bed townhouse style condo",
    "href": "https://providence.craigslist.org/apa/d/bristol-location2-bed-townhouse-style/7036602363.html",
    "description": [
      "Completely renovated spacious 2 bed, 2 bath renovated condo in the heart of downtown Bristol!  Walk out onto your deck and enjoy breathtaking waterviews!   Large kitchen with granite and gleaming hardwood floors , laundry in unit, central air, gas heat, large bedrooms with closet space, large storage room in basement and off street parking lot!  First and security plus credit score and references required"
    ],
    "duplicates": []
  },
  {
    "price": "$700",
    "title": "Lovely COMPLETELY remodeled",
    "href": "https://providence.craigslist.org/apa/d/bristol-lovely-completely-remodeled/7036105138.html",
    "description": [
      "独立出入套房",
      "包水电,高速上网",
      "独立出入套房 平方英尺",
      "專屬衛浴個人使用房間內大窗戶採光通風佳",
      "安静安全, 洗衣机, 烘干机俱全.",
      "适合女性有良好的信誉,稳定的工作.",
      "没有厨房,有电灶和微波炉,少或无炊",
      "禁訪客過夜，禁止寵物, 抽菸, 酗酒。",
      "联系电话:",
      "---",
      "Beautiful Downtown Apartment Experience all that downtown has to offer in this gorgeous 1 bedroom/1 bathroom apartment. Unit is located within walking distance to State Street making for easy access to shopping, restaurants, and entertainment. This unit was recently remodeled less than two years ago - complete with hardwood floors, quartz countertops, and brand new appliances. Other Amenities Include: Eat-in gourmet kitchen Stainless steel appliances On-site Laundry R/O water purification system Central A/C & Heat Dishwasher Water included Private Balcony Pet friendly 1 parking spot Plenty of storage . Year lease Pets are allowed."
    ],
    "duplicates": []
  },
  {
    "price": "$850",
    "title": "Newly Renovated Second Floor Apartment",
    "href": "https://providence.craigslist.org/apa/d/bristol-newly-renovated-second-floor/7048766864.html",
    "description": [
      "We have a newly renovated 2 bedroom apartment with 1 bathroom, kitchen, living room, storage room in basement, and off street parking for one car.  There are washer and drier hookups in the storage room.  You pay all of your own utilities.  Call Elsa for an appointment at",
      "show contact info",
      ".  No pets."
    ],
    "duplicates": []
  },
  {
    "price": "$1675",
    "title": "Gorgeous Downton Waterfront District",
    "href": "https://providence.craigslist.org/apa/d/bristol-gorgeous-downton-waterfront/7047535066.html",
    "description": [
      "Complete renovation, solid hardwood maple flooring throughout, private deck, all new stainless appliances, gas cooking, granite counters, in-unit full size washer/dryer, off-street dedictaed parking."
    ],
    "duplicates": []
  },
  {
    "price": "$4200",
    "title": "RWU STUDENTS HOUSE for RENT 7/2020",
    "href": "https://providence.craigslist.org/apa/d/bristol-rwu-students-house-for-rent/7047174132.html",
    "description": [
      "Perfect for ROGER WILLIAMS STUDENTS AVAILABLE July 2020   $4200.00",
      "HOUSE built in 2007 WATER VIEWS",
      "HARDWOOD Floors Throughout",
      "3 levels",
      "5 Bedrooms",
      "3 Full baths",
      "Open floor plan,",
      "Master suite with private deck",
      "Front deck off main living and a back deck out to the back yard",
      "Unique living space with full kitchen on the first level and second level",
      "HEAT (oil) and Water included",
      "Central AC",
      "NO ANIMALS/ NO Smoking"
    ],
    "duplicates": []
  },
  {
    "price": "$1100",
    "title": "1st floor apartment",
    "href": "https://providence.craigslist.org/apa/d/bristol-1st-floor-apartment/7044657737.html",
    "description": [
      "1st floor, large kitchen, private storage , washer/dryer hookup   Short walk to downtown and minutes away from RWU   Ready February 1. Text",
      "show contact info"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1100",
    "title": "1st floor apartment",
    "href": "https://providence.craigslist.org/apa/d/bristol-1st-floor-apartment/7040903448.html",
    "description": [
      "Two bedroom, large kitchen,living room, one bathroom  short walk to downtown Bristol  minutes away from the university.",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1300",
    "title": "Avail Jan/Feb 2020-Newly Renovated 2 bedroom Apt",
    "href": "https://providence.craigslist.org/apa/d/bristol-avail-jan-feb-2020-newly/7037553582.html",
    "description": [
      "Available Jan/Feb 2020-Newly renovated 1st floor apt in desired Downtown Bristol location.  Close proximity to all shops, restaurants and parks. One large bedroom and another small bedroom/office space both with hardwoods, and living area with hardwoods as well. Brand New bath and kitchen. No utilities included-gas heat, water and electric. Small yard. OSewer fees are tenant responsibility at $43.25 a month. No pets please! Call Deb at",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$825",
    "title": "Two Bdrm Centrally Located Downtown Bristol Apt",
    "href": "https://providence.craigslist.org/apa/d/bristol-two-bdrm-centrally-located/7037555338.html",
    "description": [
      "1st Floor Centrally located downtown Bristol 2 Bedroom apartment. Short walk to Hope Street shops and restaurants. On-site laundry, and off-street parking for one car. Sewer fees additional $43.25 a month. Call",
      "show contact info",
      "for further information or an appointment. No pets please!"
    ],
    "duplicates": []
  },
  {
    "price": "$2600",
    "title": "Attn RWU!!   4 bed house",
    "href": "https://providence.craigslist.org/apa/d/bristol-attn-rwu-4-bed-house/7025304283.html",
    "description": [
      "Spacious 4 bed/ 2 bath house on a very private 1 acre lot close to RWU...large deck, master bedroom with deck, hardwoods, fireplace, W/D hookups.. plenty of parking .  First and security plus credit check and references required.  Reserve today!"
    ],
    "duplicates": []
  },
  {
    "price": "$2000",
    "title": "ATTENTION RWU!  3 BED minutes from RWU",
    "href": "https://providence.craigslist.org/apa/d/bristol-attention-rwu-3-bed-minutes/7025333630.html",
    "description": [
      "Newly renovated 3 bed/1 bath house with new appliances, washer/dryer,  large bonus room upstairs.  Plenty of off street parking.   Call today it won't let at this price!  First and security, credit check and references required."
    ],
    "duplicates": []
  },
  {
    "price": "$2200",
    "title": "LG Bristol Apt w/new remodeled bathroom, garage & yard",
    "href": "https://providence.craigslist.org/apa/d/bristol-lg-bristol-apt-new-remodeled/7040595457.html",
    "description": [
      "This is a large 2nd floor apartment in a 2 family Bristol home that is offered to a group of 4. This unit has a large living room and 3 bedrooms. One of the 2nd floor bedrooms and the living room contains new rugs while the other 2 bedrooms all have hardwood floors. Both living room rugs and the bedroom rug will be professionally cleaned before new tenants move in. The kitchen has a refrigerator, stove and dishwasher.",
      "- The unit will have 2 tenants share the large back bedroom which has 2 closets. The other 2 tenants will have their own bedroom.",
      "- There is a large Basement with plenty of room for the tenants to mingle with guests as well as 2 entrances/exits (1 of which leads to the backyard). The basement has its own bathroom and sink.",
      "- New washer and new dryer free to use by the tenants in the basement.",
      "- In January of 2019 the  bathroom was completely gutted out and renovated to now include new tile, granite vanity with 2 sinks, new toilet, new light fixtures/ceiling fan/mirrors, and a new large shower with specially ordered “frosted” door.",
      "- The home itself sits on 12,000 square foot property that has an enormous yard maintained by the owners and available for use by the tenants that includes an outdoor patio and fire pit.",
      "- The unit will have access to 1 spot in the private driveway and 1 spot in the 2 car garage along with plenty of off-street parking.",
      "- Quick walk to the town common area (0.9 miles), restaurants and shops in downtown Bristol (1.5 miles), as well as a short commute to RWU (1.5 miles).",
      "- The entire unit will be professionally cleaned before move in.",
      "- Landlords provide professional snow removal and yard maintenance.",
      "- Lease will run for one year from June 2020 thru May 2021.",
      "**Feel free to email any questions or to set up a viewing time. Thanks.**"
    ],
    "duplicates": [
      null,
      null
    ]
  },
  {
    "price": "$4650",
    "title": "LG House w/ huge yard,2 car garage, New Baths avail June ‘20- May ‘21",
    "href": "https://providence.craigslist.org/apa/d/bristol-lg-house-huge-yard2-car-garage/7023630375.html",
    "description": [
      "This is a large 2 family Bristol home that is perfect for a large group of students.  The house has 2 entrances/exits and can function as 2 separate apartments since each unit has private locks & utilities. Each living room and one of the 2nd floor bedrooms contain new rugs while the other 5 bedrooms all have hardwood floors. Both living room rugs and the bedroom rug will be professionally cleaned before new tenants move in. Each kitchen has a refrigerator, stove and dishwasher.",
      "-      There are 6 bedrooms in this home (3 on each floor) and the large bedroom on each floor which each contain 2 full closets will need to be shared by 2 students so that 4 tenants will live on each floor",
      "-\tLarge Basement with plenty of room for the tenants to mingle with guests as well as 2 entrances/exits (1 of which leads to the backyard). The basement has its own bathroom and sink.",
      "-\t 2 new washers and 2 new dryers free to use by the tenants.",
      "-\tIn summer of 2018 the 1st floor bathroom was completely gutted out and renovated to now include new tile, granite vanity with 2 sinks, new toilet, new light fixtures/ceiling fan/mirrors, and a new large shower with specially ordered “frosted” door. This same exact update was completed during winter break in January 2019 for the second floor.",
      "-\tThe home itself sits on 12,000 square foot property that has an enormous yard maintained by the owners and available for use by the tenants that includes an outdoor patio and fire pit.",
      "-\tThere is a driveway that easily fits 2 cars for the unit along with a private 2 car garage and plenty of off-street parking.",
      "-\tQuick walk to the town common area (0.9 miles), restaurants and shops in downtown Bristol (1.5 miles), as well as a short commute to RWU (1.5 miles).",
      "-\tThe entire unit will be professionally cleaned before move in.",
      "-\tLandlords provide professional snow removal and yard maintenance.",
      "-\tLease will run for one year from June 2020 thru May 2021.",
      "**Feel free to email any questions or to set up a viewing time. Thanks.**"
    ],
    "duplicates": []
  },
  {
    "price": "$4350",
    "title": "Great Off Campus House w/garage,yard, New Bathrooms avail Jun ‘20",
    "href": "https://providence.craigslist.org/apa/d/bristol-great-off-campus-house/7023226741.html",
    "description": [
      "This is a large 2 family Bristol home that is perfect for a group of six.  The house has 2 entrances/exits and can function as 2 separate apartments since each unit has private locks & utilities. Each living room and one of the 2nd floor bedrooms contain new rugs while the other 5 bedrooms all have hardwood floors. Both living room rugs and the bedroom rug will be professionally cleaned before new tenants move in. Each kitchen has a refrigerator, stove and dishwasher.",
      "-\tLarge Basement with plenty of room for the tenants to mingle with guests as well as 2 entrances/exits (1 of which leads to the backyard). The basement has its own bathroom and sink.",
      "-\t 2 new washers and 2 new dryers free to use by the tenants.",
      "-\tIn summer of 2018 the 1st floor bathroom was completely gutted out and renovated to now include new tile, granite vanity with 2 sinks, new toilet, new light fixtures/ceiling fan/mirrors, and a new large shower with specially ordered “frosted” door. This same exact update was completed during winter break in January 2019 for the second floor.",
      "-\tThe home itself sits on 12,000 square foot property that has an enormous yard maintained by the owners and available for use by the tenants that includes an outdoor patio and fire pit.",
      "-\tThere is a driveway that easily fits 2 cars for the unit along with a private 2 car garage and plenty of off-street parking.",
      "-\tQuick walk to the town common area (0.9 miles), restaurants and shops in downtown Bristol (1.5 miles), as well as a short commute to RWU (1.5 miles).",
      "-\tThe entire unit will be professionally cleaned before move in.",
      "-\tLandlords provide professional snow removal and yard maintenance.",
      "-\tLease will run for one year from June 2020 thru May 2021.",
      "**Feel free to email any questions or to set up a viewing time. Thanks.**"
    ],
    "duplicates": []
  },
  {
    "price": "$1050",
    "title": "Great Downtown Location! Large 2 bedroom Downtown Bristol",
    "href": "https://providence.craigslist.org/apa/d/bristol-great-downtown-location-large-2/7028439866.html",
    "description": [
      "Spacious 2 bedroom unit  - large living room and eat in kitchen, hardwood floors in living room, wood laminate in kitchen and carpeted bedrooms, tile bath, on-site laundry, off street parking in an ideal Downtown area close to shops, restaurants, and bus line. Water included! Sewer fees are Tenant responsibility $43.25 monthly.  NO PETS PLEASE!  Call for further information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1500",
    "title": "Beautifuly restored 1 BR. apt. in historic downtown Bristol.",
    "href": "https://providence.craigslist.org/apa/d/bristol-beautifuly-restored-1-br-apt-in/7037020154.html",
    "description": [
      "A must see!  Beautifully restored luxury apartment in Historic Downtown Bristol.",
      "Just steps -  to shopping, waterfront and parade and bus route.",
      "Granite counter tops",
      "Hardwood flooring",
      "Original woodwork",
      "Washer/Dryer",
      "Pantry  / Storage",
      "Large full bathroom with granite vanity top.",
      "Cable  ready."
    ],
    "duplicates": []
  },
  {
    "price": "$2900",
    "title": "Stunning 2 bed downtown All Utilities Included!",
    "href": "https://providence.craigslist.org/apa/d/bristol-stunning-2-bed-downtown-all/7020668871.html",
    "description": [
      "ALL UTILITIES INCLUDED!  Beautiful and spacious 2 bed apartment in the center of town!  Walk to your favorite restaurants and shops!  Large kitchen with skylight and views of the water! Large master suit with huge closet and master bath, full bath with laundry , plenty of off street parking.  Gleaming hardwood floors throughout.  Elevator in building.  Pets may be negotiable.  First and security, credit check and references required."
    ],
    "duplicates": []
  },
  {
    "price": "$2250",
    "title": "3 Bedroom Apt. - Utilites, cable, internet included",
    "href": "https://providence.craigslist.org/apa/d/3-bedroom-apt-utilites-cable-internet/7018374154.html",
    "description": [
      "Includes ALL utilities and flexible Lease term.  School year, annual, or summer available.",
      "Unique setup to live with your friends but still have privacy",
      "2/3 bedroom apartment + Basement Studio Apartment Attached",
      "Can be completely furnished AirBnb style or empty. Your choice.",
      "10 Years of rentals with very happy tenants (Previous tenant references available upon request)",
      "Includes: All utilities are included water, trash, sewer, heat, elec. even high speed Wireless internet and DVR HD Cox Digital Cable with OnDemand!",
      "Apartment Includes",
      "2X WASHER & DRYER (NOT coin operated!) !",
      "Dishwasher",
      "Garbage Disposal",
      "Apartment layout",
      "1 Mid-size bedrooms (approx 12-11)",
      "1 Smaller Room (approx 11-9)",
      "1 Large Bedroom/Living Room (approx 14-11)",
      "450sqft studio basement living space, with additional kitchen, bathroom and laundry.",
      "3 OFF-STREET parking spaces (no double parking either).  Close to RWU, bars, water, restaurants, and shops",
      "No Pets and No Smoking, Parental co-leasing required or income and good credit",
      "1 Month Security + 1st Month's Rent before moving-in",
      "No realtors involved. I am the owner and I'm very quick dealing with any questions, concerns, or issues.",
      "Email, text, or call Ryan to schedule appointment"
    ],
    "duplicates": []
  },
  {
    "price": "$2475",
    "title": "Luxury Downtown Bristol Apt w/garage, June ‘20 incl. ALL UTILITIES",
    "href": "https://providence.craigslist.org/apa/d/bristol-luxury-downtown-bristol-apt/7023314226.html",
    "description": [
      "3rd floor apartment in a newly built 3 family home. ALL UTILITIES ARE INCLUDED (WATER, HEAT, ELECTRIC, AND GAS). The unit has an open floor plan with hardwood, new kitchen appliances and in unit a washer/dryer. Tenants would sign a one-year lease running from June 2020 thru May 2021.",
      "-\tAll bedrooms are 12' by 12' with a large double door closet.",
      "-\tThe bathroom is updated with tile and has a shower with a tub.",
      "-\tThe 3rd floor has a private deck that leads to a sliding glass door that enters the kitchen.",
      "-\tThere is one garage spot included, 1 private driveway spot and plenty of off-street parking.",
      "-\tQuick walk to the town common area (0.25 miles), restaurants and shops in downtown Bristol (0.6 miles), as well as a short commute to RWU (2 miles).",
      "-\tThe entire unit will be professionally cleaned before move in.",
      "-\tLandlords provide professional snow removal and yard maintenance.",
      "-\tLooking for a 1-year lease from June 2020 thru May 2021",
      "**Feel free to email any questions or to set up a viewing time. Thanks.**"
    ],
    "duplicates": []
  },
  {
    "price": "$2400",
    "title": "RWU Apt in New Home w/Private Parking, Yard, W&D & dishwasher",
    "href": "https://providence.craigslist.org/apa/d/bristol-rwu-apt-in-new-home-private/7023317495.html",
    "description": [
      "This is one side of a large Bristol duplex (40B which is side of duplex furthest from the street) that was built in 2008 and has 3 bedrooms, full kitchen, 1 full bathroom, 1 half bathroom, large living room, private driveway that fits 3 cars per unit and a spacious yard.  This apartment has plenty of storage space in the basement",
      "-\tEach bedroom in the house has a full closet with shelves.",
      "-\tThe kitchen has a refrigerator, stove and dishwasher plus an abundance of cabinet space.",
      "-\tThe kitchen and bathrooms are all in terrific condition as the home was built less than 10 years ago and has been previously rented to individual families.",
      "-\tIn the basement there is a new washer and new dryer (all of which are non-coin operated and are thus free to use by the tenants).",
      "-\tCarpet was replaced throughout the whole house in August of 2016 (all bedrooms, living room, and closets have new rug with padding)",
      "-\tThere is a driveway that easily fits 3 cars for the unit and plenty of off-street parking.",
      "-\tQuick walk to the town common area (0.6 miles), restaurants and shops in downtown Bristol (0.75 miles), as well as a short commute to RWU (2.5 miles).",
      "-\tThe entire unit will be professionally cleaned before move in.",
      "-\tLandlords provide professional snow removal and yard maintenance.",
      "-\tLooking for a 1-year lease from June 2020 thru May 2021.",
      "**Feel free to email any questions or to set up a viewing time. Thanks.**"
    ],
    "duplicates": []
  },
  {
    "price": "$1125",
    "title": "1-BR 2-level townhouse condo Bristol Pines",
    "href": "https://southcoast.craigslist.org/apa/d/1-br-2-level-townhouse-condo-bristol/7057579091.html",
    "description": [
      "2-level town-house condo unit; ideal for a single individual or graduate college student.",
      "AC on both levels, heating is electric baseboard heat.",
      "Kitchen is fully applianced (microwave, fridge/freezer, dishwasher, range). Bathroom has a laundry center (washer$ dryer). First floor living room has a French sliding door opening to a large porch (132 sq ft) in front of the unit. 2nd level full bath has washer & dryer.",
      "NO PETS per condo bylaws.",
      "Rent includes condo fee, water and trash removal; electric utility is tenant's responsibility.",
      "If interested please send text to",
      "show contact info",
      "(preferred) or contact by e-mail."
    ],
    "duplicates": []
  },
  {
    "price": "$1400",
    "title": "House Near Roger Williams, Beach, Town",
    "href": "https://southcoast.craigslist.org/apa/d/bristol-house-near-roger-williams-beach/7046249501.html",
    "description": [
      "Whole House for Rent",
      "54 Walley St.",
      "Bristol, RI",
      "RWU academic year rental! Prime location-1 mile from school!",
      "2 br/1bath, $1400/mo",
      "Cozy 2+ bed/1 bath cottage for rent in historic Bristol, RI. Fully furnished, nicely maintained. Great neighborhood located 1 mile from Rodger Williams University! Two blocks from park, bus line and beach. Walking distance to downtown Bristol. Spacious backyard including private driveway and off street parking. Bright sunny living room, eat-in kitchen, large basement with storage space and laundry.",
      "Available Mid-August through May (RWU academic year)",
      "$1400/mo, tenant responsible for all utilities.  Lawn care is included.",
      "First month's rent and security deposit due at signing.",
      "Approval based on credit check and reference required.",
      "RWU Grad students & Faculty welcome!  No pets, no smokers.",
      "Call for appointment",
      "Anne -",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1200",
    "title": "3 BEDROOM HOUSE FOR RENT",
    "href": "https://southcoast.craigslist.org/apa/d/bristol-3-bedroom-house-for-rent/7039496250.html",
    "description": [
      "3 SPACIOUS BEDROOM APARTMENT FOR RENT... FRANCIS BROTHERS REALTY",
      "Please call",
      "show contact info",
      "or",
      "show contact info",
      "3 Bed... 1 Bath",
      "... serious inquires only please call Mrs. Francis at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1500",
    "title": "Apartment for Rent",
    "href": "https://providence.craigslist.org/apa/d/bristol-apartment-for-rent/7057831810.html",
    "description": [
      "Completely renovated first floor2 bedroom located in downtown Bristol.  New kitchen, new flooring, laundry is in unit. Walk to shops, restaurants, bike path, town common and Bristol harbor. Large fenced in yard."
    ],
    "duplicates": [
      null,
      null,
      null
    ]
  },
  {
    "price": "$700",
    "title": "UTILITIES INCLUDED. King Philip Inn.  SAMSON REALTY 5406",
    "href": "https://providence.craigslist.org/apa/d/bristol-utilities-included-king-philip/7048929634.html",
    "description": [
      "About This Property:",
      "First floor studio including utilities.  Near CVS Plaza and other stores.  Close to Roger Williams University.  Great space with an amazing price!",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 5406    samsoneastbay",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 5406992677075224.5979998381959217705829740510703587066559487280993082380855902635992180281478044607247083919095401105692359682022531713187610314013466095399321610661169188846560736464"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1100",
    "title": "1st floor apartment",
    "href": "https://providence.craigslist.org/apa/d/bristol-1st-floor-apartment/7044657737.html",
    "description": [
      "1st floor, large kitchen, private storage , washer/dryer hookup   Short walk to downtown and minutes away from RWU   Ready February 1. Text",
      "show contact info"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$2200",
    "title": "LG Bristol Apt w/new remodeled bathroom, garage & yard",
    "href": "https://providence.craigslist.org/apa/d/bristol-lg-bristol-apt-new-remodeled/7040595457.html",
    "description": [
      "This is a large 2nd floor apartment in a 2 family Bristol home that is offered to a group of 4. This unit has a large living room and 3 bedrooms. One of the 2nd floor bedrooms and the living room contains new rugs while the other 2 bedrooms all have hardwood floors. Both living room rugs and the bedroom rug will be professionally cleaned before new tenants move in. The kitchen has a refrigerator, stove and dishwasher.",
      "- The unit will have 2 tenants share the large back bedroom which has 2 closets. The other 2 tenants will have their own bedroom.",
      "- There is a large Basement with plenty of room for the tenants to mingle with guests as well as 2 entrances/exits (1 of which leads to the backyard). The basement has its own bathroom and sink.",
      "- New washer and new dryer free to use by the tenants in the basement.",
      "- In January of 2019 the  bathroom was completely gutted out and renovated to now include new tile, granite vanity with 2 sinks, new toilet, new light fixtures/ceiling fan/mirrors, and a new large shower with specially ordered “frosted” door.",
      "- The home itself sits on 12,000 square foot property that has an enormous yard maintained by the owners and available for use by the tenants that includes an outdoor patio and fire pit.",
      "- The unit will have access to 1 spot in the private driveway and 1 spot in the 2 car garage along with plenty of off-street parking.",
      "- Quick walk to the town common area (0.9 miles), restaurants and shops in downtown Bristol (1.5 miles), as well as a short commute to RWU (1.5 miles).",
      "- The entire unit will be professionally cleaned before move in.",
      "- Landlords provide professional snow removal and yard maintenance.",
      "- Lease will run for one year from June 2020 thru May 2021.",
      "**Feel free to email any questions or to set up a viewing time. Thanks.**"
    ],
    "duplicates": [
      null,
      null
    ]
  }
]