[
  {
    "price": "$850",
    "title": "This cozy Excelsior home is move in ready!",
    "href": "https://providence.craigslist.org/apa/d/clayville-this-cozy-excelsior-home-is/7050691330.html",
    "description": [
      "NEW UPDATED DUPLEX FEATURING GRANITE COUNTERS, TILE AND GORGEOUS HARDWOOD LAMINATE THROUGHOUT. WALK INTO WIDE OPEN LIVING ROOM AND DINING ROOM. BREAKFAST BAR OPENS TO KITCHEN WITH LOVELY CABINETS, LARGE REFRIGERATOR, GAS STOVE WITH 5 ELEMENTS, MICROWAVE AND DISHWASHER. HUGE PANTRY! HALF BATH ON MAIN FLOOR. WIDE AND OPEN STAIRS TO 2ND FLOOR FEATURING 3 SMALLER BEDROOMS AND FULL BATH. GAS HEAT AND CENTRAL AIR! PRIVATE FULL BASEMENT WITH NEW WASHER/DRYER AND LAUNDRY TUB. SECURITY CAMERAS SURROUNDING PROPERTY, STORM DOORS AND 2 OFF STREET PARKING SPOTS. LANDLORDS NEXT DOOR. THIS DUPLEX IS COMPLETE AND READY TO WELCOME YOU HOME!   If you are interested contact me at",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1650",
    "title": "2 Bedroom Ranch for rent $1650. per month",
    "href": "https://providence.craigslist.org/apa/d/clayville-2-bedroom-ranch-for-rent-1650/7050123754.html",
    "description": [
      "Spacious (1680sqft) Custom Ranch, 2 bdrm, 1 bath,Eik, Din/Lv rm, 3 season enclosed sun room, fully appliance'd w/d flat top electric stove, microwave, frig, dishwasher & dryer ( in basement) , dehumidifier, forced hot air-oil fired heating system, generator ready. House has recently been \"refreshed/painted\" in & out, has hardwoods & carpeted. Ample parking, security lighting, ample yard, storage shed. Property is approx 3 acres & abuts watershed property. Credit check & CBC required ! NO PETS- NO SMOKING- NO EXCEPTIONS !! Need 24hr notice for showings. Call",
      "show contact info",
      "for appointment!"
    ],
    "duplicates": []
  },
  {
    "price": "$675",
    "title": "Newly Remodeled Apartment For Rent!",
    "href": "https://providence.craigslist.org/apa/d/clayville-newly-remodeled-apartment-for/7035996177.html",
    "description": [
      "Beautiful and thoroughly unique south-facing townhouse at Corliss Landing is now available for rent. The main level features oak floors in the living area, cherry floors in the dinging room, and red clay tile in the kitchen and half bath. All doors and cabinets in the kitchen are custom. Granite counters and stainless steel appliances along with custom organization features make this a superb kitchen for a a city home. There is a built in bar and sideboard separating the living room and dining rooms but still allowing for open space between the two areas. Original beams add to the charm. Master bedroom has sliding doors leading to a balcony overlooking the peaceful, beautifully maintained courtyard. The stairway and second floor hallway have brand new berber carpeting and both upstairs bedrooms have new laminate floors. There is a full sized washer and dryer within the second bath.  Please contact here",
      "show contact info",
      "to set up a showing."
    ],
    "duplicates": []
  },
  {
    "price": "$800",
    "title": "Apartment available in cranston",
    "href": "https://providence.craigslist.org/apa/d/clayville-apartment-available-in/7034290393.html",
    "description": [
      "Apartment available now 3 br"
    ],
    "duplicates": []
  }
]