[
  {
    "price": "$950",
    "title": "Spacious 3 bedroom apart",
    "href": "https://providence.craigslist.org/apa/d/forestdale-spacious-3-bedroom-apart/7038999636.html",
    "description": [
      "This is a spacious 3 bedroom apartment, All rooms with closets and plenty of kitchen cabinet space. They rent is $950 and deposit of $950 For showings and additional info please contact me at",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$950",
    "title": "One Bedroom Apartment",
    "href": "https://providence.craigslist.org/apa/d/forestdale-one-bedroom-apartment/7043133122.html",
    "description": [
      "Recently renovated one bedroom apartment in North Smithfield with easy access to route 102, 146 and 295.  Heat and hot water included.  Coin operated laundry.  Includes upgraded kitchen with Corian countertops and outdoor deck/patio.  Applicant must have prior rental and credit history.  No pets and no smoking.  Available Jan 15, 2020."
    ],
    "duplicates": []
  },
  {
    "price": "$0",
    "title": "Affordable, Pet Friendly and Smoke Free- This is the place to be!",
    "href": "https://providence.craigslist.org/apa/d/forestdale-affordable-pet-friendly-and/7041245491.html",
    "description": [
      "Fairmont Heights Apartments is an affordable housing community that is professionally managed by Picerne Real Estate Group. Our affordable housing communities offer quality housing for the elderly and disabled!",
      "We have spacious one and two bedroom apartments with your ease of living in mind. With plenty of living space, equipped kitchens, great closet space, on-site laundry facilities and 24-hour maintenance, Fairmont Heights Apartments will be a great place for you to call home. All of our apartment communities are pet friendly and smoke-free!",
      "Our goal is to provide you with a home that exceeds your needs as a resident while providing outstanding customer service. All of our locations are presently accepting applications with an open waiting list. Email us to secure your placement with the best affordable housing in the region!"
    ],
    "duplicates": []
  }
]