[
  {
    "price": "$1200",
    "title": "*********SMITHFIELD  APARTMENT  FOR  RENT ******************",
    "href": "https://providence.craigslist.org/apa/d/greenville-smithfield-apartment-for/7058614276.html",
    "description": [
      "CHARMING & QUIET, **1ST  FLOOR** ( NO STAIRS ), 1 BEDROOM, UPDATED KITCHEN, BATH WITH SHOWER, APPLIANCES, PRIVATE PATIO, PARKING, ** ALL UTILITIES INCLUDED!**  SORRY, NO PETS.  CALL OR TEXT LISA AT",
      "show contact info",
      "."
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1200",
    "title": "****** SMITHFIELD APARTMENT FOR RENT *******************",
    "href": "https://providence.craigslist.org/apa/d/greenville-smithfield-apartment-for/7058422035.html",
    "description": [
      "CHARMING & QUIET, 1ST FLOOR ( NO STAIRS ), 1 BEDROOM, UPDATED KITCHEN, BATH WITH SHOWER, APPLIANCES, PRIVATE PATIO, PARKING, ** ALL UTILITIES INCUDED!**  SORRY, NO PETS ALLOWED.  CALL OR TEXT LISA AT",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1100",
    "title": "Secluded 1 bed, 1 bath house in an Historic farm cottage",
    "href": "https://providence.craigslist.org/apa/d/greenville-secluded-1-bed-1-bath-house/7058573581.html",
    "description": [
      "Surrounded by nature, you won’t want to miss this secluded 1 bed, 1 bath house in an Historic farm cottage. This single floor home has a dining room, living room, small room for storage/office, and kitchen. Original pine floors in bedroom, living room and dining room. Fireplaces are non-functional and decorative only. There are washer/dryer hook-ups in the basement and some storage space in the attic. Washer/dryer not provided. Tenant pays for heat, electricity and propane gas for cooking. Parking for 2 cars, no smoking, no pets. Month-to-Month Lease. Available February 1st or sooner. Email for more information. First month’s rent, Last month’s rent & Security deposit required at lease signing. Rent is $1,100.00 per month."
    ],
    "duplicates": []
  },
  {
    "price": "$1300",
    "title": "PERFECT RENTAL AVAILABLE TODAY",
    "href": "https://providence.craigslist.org/apa/d/greenville-perfect-rental-available/7058379269.html",
    "description": [
      "Nice 3 bed, 2 bath single family home . This comfortable, well built home features large eat in kitchen, hardwoods throughout and a large family room. There is a spacious deck and backyard, one car garage and laundry Appliances available. Tenant responsible for heating oil, water and electricity. Landlord willing to discount rent with multi year lease. Contact Michael Waters to schedule a showing."
    ],
    "duplicates": []
  },
  {
    "price": "$1950",
    "title": "***SINGLE FAMILY,,SERENE VIEWS FROM EVERY WINDOW, NICE!5 Mins to Hwys",
    "href": "https://providence.craigslist.org/apa/d/greenville-single-familyserene-views/7058314562.html",
    "description": [
      "Beautiful home on a tree lined Street",
      "Located on the Johnston/ Greenville Line",
      "close to route 44 Stores- banks, restaurants, Apple Valley Mall, Smithfield Crossings, Stop and Shop , Library",
      "Spectacular, serene views from every window, of woods, trees, nice homes",
      "Highway access minutes away to 295, 95, 6, 10",
      "20 minutes to South Attleboro commuter rail",
      "Oversized kitchen",
      "Spacious rooms",
      "Sizable Bedrooms",
      "Hardwoods throughout",
      "Fireplace in Living Room",
      "Wooded views from kitchen window",
      "Lots of closets",
      "Good sized unfinished basement for laundry and storage.",
      "Full bathroom on one level, half bath on other",
      "Totally fenced in large yard",
      "Deck off kitchen with privacy fence",
      "Pets case by case basis",
      "20 minutes to Attleboro commuter train station",
      "CALL",
      "show contact info",
      "or EMAIL. Leave best time you can be reached ,  and best time you would like to view.",
      "Other Mass. cities and towns near Woonsocket , RI: :Athol, Attleboro, Baldwinville, Barre, Bellingham, Blackstone, Boston, Braintree.,Brockton, Brookfield, Brookline, Clinton, Cordaville, Dedham, Devens, East Brookfield, East Douglas, Fall River, Fiskdale, Fitchburg, Franklin, Foxborough, Foxboro,Gardner,  Hopedale, Holbrook, Leominster, Lunenburg, Mansfield, Medway, Medfield, Mendon, Milford, Millville, North Attleboro, North Brookfield, Milton, Needham. New Bedford, Northborough, Norwood, Oxford, Petersham, Plainville, Quincy, Randolph, Raynham, Rutland, Seekonk, Sharon, Somerset, South Ashburnham, South Lancaster, Southbridge , Spencer, Sturbridge, Swansea, Taunton, Upton, Uxbridge, Walpole, Warren, Webster, Wellesley, West Brookfield. Westborough, Whitinsville, Winchendon. Worcester, Wrentham, and other Mass cities and towns.",
      "ther RI cities and towns near Woonsocket",
      "Rhode Island: Barrington, Bristol, Burrillville, Central Falls, Chepachet,  Coventry, Cranston. Cumberland, RI; East Greenwich, East Providence, Exeter, Foster, Glocester ,Greenville,  Harrisville, Johnston, Lincoln, North Providence, North Smithfield, Pascoag, Providence, Pawtucket, Scituate, Smithfield, Warren, Warwick, West Warwick and other RI towns and cities."
    ],
    "duplicates": []
  },
  {
    "price": "$900",
    "title": "$900 - 1 Bedroom Apartment Smithfield",
    "href": "https://providence.craigslist.org/apa/d/bedroom-apartment-smithfield/7056395150.html",
    "description": [
      "1 Bedroom fully applianced, Parking for 2 cars per unit.",
      "Located conveniently in the center of Greenville close to all amenities.",
      "End unit apartment, loft apartment. Upstairs loft to bedroom, ceiling is peaked.  $900 per month. Heat, Hot Water  &Electric included.",
      "5 other apartments in complex.",
      "NO PETS IN THIS UNIT - CATS OR DOGS!",
      "Looking for single person or couple, sorry not looking for someone with kids, as it is a small apartment.",
      "WILL NOT DO ANY LEASES UNDER 6 MONTHS OR MONTH TO MONTH **",
      "Looking for someone for move in for Feb. 1st.",
      "1st months rent and security deposit due upon moving in with a one year lease.",
      "Background check required, no section 8.",
      "Call/text for more information or to schedule appointment to view."
    ],
    "duplicates": []
  },
  {
    "price": "$1400",
    "title": "Apply Today And Enjoy Your New Home!",
    "href": "https://providence.craigslist.org/apa/d/greenville-apply-today-and-enjoy-your/7055058213.html",
    "description": [
      "Three bedroom rental available for Bryant University students. 13 minute drive to Bryant University. Fully furnished. Finished basement with second bathroom. Appliances included. Washer/dryer in unit. Private deck and yard. Off street parking. Owner pays for water, sewer, and internet."
    ],
    "duplicates": []
  },
  {
    "price": "$1470",
    "title": "Happy New Year at American Wire! 10-214",
    "href": "https://providence.craigslist.org/apa/d/pawtucket-happy-new-year-at-american/7049200653.html",
    "description": [
      "This sweet 2 bedroom/2 bathroom apartment has so much character, it practically decorates itself! American Wire Residential Lofts is a chic, upscale rental community in Pawtucket, RI, just minutes from Providence and all the great shopping, dining & entertainment city has to offer.",
      "All our apartments have sleek, modern kitchens, in-home washer and dryers, central air and gas heat. Our top floor units also have their own cozy fireplaces.",
      "American Wire residents also enjoy an assortment of onsite amenities, including 24 hour fitness center, community game room, indoor half basketball court, theatre room, and an outdoor patio & grilling area. No detail has been overlooked in this beautifully renovated historic mill!",
      "We are a pet friendly community and we’d be happy to review our pet policy with you, call today for more information!",
      "Owned and professionally managed by Brady Sullivan Properties.",
      "See our various floor plans, and picture yourself making our apartments your new home. www.bradysullivan.com",
      "Our leasing office is open 6 days a week, Monday thru Saturday 8:30 AM to 5 PM and Thursday 8:30 AM to 7 PM.",
      "Stop by American Wire at 413 Central Ave!",
      "To schedule a personal tour, call us today at",
      "show contact info",
      "or click on the REPLY box above for our email contact info.",
      "*Prices and special are subject to change at any time.  Photos may represent similar unit.",
      "NA",
      "Cranston, RI, Attleboro, MA, Central Falls, RI, Valley Falls, RI, Providence, RI, East Providence, RI, North Providence, RI, Cumberland, RI, Cranston, RI, Greenville, RI, Smithfield, RI, Barrington, RI, North Smithfield, RI, Woonsocket, RI."
    ],
    "duplicates": []
  },
  {
    "price": "$1900",
    "title": "House for rent",
    "href": "https://providence.craigslist.org/apa/d/greenville-house-for-rent/7030450265.html",
    "description": [
      "One family house for rent three bedrooms one bath family room  cathedral ceilings in kitchen with cherry cabinets hardwood floors granite countertops finished basement with office.  Security system.  Full yard and big deck with playground electric included. 2 1/2 miles from Interstate 295. Great school systems, Dead end road, very private.  Entire interior just painted, New range, modern appliances.  Snow removal and landscaping included. NO PETS.",
      "Appointments necessary for a showing."
    ],
    "duplicates": []
  },
  {
    "price": "$1200",
    "title": "*********SMITHFIELD  APARTMENT  FOR  RENT ******************",
    "href": "https://providence.craigslist.org/apa/d/greenville-smithfield-apartment-for/7058614276.html",
    "description": [
      "CHARMING & QUIET, **1ST  FLOOR** ( NO STAIRS ), 1 BEDROOM, UPDATED KITCHEN, BATH WITH SHOWER, APPLIANCES, PRIVATE PATIO, PARKING, ** ALL UTILITIES INCLUDED!**  SORRY, NO PETS.  CALL OR TEXT LISA AT",
      "show contact info",
      "."
    ],
    "duplicates": [
      null
    ]
  }
]