[
  {
    "price": "$1600",
    "title": "BRAND NEW TOWNHOUSES!!",
    "href": "https://providence.craigslist.org/apa/d/kenyon-brand-new-townhouses/7049532599.html",
    "description": [
      "*6 MILES TO URI*",
      "Perfect for professors, adjuncts, or quiet couples looking for a sanctuary!",
      "All brand new, top of the line appliances-- all the bells and whistles.",
      "Too much to list, so check out the photos!",
      "Yearly Rent- Charlestown, Rhode Island Move in date 2/1/20 or potentially sooner:  3 DUPLEXES FOR RENT (6 UNITS TO CHOOSE FROM)  1150 SQUARE FEET OF LIVING SPACE 600 SQUARE FEET OF BASEMENT SPACE 360 SQUARE FEET OF GARAGE SPACE 2 Large Bedrooms Upstairs with plenty of closet space *Bedroom - 12 x 18 * Bedroom - 11 x 11 1 Full Bath Upstairs 1/2 Bath Downstairs with pocket door Pick your unit TODAY! Full Basement Full 1 car extended length garage All high efficiency appliances! High Efficiency Electric Heat Pump/ Central Air Washer/Dryer In Unit (Upstairs) Dishwasher, Electric Stove, Microwave over the range Granite Countertops, Lifeproof Floors, Plush Carpet upstairs Very private, and ALL BRAND NEW! Landscaping to be done in the spring $1600/month, includes lawn maintenance, snow plowing",
      "NO PETS, NO SMOKING Credit Check/ BCI Email **** if you are interested!",
      "Lease Terms",
      "Yearly Rental  Move in 2/1/20 1st & Security Due at Lease Signing BCI & Credit History Check  All interested must fill out application FIRST"
    ],
    "duplicates": []
  },
  {
    "price": "$900",
    "title": "Large 2 BR Close to URI and Beach",
    "href": "https://providence.craigslist.org/apa/d/kenyon-large-2-br-close-to-uri-and-beach/7024086736.html",
    "description": [
      "Large 2 BR second floor apartment, newly renovated, huge private yard, washer dryer hookup, newer appliances, new carpet, new paint, and bath fixtures.  New efficient gas heat just installed!  Large eat in kitchen and large living room, with 8 x 12 outside deck.  Second floor apt in 3 family situated on 2 acres.   Available January 15th.  No smokers, no pets except handicapped necessary.  $900/month"
    ],
    "duplicates": []
  },
  {
    "price": "$800",
    "title": "Studio Apartment",
    "href": "https://newlondon.craigslist.org/apa/d/kenyon-studio-apartment/7048890524.html",
    "description": [
      "Studio apt. On beautiful country estate. 1bedroom, full kitchen/sitting area, full bath. Utilities included. References required."
    ],
    "duplicates": []
  }
]