[
  {
    "price": "$1800",
    "title": "WINTER FURNISHED RENTAL: 2BR/2BA Cape Available Now!",
    "href": "https://providence.craigslist.org/apa/d/little-compton-winter-furnished-rental/7049533845.html",
    "description": [
      "Wonderful WINTER, FURNISHED RENTAL: 2BR Cape Cod with two full baths, garage and finished lower level that includes almost 1,000sf of additional living space, separate room, washer/dryer and full bath.  Main level has two bedrooms, full bath, large living room, kitchen and Florida Room.  Water is included.  Pets negotiable.  Available until the middle of May."
    ],
    "duplicates": []
  },
  {
    "price": "$1500",
    "title": "Rental Apartment Little Compton",
    "href": "https://providence.craigslist.org/apa/d/little-compton-rental-apartment-little/7051105892.html",
    "description": [
      "Apartment. Year round. Beautiful Little Compton.",
      "Deck, Large yard, garden.  Hardwood floors. Laundry hook up.",
      "Please view at RentalsLittleCompton(dot)com.",
      "Click on Apartment #2. See photos and floor plan.",
      "One or Two people ONLY.  Small dog only and pending breed."
    ],
    "duplicates": []
  },
  {
    "price": "$1000",
    "title": "Cottage/Cabin Wanted for April 1st",
    "href": "https://providence.craigslist.org/apa/d/little-compton-cottage-cabin-wanted-for/7050905398.html",
    "description": [
      "Hello,",
      "I am a quiet, clean, non-smoking, professional in search of a small cottage or cabin for rent for April 1st. It doesn't have to be anything fancy and we don't require much space.",
      "The cottage will be for myself and my 10 year old bulldog who is non-destructive, quiet, and spends most of his time sleeping.",
      "I am currently living in a seasonal rental in Little Compton. I would love to stay in the area or surrounding areas.",
      "Please let me know if you have a rental available that may suit us.",
      "Thank you!"
    ],
    "duplicates": []
  },
  {
    "price": "$1200",
    "title": "Little Compton: Ocean views, walk to the beach.",
    "href": "https://providence.craigslist.org/apa/d/little-compton-ocean-views-walk-to-the/7047875848.html",
    "description": [
      "2 bedrooms, 1 bath ranch with ocean views. Email or text for availability.",
      "$1,200 per month. Available now through May 31, 2020. Fully furnished. Bright and airy with ocean views from the living room, dining room, master bedroom, office, and front porch. Master bedroom has a full-sized bed; second bedroom has a queen-sized bed. Third small room (also with an ocean view) could be used as an office or small bedroom.Washer/dryer and all appliances (refrigerator, electric stove, dishwasher, microwave, coffeemaker, vacuum cleaner, iron/ironing board, etc.). Linens and towels provided. Large assortment of kitchenware: glasses, dishes, and cooking utensils.  Flat-screen television. Cable and Internet are not included; they must be arranged and paid for by the tenant. NO PETS OR SMOKING. Outdoor furniture for front porch and back deck. Outdoor shower with hot and cold water as well as a clothesline. A window-unit air conditioner is provided, though rarely needed; fans supplied. Single stall attached garage with garage door opener.",
      "Sample review from previous summer renter:",
      "I've been visiting Little Compton since I was a child, but I think of my vacations at Jim and Diane's house as the essential Little Compton experience. I rented it for two consecutive years -- for a month in August 2015, and again for the entire summer of 2016. The house is very comfortable and has everything you need, particularly a well-stocked kitchen. The house is in Indian Rock Acres, off the main road, so it's quiet--you never hear any traffic, even though you're so close to the beach. What I liked best and will always remember: making a cup of coffee and sitting on the front porch in time to watch the sun rise over the ocean. Doing the same at the end of the day, watching the sunset, with a glass of wine. Constant breezes from the water, which make the house feel airy and wide open. Walking to the beach.",
      "Patty F., Rumford, RI"
    ],
    "duplicates": []
  }
]