[
  {
    "price": "$0",
    "title": "TANNING SALON FOR LEASE",
    "href": "https://providence.craigslist.org/apa/d/tanning-salon-for-lease/7058343022.html",
    "description": [
      "Tanning Salon for lease, Narragansett, fully equipped prime location.",
      "Please call Youseff",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$750",
    "title": "!!, QUAINT, CHARMING,  ONE ROOM EFFICIENCY--COTTAGE,! SECTION 8 OK ***",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-quaint-charming-one/7058316489.html",
    "description": [
      "HOME IS IN NORTH KINGSTOWN --Note: This is not a one bedroom, it's a ONE ROOM EFFICIENCY COTTAGE!!",
      "NO UTILITIES INCLUDED",
      "LOOKING FOR PRIVACY with no one over your head?",
      "Not your typical single family!!!",
      "If you like a Tiny House , you may like this charming",
      "ONE ROOM tiny cottage .",
      "It's only 12 by 13/14.",
      "PICTURES 4, 5, 6 SHOW ENTIRE KITCHEN SIZE",
      "PICTURES 11 THE COMBINED LIVING ROOM AND BEDROOM",
      "You can fit a tiny round table in kitchen",
      "You can fit one pull out bed and a bureau in",
      "the carpeted section.",
      "Picture 11 shows the tile kitchen ending and room beginning",
      "Picture 12 shows the outside. It is the second cottage.",
      "For the minimalist!",
      "Close to Carriage Inn Restaurant, highways,",
      "Very quiet , peaceful, area  with",
      "stable , long term residents",
      "Sits back from the Road",
      "Has kitchenette , bathroom , and one room which",
      "combines as a bedroom /Living room",
      "DOES NOT  have a loft.",
      "Suitable for one.",
      "Pets considered on a case by case basis. Fees may apply.",
      "Nice sized  deck",
      "Nice serene yard",
      "Parking lot close to the cottage",
      "Pets on a case by case basis",
      "Have year lease .",
      "Short term leases at different rate.",
      "Email or call",
      "show contact info",
      ". Please leave message with the best time you can be reached or when you would like to view.",
      "Other Mass. cities and towns near Woonsocket , RI: :Athol, Attleboro, Baldwinville, Barre, Bellingham, Blackstone, Boston, Braintree.,Brockton, Brookfield, Brookline, Clinton, Cordaville, Dedham, Devens, East Brookfield, East Douglas, Fall River, Fiskdale, Fitchburg, Franklin, Foxborough, Foxboro,Gardner,  Hopedale, Holbrook, Leominster, Lunenburg, Mansfield, Medway, Medfield, Mendon, Milford, Millville, North Attleboro, North Brookfield, Milton, Needham. New Bedford, Northborough, Norwood, Oxford, Petersham, Plainville, Quincy, Randolph, Raynham, Rutland, Seekonk, Sharon, Somerset, South Ashburnham, South Lancaster, Southbridge , Spencer, Sturbridge, Swansea, Taunton, Upton, Uxbridge, Walpole, Warren, Webster, Wellesley, West Brookfield. Westborough, Whitinsville, Winchendon. Worcester, Wrentham, and other Mass cities and towns.",
      "ther RI cities and towns near Woonsocket",
      "Rhode Island: Barrington, Bristol, Burrillville, Central Falls, Charlestown, Chepachet,  Coventry, Cranston. Cumberland, RI; East Greenwich, East Providence, Exeter, Foster, Glocester ,Greenville,  Harrisville, Hopkington, Jamestown,  Johnston, Lincoln, Narragansett , Newport, North Providence, North Smithfield, Pascoag, Providence, Pawtucket, Richmond, Scituate, Smithfield, Warren, Warwick, West Warwick, Westerly  and other RI towns and cities."
    ],
    "duplicates": []
  },
  {
    "price": "$1600",
    "title": "2 Bedroom private home for rent",
    "href": "https://providence.craigslist.org/apa/d/saunderstown-2-bedroom-private-home-for/7057384444.html",
    "description": [
      "2 BEDROOM HOME LOCATED IN DESIRABLE HAMILTON SECTION OF NORTH KINGSTOWN, GLEAMING HARDWOOD FLOORS THROUGHOUT, FULLY APPLIANCED KITCHEN SLIDERS TO DECK OVERLOOKING PRIVATE FENCED IN YARD, FORMAL DINING ROOM, LARGE LIVING ROOM WITH BAY WINDOW WITH WINTER VIEWS OF SALT WATER MARSH, HAMILTON BEACH ASSOCIATION, DEEDED RIGHT OF WAY TO ANTHONY'S BEACH,WASHER AND DRYER SUPPLIED BY OWNER, WATER,TRASH REMOVAL AND SEPTIC AND LAWN MAINTENANCE ARE ALL HANDLED BY OWNER, SNOW REMOVAL HANDLED BY TENANT, CENTRAL AIR, FULL UNFINISHED BASEMENT WITH PLENTY OF STORAGE SHELVES AND CLOSETS WITH WASHER AND DRYER, CARPORT AND ADDITIONAL PARKING FOR TWO VEHICLES. AVAILABLE FOR OCCUPANCY FEBRUARY 1ST."
    ],
    "duplicates": []
  },
  {
    "price": "$1010",
    "title": "2 Bedroom Includes Heat, gas, and Electric.",
    "href": "https://providence.craigslist.org/apa/d/east-greenwich-2-bedroom-includes-heat/7051562458.html",
    "description": [
      "Clean, Quite Neighborhood, LARGE Yard, off street parking, Spacious, in older Multi family building, Great mature neighbors, Lots of character. First Floor, Galley style Kitchen with room for a table, 2 Bedroom, one on first floor one on the 2nd floor. Sunny unit.  Bathroom has a tub  $1010.00 per month ALL UTILITIES INCLUDED, Except AC, if you want it AC we charge $ 10.00 per week for each week you have one installed.  Heat, Gas, hot water, and Electric Located on the HUNT RIVER Great FISHING HOLE and launching area for PADDLING! Sorry No Washer or Dryer hookups. Only 2 minutes to the highway. Near the East Greenwich line.",
      "The ceiling are low please if you are over 5'9\" you are to tall and will not be happy!"
    ],
    "duplicates": []
  },
  {
    "price": "$1575",
    "title": "Stay Warm By The Fireplace! Beautiful 2Bed/2Bath February 1st!",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-stay-warm-by-the/7037046349.html",
    "description": [
      "LUXURY LIVING AT COMFORTABLE COSTS",
      "SAW MILL SQUARE APARTMENTS",
      "DETAILS:",
      "Bedrooms:",
      "2",
      "Bathrooms:",
      "2",
      "Square Feet:",
      "1150ft",
      "Parking Spaces:",
      "1 assigned included with plenty of visitor parking.",
      "Available:",
      "February Availability!",
      "Price:",
      "Starting at $1575.00!",
      "Welcome to",
      "SAW MILL SQUARE APARTMENTS!",
      "South County’s Premiere Residential Community welcomes our BRAND NEW Luxury 2 bed apartments leasing now for December 2019! We are a professionally managed apartment community with 24hr maintenance staff located in North Kingstown close to The Shoppes at Quonset!  Conveniently located minutes from everything you could want!  Easy highway access, short distance to grocery, entertainment, bars, restaurants as well as the Wickford Junction MBTA!\n\nOur spacious 2 bedroom/ 2 bath luxury apartments feature everything you could want in your new home!",
      "Features Include:",
      "Stainless-steel appliances and quartz counter tops!",
      "Washer and dryer in every unit!",
      "Large patio/deck area for your own private use!",
      "Vaulted ceilings and extra closet space in select units.",
      "These beautiful apartments also include secure access, assigned parking, free storage unit on-site as well as access to our Clubhouse!",
      "Our Clubhouse amenities include :",
      "Gym",
      "Theater Room",
      "Activity room with beautiful fireplace and partial kitchen",
      "Patio area with grill for use during warmer weather",
      "Looking for extreme comfort and convenience? Look no further!  \n **If you lease prior to January 1st you will qualify for move in incentives. \n",
      "The Village at Saw Mill Square is pet-free and smoke-free!  Contact us today to set up a tour, you do not want to miss out on these brand-new units!\n",
      "PLEASE CONTACT US AT:",
      "LEASING OFFICE :",
      "show contact info",
      "OR",
      "Visit us at:",
      "https://sawmillsquare.com/",
      "80 Saw Mill Drive",
      "North Kingstown, RI 02852"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1590",
    "title": "Brand New Luxury 2 Bedroom Apartments! Call Today & Schedule A Tour!",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-brand-new-luxury-2/7018837893.html",
    "description": [
      "LUXURY LIVING AT COMFORTABLE COSTS",
      "SAW MILL SQUARE APARTMENTS",
      "DETAILS:",
      "Bedrooms:",
      "2",
      "Bathrooms:",
      "2",
      "Square Feet:",
      "1150ft",
      "Parking Spaces:",
      "1 assigned included with plenty of visitor parking.",
      "Available:",
      "December 15th!",
      "Price:",
      "Starting at $1590.00!",
      "Welcome to",
      "SAW MILL SQUARE APARTMENTS!",
      "South County’s Premiere Residential Community welcomes our BRAND NEW Luxury 2 bed apartments leasing now for December 2019! We are a professionally managed apartment community with 24hr maintenance staff located in North Kingstown close to The Shoppes at Quonset!  Conveniently located minutes from everything you could want!  Easy highway access, short distance to grocery, entertainment, bars, restaurants as well as the Wickford Junction MBTA!\n\nOur spacious 2 bedroom/ 2 bath luxury apartments feature everything you could want in your new home!",
      "Features Include:",
      "Stainless-steel appliances and quartz counter tops!",
      "Washer and dryer in every unit!",
      "Large patio/deck area for your own private use!",
      "Vaulted ceilings and extra closet space in select units.",
      "These beautiful apartments also include secure access, assigned parking, free storage unit on-site as well as access to our Clubhouse!",
      "Our Clubhouse amenities include :",
      "Gym",
      "Theater Room",
      "Activity room with beautiful fireplace and partial kitchen",
      "Patio area with grill for use during warmer weather",
      "Looking for extreme comfort and convenience? Look no further!  \n **If you lease prior to January 1st you will qualify for move in incentives. \n",
      "The Village at Saw Mill Square is pet-free and smoke-free!  Contact us today to set up a tour, you do not want to miss out on these brand-new units!\n",
      "PLEASE CONTACT US AT:",
      "LEASING OFFICE :",
      "show contact info",
      "OR",
      "Visit us at:",
      "https://sawmillsquare.com/",
      "80 Saw Mill Drive",
      "North Kingstown, RI 02852"
    ],
    "duplicates": []
  },
  {
    "price": "$1250",
    "title": "Beautifully remodeled pet friendly 2br/1ba",
    "href": "https://providence.craigslist.org/apa/d/saunderstown-beautifully-remodeled-pet/7053052419.html",
    "description": [
      "Absolutely beautiful 2 Bed/1Bath first floor apartment. Well maintained building with just four units total. Off Street Parking. This location can't be beat with convenience to RT1, RT4, and Wickford Junction Train Station. Recently refinished hardwood Floors throughout, kitchen with granite counters, stainless steel appliances, tons of storage in the separated basement storage area. Washer/Dryer hookups provided in basement. Tenants pay Utilities. Rent includes water, snow removal, and grounds maintenance. Pets are Negotiable and will incur additional rent of $50 per pet, per month. First Month and Security deposit. Not qualified for Section 8. Non smoking property. Credit and Background check required."
    ],
    "duplicates": []
  },
  {
    "price": "$1400",
    "title": "North Kingstown 2 Bed 1 Bath",
    "href": "https://providence.craigslist.org/apa/d/east-greenwich-north-kingstown-2-bed-1/7050120738.html",
    "description": [
      "This 2nd floor apartment is located near Rt 95 and has a private entrance. The unit offers 2 bedrooms with carpets,  1 bath and an eat-it kitchen. You also get a shared yard with off street parking. Rent also includes heat and hot water.",
      "Non-refundable $35 fee for Credit and Background check required",
      "Text for a quicker response to schedule a showing!"
    ],
    "duplicates": []
  },
  {
    "price": "$2350",
    "title": "Wickford cove Cottage",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-wickford-cove-cottage/7049784438.html",
    "description": [
      "Charming, beautifully landscaped, waterfront cottage on historic Wickford cove.",
      "Stylish furnishings, ready to move in. Enjoy your favorite beverage on the spacious deck overlooking the 100 foot dock with unobstructed views of the most beautiful sunsets Rhode Island has to offer. For pictures see VROB under that address."
    ],
    "duplicates": []
  },
  {
    "price": "$1500",
    "title": "2 Bedroom 1.5 bath condo",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-2-bedroom-15-bath-condo/7047403622.html",
    "description": [
      "Two bedroom 1.5 bathroom condo situated in desirable Caddy Rock. Fully",
      "applianced kitchen with refrigerator, stove, dishwasher, microwave. Living",
      "room with sliders to private patio with additional storage in shed. Master",
      "bedroom with walk in closet, 2nd bedroom has 2 closets, full bath upstairs",
      "with tub/shower, 1st floor has a half bath. Laundry in the unit. Basement is",
      "full under the kitchen area of the condo and it has a cedar closet for",
      "additional storage. Condo has brand new carpet and freshly painted. Central",
      "air, gas forced air heat and electric cooking. This unit will not last so",
      "lets line up your showings. All photos will be changed once the painting and carpeting are completed."
    ],
    "duplicates": []
  },
  {
    "price": "$1600",
    "title": "Furnished, all inclusive one bedroom apartment",
    "href": "https://providence.craigslist.org/apa/d/saunderstown-furnished-all-inclusive/7046201357.html",
    "description": [
      "Fully furnished, all inclusive one bedroom -heat, electric, washer & Dryer, Wifi, linens & kitchen items, stainless appliances (no dishwasher) newly remodeled, off street parking, private entrance, located on Silver Spring Lake. Minutes to beaches, Newport, RT.4 & RT95. Ideal for traveling nurses and professionals. No smoking, no dogs, cat ok.",
      "$1,600.00 per month, references & security required.",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$995",
    "title": "1 Bedroom Apartment - walk to Wickford",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-1-bedroom-apartment/7041086031.html",
    "description": [
      "Charming 1 bedroom apartment for rent just south of Wickford center on Rt. 1A.  Very nicely renovated.",
      "3 restaurants within steps as well as bay only a few streets away.",
      "Laundry.",
      "Heat included.",
      "One year lease required.",
      "$995/month"
    ],
    "duplicates": []
  },
  {
    "price": "$950",
    "title": "1 Bedroom Apartment in Wickford Village $950.00/month",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-1-bedroom-apartment-in/7041082612.html",
    "description": [
      "Charming 1 Bedroom Apartment right in Wickford Village.  Close walk to water, docks, yacht clubs, and downtown shops.  Hardwood floors through out.  Spacious and cozy!",
      "No pets",
      "Laundry on site",
      "Heat included",
      "Electric included",
      "Hot water included",
      "$950.00/month",
      "One year lease"
    ],
    "duplicates": []
  },
  {
    "price": "$1450",
    "title": "1450 North kingstown 2nd floor 2 bedroom",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-1450-north-kingstown/7032959290.html",
    "description": [
      "2 Bedroom 1 Bath.",
      "Off street parking.",
      "Heat included.",
      "Background check required.",
      "References required."
    ],
    "duplicates": []
  },
  {
    "price": "$975",
    "title": "Renovated 1st Floor 1 Bedroom! New Floors/Heat &Hot Water Included!",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-renovated-1st-floor-1/7019367472.html",
    "description": [
      "*Great Unit! Heat and Hot Water Included!*",
      "DETAILS:",
      "Bedrooms: 1",
      "Bathrooms: 1",
      "Square Feet: 700ft",
      "Parking Spaces: 1 assigned included with plenty of visitor parking.",
      "Available: January!",
      "Price: $975.00 with HEAT and HOT WATER INCLUDED! WOW!",
      "APPLICATION FEE: $35.00",
      "_____________________________________________________________________________________________________________________",
      "Welcome to HERITAGE HOUSE APARTMENTS! We are a professionally managed apartment community with 24hr maintenance staff located in North Kingstown close to The Shoppes at Quonset! Conveniently located minutes from everything you could want! Easy highway access, short distance to shops and restaurants as well as the Wickford Junction MBTA!",
      "Our 1st Floor Apartment INCLUDES heat and hot water! All units’s come with AC unit as well to keep you cool during the summer months! Coin op washer and dryer located on property as well as your own storage space at no extra cost!",
      "Priced right at $975.00 per month with the above included this amazing space won't last! As a North Kingstown resident you will have free access to the Town Beach. Sit back, relax and find your next home with us here at Heritage House Apartments!!",
      "Renovated with brand new vinyl flooring!",
      "Quiet spot on the 1st floor --",
      "PET FREE***",
      "SMOKE FREE***",
      "Call us to schedule a tour today!",
      "show contact info",
      "Leasing Office:",
      "80 Saw Mill Drive",
      "North Kingstown RI 02852"
    ],
    "duplicates": []
  },
  {
    "price": "$1350",
    "title": "2 bedroom apt N. Kingstown",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-2-bedroom-apt-kingstown/7018847727.html",
    "description": [
      "2 bedroom, one bath, has a basement with washer/ dryer hookup, front and back yard, a deck,  dishwasher 2 car driveway. $1,350 plus gas and electric. First and deposit required. Good Background check and full time employment is also required."
    ],
    "duplicates": []
  },
  {
    "price": "$1500",
    "title": "Spacious 2 bed, 1.5 bath 2-level Townhouse! Cats & Dogs WELCOME!",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-spacious-2-bed-15-bath/7032838467.html",
    "description": [
      "Available February 14th",
      "$1,500.00 Per Month",
      "1,000 Square Feet",
      "Our beautiful townhouse community is nestled away in a quiet neighborhood just minutes away from shopping, beaches, parks and highways. With park-like grounds and over 25 acres of land, we offer a relaxing and exciting alternative to a typical apartment complex. Our residents can escape, indulge, and relax in our spectacular clubhouse, work out in our fitness center or enjoy the serene, wooded views as you take a relaxing walk around the property grounds!",
      "Community Highlights -",
      "- Water, Sewage and Trash included",
      "- Clubhouse with large kitchen and outdoor patio",
      "- Fitness center",
      "- Playground",
      "- Dog Park",
      "- Resident and guest parking",
      "- 24-hour emergency maintenance",
      "- On-site management",
      "- Snow removal service",
      "- Washer/Dryer hook-ups in each unit",
      "- Fridge, stove and dishwasher provided in each unit",
      "- Private storage shed",
      "- Private gated patio",
      "- Private entrance",
      "- Cable and Internet ready",
      "Pet Policy - We welcome both cats and dogs at our community! 2 Pet max per home. Pet fees are as follows:",
      "- $25/month for cats",
      "- $45/month for dogs",
      "- Maximum full-grown weight is 80 lbs.",
      "-Restricted dog breeds (full bred or mix): Pit bulls, Staffordshire Terriers, Rottweilers, German Shepherds, Husky-types, Malamutes, Doberman Pinschers, Chow-chows and any additional pets that are considered “Insurance Industry Banned Breeds.” Any breeds not listed will be considered on a case by case basis.",
      "LEASE TERMS",
      "12-month",
      "6-month (monthly short-term fee required)",
      "APPLICATION FEE",
      "$50.00/ Applicant and a $200.00 holding deposit that will be applied to 1st months rent or 1st months pro-rated rent. Each applicant will go through a credit check, background check, and rental history",
      "Call us today to schedule a tour!",
      "*Pictures shown are sample pictures - please call for details. Do NOT contact me with unsolicited services or offers"
    ],
    "duplicates": [
      null,
      null,
      null
    ]
  },
  {
    "price": "$1750",
    "title": "Spacious 4 bed, 1.5 bath 2-level Townhouse! Cats & Dogs WELCOME!",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-spacious-4-bed-15-bath/7032804095.html",
    "description": [
      "Available February 28th",
      "$1,750.00 Per Month",
      "1,450 Square Feet",
      "Our beautiful townhouse community is nestled away in a quiet neighborhood just minutes away from shopping, beaches, parks and highways. With park-like grounds and over 25 acres of land, we offer a relaxing and exciting alternative to a typical apartment complex. Our residents can escape, indulge, and relax in our spectacular clubhouse, work out in our fitness center or enjoy the serene, wooded views as you take a relaxing walk around the property grounds!",
      "Community Highlights -",
      "- Water, Sewage and Trash included",
      "- Clubhouse with large kitchen and outdoor patio",
      "- Fitness center",
      "- Playground",
      "- Dog Park",
      "- Resident and guest parking",
      "- 24-hour emergency maintenance",
      "- On-site management",
      "- Snow removal service",
      "- Washer/Dryer hook-ups in each unit",
      "- Fridge, stove and dishwasher provided in each unit",
      "- Private storage shed",
      "- Private gated patio",
      "- Private entrance",
      "- Cable and Internet ready",
      "Pet Policy - We welcome both cats and dogs at our community! 2 Pet max per home. Pet fees are as follows:",
      "- $25/month for cats",
      "- $45/month for dogs",
      "- Maximum full-grown weight is 80 lbs.",
      "-Restricted dog breeds (full bred or mix): Pit bulls, Staffordshire Terriers, Rottweilers, German Shepherds, Husky-types, Malamutes, Doberman Pinschers, Chow-chows and any additional pets that are considered “Insurance Industry Banned Breeds.” Any breeds not listed will be considered on a case by case basis.",
      "LEASE TERMS",
      "12-month",
      "6-month (monthly short-term fee required)",
      "APPLICATION FEE",
      "$50.00/ Applicant and a $200.00 holding deposit that will be applied to 1st months rent or 1st months pro-rated rent. Each applicant will go through a credit check, background check, and rental history",
      "Call us today to schedule a tour!",
      "*Pictures shown are sample pictures - please call for details. Do NOT contact me with unsolicited services or offers"
    ],
    "duplicates": []
  },
  {
    "price": "$1550",
    "title": "2 bed, 1.5 bath Townhouse - patio, shed ~ PETS OK!",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-2-bed-15-bath-townhouse/7032716996.html",
    "description": [
      "Available February 21st",
      "$1,550.00 Per Month",
      "1,000 Square Feet",
      "Our beautiful townhouse community is nestled away in a quiet neighborhood just minutes away from shopping, beaches, parks and highways. With park-like grounds and over 25 acres of land, we offer a relaxing and exciting alternative to a typical apartment complex. Our residents can escape, indulge, and relax in our spectacular clubhouse, work out in our fitness center or enjoy the serene, wooded views as you take a relaxing walk around the property grounds!",
      "Community Highlights -",
      "- Water, Sewage and Trash included",
      "- Clubhouse with large kitchen and outdoor patio",
      "- Fitness center",
      "- Playground",
      "- Dog Park",
      "- Resident and guest parking",
      "- 24-hour emergency maintenance",
      "- On-site management",
      "- Snow removal service",
      "- Washer/Dryer hook-ups in each unit",
      "- Fridge, stove and dishwasher provided in each unit",
      "- Private storage shed",
      "- Private gated patio",
      "- Private entrance",
      "- Cable and Internet ready",
      "Pet Policy - We welcome both cats and dogs at our community! 2 Pet max per home. Pet fees are as follows:",
      "- $25/month for cats",
      "- $45/month for dogs",
      "- Maximum full-grown weight is 80 lbs.",
      "-Restricted dog breeds (full bred or mix): Pit bulls, Staffordshire Terriers, Rottweilers, German Shepherds, Husky-types, Malamutes, Doberman Pinschers, Chow-chows and any additional pets that are considered “Insurance Industry Banned Breeds.” Any breeds not listed will be considered on a case by case basis.",
      "LEASE TERMS",
      "12-month",
      "6-month (monthly short-term fee required)",
      "APPLICATION FEE",
      "$50.00/ Applicant and a $200.00 holding deposit that will be applied to 1st months rent or 1st months pro-rated rent. Each applicant will go through a credit check, background check, and rental history",
      "Call us today to schedule a tour!",
      "*Pictures shown are sample pictures - please call for details. Do NOT contact me with unsolicited services or offers"
    ],
    "duplicates": []
  },
  {
    "price": "$2200",
    "title": "Don't miss this beautiful 3 Bed 2.5 bath Townhouse w/ ATTACHED GARAGE!",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-dont-miss-this/7031560344.html",
    "description": [
      "Available January 24th",
      "$2,200.00 Per Month",
      "1,632 Square Feet",
      "MILL CREEK TOWNHOUSES | CALL",
      "show contact info",
      "Our beautiful townhouse community is nestled away in a quiet neighborhood just minutes away from shopping, beaches, parks and highways. With park-like grounds and over 25 acres of land, we offer a relaxing and exciting alternative to a typical apartment complex. Our residents can escape, indulge, and relax in our spectacular clubhouse, work out in our fitness center or enjoy the serene, wooded views as you take a relaxing walk around the property grounds!",
      "Community Highlights -",
      "- Sewage and Trash included",
      "- Clubhouse with large kitchen and outdoor patio",
      "- Fitness center",
      "- Playground",
      "- Dog Park",
      "- Resident and guest parking",
      "- 24-hour emergency maintenance",
      "- On-site management",
      "- Snow removal service",
      "- Washer/Dryer hook-ups in each unit",
      "- Fridge, stove and dishwasher provided in each unit",
      "- Private storage shed",
      "- Private gated patio",
      "- Private entrance",
      "- Cable and Internet ready",
      "Pet Policy - We welcome both cats and dogs at our community! 2 Pet max per home. Pet fees are as follows:",
      "- $25/month for cats",
      "- $45/month for dogs",
      "- Maximum full-grown weight is 80 lbs.",
      "-Restricted dog breeds (full bred or mix): Pit bulls, Staffordshire Terriers, Rottweilers, German Shepherds, Husky-types, Malamutes, Doberman Pinschers, Chow-chows and any additional pets that are considered “Insurance Industry Banned Breeds.” Any breeds not listed will be considered on a case by case basis.",
      "LEASE TERMS",
      "12-month",
      "6-month (monthly short-term fee required)",
      "APPLICATION FEE",
      "$50.00/ lease signer and a $200.00 holding deposit that will be applied to 1st months rent or 1st months pro-rated rent. Each applicant will go through a credit check, background check, and rental history",
      "Call us today to schedule a tour!",
      "show contact info",
      "*Pictures shown are sample pictures - please call for details.",
      "do NOT contact me with unsolicited services or offers"
    ],
    "duplicates": []
  },
  {
    "price": "$1300",
    "title": "Waterfront House",
    "href": "https://providence.craigslist.org/apa/d/saunderstown-waterfront-house/7034216906.html",
    "description": [
      "Waterfront house. Beautiful location, very quiet neighborhood. 1 large BR, 1 large Bathroom, Washer/Dryer. Open living space. Directly off 1A and 1/2 mile south of Wickford village (North Kingstown). 15 minutes from Newport, RI.",
      "$1300 rent per month.",
      "$1500 security deposit required.",
      "NO Smoking.",
      "Renter responsible for snow removal, lawn, trash, oil heat, electricity, cable/wifi.",
      "Renter screening required (e.g. credit, background, employment verification, etc.)."
    ],
    "duplicates": []
  },
  {
    "price": "$1200",
    "title": "645 Ten Rod Road 2 bedroom apt, Heat, Hot water and cooking included",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-645-ten-rod-road-2/7033794710.html",
    "description": [
      "Heat, Hot water and cooking included in rent",
      "Large 2 bedroom with several walk in closets",
      "Eat in kitchen",
      "off street parking",
      "Call Freda",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1575",
    "title": "Stay Warm By The Fireplace! Beautiful 2Bed/2Bath February 1st!",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-stay-warm-by-the/7037046349.html",
    "description": [
      "LUXURY LIVING AT COMFORTABLE COSTS",
      "SAW MILL SQUARE APARTMENTS",
      "DETAILS:",
      "Bedrooms:",
      "2",
      "Bathrooms:",
      "2",
      "Square Feet:",
      "1150ft",
      "Parking Spaces:",
      "1 assigned included with plenty of visitor parking.",
      "Available:",
      "February Availability!",
      "Price:",
      "Starting at $1575.00!",
      "Welcome to",
      "SAW MILL SQUARE APARTMENTS!",
      "South County’s Premiere Residential Community welcomes our BRAND NEW Luxury 2 bed apartments leasing now for December 2019! We are a professionally managed apartment community with 24hr maintenance staff located in North Kingstown close to The Shoppes at Quonset!  Conveniently located minutes from everything you could want!  Easy highway access, short distance to grocery, entertainment, bars, restaurants as well as the Wickford Junction MBTA!\n\nOur spacious 2 bedroom/ 2 bath luxury apartments feature everything you could want in your new home!",
      "Features Include:",
      "Stainless-steel appliances and quartz counter tops!",
      "Washer and dryer in every unit!",
      "Large patio/deck area for your own private use!",
      "Vaulted ceilings and extra closet space in select units.",
      "These beautiful apartments also include secure access, assigned parking, free storage unit on-site as well as access to our Clubhouse!",
      "Our Clubhouse amenities include :",
      "Gym",
      "Theater Room",
      "Activity room with beautiful fireplace and partial kitchen",
      "Patio area with grill for use during warmer weather",
      "Looking for extreme comfort and convenience? Look no further!  \n **If you lease prior to January 1st you will qualify for move in incentives. \n",
      "The Village at Saw Mill Square is pet-free and smoke-free!  Contact us today to set up a tour, you do not want to miss out on these brand-new units!\n",
      "PLEASE CONTACT US AT:",
      "LEASING OFFICE :",
      "show contact info",
      "OR",
      "Visit us at:",
      "https://sawmillsquare.com/",
      "80 Saw Mill Drive",
      "North Kingstown, RI 02852"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1500",
    "title": "Spacious 2 bed, 1.5 bath 2-level Townhouse! Cats & Dogs WELCOME!",
    "href": "https://providence.craigslist.org/apa/d/north-kingstown-spacious-2-bed-15-bath/7032838467.html",
    "description": [
      "Available February 14th",
      "$1,500.00 Per Month",
      "1,000 Square Feet",
      "Our beautiful townhouse community is nestled away in a quiet neighborhood just minutes away from shopping, beaches, parks and highways. With park-like grounds and over 25 acres of land, we offer a relaxing and exciting alternative to a typical apartment complex. Our residents can escape, indulge, and relax in our spectacular clubhouse, work out in our fitness center or enjoy the serene, wooded views as you take a relaxing walk around the property grounds!",
      "Community Highlights -",
      "- Water, Sewage and Trash included",
      "- Clubhouse with large kitchen and outdoor patio",
      "- Fitness center",
      "- Playground",
      "- Dog Park",
      "- Resident and guest parking",
      "- 24-hour emergency maintenance",
      "- On-site management",
      "- Snow removal service",
      "- Washer/Dryer hook-ups in each unit",
      "- Fridge, stove and dishwasher provided in each unit",
      "- Private storage shed",
      "- Private gated patio",
      "- Private entrance",
      "- Cable and Internet ready",
      "Pet Policy - We welcome both cats and dogs at our community! 2 Pet max per home. Pet fees are as follows:",
      "- $25/month for cats",
      "- $45/month for dogs",
      "- Maximum full-grown weight is 80 lbs.",
      "-Restricted dog breeds (full bred or mix): Pit bulls, Staffordshire Terriers, Rottweilers, German Shepherds, Husky-types, Malamutes, Doberman Pinschers, Chow-chows and any additional pets that are considered “Insurance Industry Banned Breeds.” Any breeds not listed will be considered on a case by case basis.",
      "LEASE TERMS",
      "12-month",
      "6-month (monthly short-term fee required)",
      "APPLICATION FEE",
      "$50.00/ Applicant and a $200.00 holding deposit that will be applied to 1st months rent or 1st months pro-rated rent. Each applicant will go through a credit check, background check, and rental history",
      "Call us today to schedule a tour!",
      "*Pictures shown are sample pictures - please call for details. Do NOT contact me with unsolicited services or offers"
    ],
    "duplicates": [
      null,
      null,
      null
    ]
  }
]