[
  {
    "price": "$1125",
    "title": "3 Bdrm 5 room Apt",
    "href": "https://providence.craigslist.org/apa/d/pawtucket-3-bdrm-5-room-apt/7059276737.html",
    "description": [
      "Five room & pantry THIRD FLOOR apartment available. Gas heat, hot water & cooking (utilities not included) fenced yard & parking, storage area and washer-dryer hook-ups. No smoking, no pets allowed"
    ],
    "duplicates": []
  },
  {
    "price": "$900",
    "title": "One Bedroom in Lincoln-Heat/HW Included!",
    "href": "https://providence.craigslist.org/apa/d/pawtucket-one-bedroom-in-lincoln-heat/7055966732.html",
    "description": [
      "Available Now: 197 Reservoir Ave, Lincoln, RI",
      "1st floor, 1 bedroom apartment located right off of Smithfield Ave. Close to all highways, Providence, Lincoln Woods, Twin River, and more!",
      "Parking for 1 included",
      "No laundry on site, but there is a laundromat across the street.",
      "Contact me to schedule a viewing"
    ],
    "duplicates": []
  },
  {
    "price": "$1100",
    "title": "2bed Lincoln",
    "href": "https://providence.craigslist.org/apa/d/lincoln-2bed-lincoln/7057873000.html",
    "description": [
      "2 bed, 2nd floor apartment with eat-in kitchen, living room, large closets including walk-in cedar closet and 2 storage spaces. Great school system, back yard with parking.",
      "If interested please call",
      "show contact info",
      ". Thank you!"
    ],
    "duplicates": []
  },
  {
    "price": "$800",
    "title": "Central Falls – Just Rehabbed Two Bed - $800",
    "href": "https://providence.craigslist.org/apa/d/central-falls-central-falls-just/7048249261.html",
    "description": [
      "Central Falls – Just Rehabbed Two Bed - $850",
      "Marketing Description",
      "This 2nd floor two-bed unit was just updated and has almost 800 sq. feet of immaculate living space",
      "• Includes fresh paint, new flooring and many updates throughout",
      "• Large, eat-in kitchen with newer cabinets, just-installed vinyl flooring and gas cooking",
      "• Bright and sunny family room",
      "• Comfortable gas space heater with warm vinyl windows throughout",
      "• Spotless bath with stand-up shower, new vanity/sink and new laminate flooring",
      "• Spacious beds also both with new laminate flooring and ample closet space",
      "• Small pets negotiable",
      "• Shared off-street parking",
      "• Convenient Central Falls location, minutes to 95, walking distance to bus route and laundromat and only ¼ mile to High School"
    ],
    "duplicates": []
  },
  {
    "price": "$1600",
    "title": "3 bedroom duplex for rent",
    "href": "https://providence.craigslist.org/apa/d/lincoln-3-bedroom-duplex-for-rent/7055609152.html",
    "description": [
      "This is a 3 bedroom, 1 bath duplex. Tenant has the entire half of the basement and a garage. There's plenty of off street parking and a large backyard. Landlord occupies other half of the duplex. Highly desired school district and great community.  Gas and electricity are the responsibility of the tenant. No smoking. Background check and proof of income are required."
    ],
    "duplicates": []
  },
  {
    "price": "$825",
    "title": "Cool 2 Level Studio Apartment in Lincoln",
    "href": "https://providence.craigslist.org/apa/d/pawtucket-cool-2-level-studio-apartment/7055961468.html",
    "description": [
      "Available Now: 794 Smithfield Ave, Lincoln, RI",
      "Newly updated studio apartment in Lincoln near the Pawtucket border on Smithfield Avenue. Nice and convenient area that is close to the highway, Providence, Twin River, Lincoln Woods, etc.",
      "Kitchen and living area on the first level, bathroom and bedroom on the second. Unique and cool layout, apartment has a private entrance.",
      "Parking for 1 car included. No laundry on site, but there is a laundromat across the street.",
      "Contact me to schedule a viewing",
      "Brendan",
      "RentProv Realty"
    ],
    "duplicates": []
  },
  {
    "price": "$1050",
    "title": "3 BR in Lincoln w/ Heat/HW, Parking and Laundry",
    "href": "https://providence.craigslist.org/apa/d/central-falls-3-br-in-lincoln-heat-hw/7057244210.html",
    "description": [
      "Meticulous 3 bedroom, 1 bathroom third floor apartment in Lincoln.  Spacious backyard, parking for two vehicles, and laundry.  Heat and hot water are included.  Available for rent on March 1st.  No smoking and no pets."
    ],
    "duplicates": []
  },
  {
    "price": "$1100",
    "title": "Lincoln",
    "href": "https://providence.craigslist.org/apa/d/pawtucket-lincoln/7056883128.html",
    "description": [
      "2 bedroom ,Kitchen ,Living room,Dinning room. Heat and hot water included on the third floor. off street parking on site coin laundry and storage, appliances included, no pets , no smoking..",
      "Call Dave",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1213",
    "title": "Spacious 3 bedroom 2bth Wood River Junction Carolina Stylish french do",
    "href": "https://providence.craigslist.org/apa/d/lincoln-spacious-3-bedroom-2bth-wood/7056492653.html",
    "description": [
      "3 Bed 2 Bath Home.  HUD Owned Property For Sale As-Is.. Buyer inspections are for information only. Warwick Jamestown Westport"
    ],
    "duplicates": []
  },
  {
    "price": "$1765",
    "title": "Beautifully remodeled 2 Bedroom 1 1/2 Bathroom Condo",
    "href": "https://providence.craigslist.org/apa/d/albion-beautifully-remodeled-2-bedroom/7056261093.html",
    "description": [
      "Newly remodeled condo in the desirable Gardens at Wake Robin.",
      "Granite countertops!  Hardwood floors!",
      "New siding & new windows!",
      "Pool and clubhouse on site!",
      "Heat, hot water & condo fees included!",
      "Off street parking!",
      "NO Pets!"
    ],
    "duplicates": []
  },
  {
    "price": "$1650",
    "title": "LINCOLN/DUPLEX",
    "href": "https://providence.craigslist.org/apa/d/lincoln-lincoln-duplex/7052275098.html",
    "description": [
      "LINCOLN/DUPLEX SIDE BY SIDE.",
      "IT'S NOT SECTION 8 APPROVED, IT'S A 3 BEDROOM HOUSE THE BEDROOMS ARE ALL UPSTAIRS SPACIOUS ALL WITH CLOSETS AND ITS ALL COMMERCIAL CARPETED WALL TO WALL, IT HAS A LIVING ROOM WITH A CEILING FAN AND IT HAS BEAUTIFUL HARDWOOD FLOORS AND THE DINING ROOM HAS A BEAUTIFUL CHANDELIER AND ALSO WITH BEAUTIFUL HARDWOOD FLOORS, UPDATED EAT-IN KITCHEN WITH ALL STAINLESS STEEL APPLIANCES SIDE BY SIDE REFRIGERATOR WITH THE WATER AND ICE MAKER LINE AND IT ALSO HAS A DISHWASHER, CERAMIC FLOORS, GRANITE COUNTERTOP, FINISH BASEMENT IS ALL CARPETED IT HAS ITS OWN EXIT TO THE BACKYARD. THE HOUSE HAS 2 FULL BATHROOM. THE BATHROOM UPSTAIRS IS ALL NEW JUST FINISH IT ALL REMODELED, IT HAS A 3 CAR DRIVEWAY. IS A VERY QUIET NEIGHBORHOOD, WATER VIEW THE HOUSE IS IN FRONT OF A POND AND IS ALSO A DEAD END STREET. THE HOUSE IS GAS HEAT AND IT HAS 2 ZONE, SMALL DOGS OK NO MORE THAN 15 POUNDS. THE BACKYARD IS PRIVATE ALL FENCE IN WITH THE WHITE VYNIL FENCE AND IT ALSO HAS A BRICK PATIO. LOOKING FOR A GOOD FAMILY TO TAKE CARE OF THE HOUSE, GREAT SCHOOL SYSTEM, THE HOUSE HAS 3 EXIT DOORS. THIS WILL BE MOVED IN READY FOR MARCH 1ST 2020 NOT BEFORE. THE RENT WILL BE $1650.00 IF YOU ARE INTERESTED PLEASE CALL CARLOS AT",
      "show contact info",
      "THANK YOU"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1650",
    "title": "LINCOLN/DUPLEX",
    "href": "https://providence.craigslist.org/apa/d/lincoln-lincoln-duplex/7050960424.html",
    "description": [
      "LINCOLN/DUPLEX SIDE BY SIDE.",
      "IT'S NOT SECTION 8 APPROVED, IT'S A 3 BEDROOM HOUSE THE BEDROOMS ARE ALL UPSTAIRS SPACIOUS ALL WITH CLOSETS AND ITS ALL COMMERCIAL CARPETED WALL TO WALL, IT HAS A LIVING ROOM WITH A CEILING FAN AND IT HAS BEAUTIFUL HARDWOOD FLOORS  AND THE DINING ROOM HAS A BEAUTIFUL CHANDELIER  AND ALSO WITH BEAUTIFUL HARDWOOD FLOORS, UPDATED EAT-IN KITCHEN WITH ALL STAINLESS STEEL APPLIANCES SIDE BY SIDE REFRIGERATOR WITH THE WATER AND ICE MAKER LINE AND IT ALSO HAS A DISHWASHER, CERAMIC FLOORS, GRANITE COUNTERTOP, FINISH BASEMENT IS ALL CARPETED IT HAS ITS OWN EXIT TO THE BACKYARD. THE HOUSE HAS 2 FULL BATHROOM. THE BATHROOM UPSTAIRS IS ALL NEW JUST FINISH IT ALL REMODELED,  IT HAS A 3 CAR DRIVEWAY. IS A VERY QUIET NEIGHBORHOOD, WATER VIEW THE HOUSE IS IN FRONT OF A POND AND IS ALSO A DEAD END STREET. THE HOUSE IS GAS HEAT AND IT HAS 2 ZONE, SMALL DOGS OK NO MORE THAN 15 POUNDS. THE BACKYARD IS PRIVATE ALL FENCE IN WITH THE WHITE VYNIL FENCE AND IT ALSO HAS A BRICK PATIO. LOOKING FOR A GOOD FAMILY TO TAKE CARE OF THE HOUSE, GREAT SCHOOL SYSTEM, THE HOUSE HAS 3 EXIT DOORS. THIS WILL BE MOVED IN READY FOR MARCH 1ST 2020 NOT BEFORE. THE RENT WILL BE $1650.00  IF YOU ARE INTERESTED PLEASE CALL CARLOS AT",
      "show contact info",
      "THANK YOU"
    ],
    "duplicates": []
  },
  {
    "price": "$2150",
    "title": "One of the most unique houses you can find for rent!",
    "href": "https://providence.craigslist.org/apa/d/lincoln-one-of-the-most-unique-houses/7037944365.html",
    "description": [
      "This property is one of the most unique properties you can find on the rental market. On the surface it's a 3 bed/ 1.2 bath (1 full bath, 2 half bath) home boasting roughly 1500 square feet but it's so much more than that! This home sits far off the main road, allowing for access to highways and shopping while also providing the feeling of being lost in the woods (13+ acres!) that make up the property. The land is beautifully landscaped with a horse barn, fenced pasture, open back yard (approx 1 acre, poster's estimation) and lots of woods to hike through. Inside the home features a wood burning fire place, newly redone bathrooms, and TONS of natural light. The number \"1500 sq feet\" does not do this home justice as it has an open layout main living level with two huge bedrooms, including a true master, upstairs.",
      "We are offering this property for February 1st but are willing to accommodate an earlier move-in date if necessary.",
      "$50 application fee required per person 18 years of age or older. Application includes background check, income verification, credit check, reference check.",
      "The essentials:",
      "Three bedrooms",
      "One full bathroom, two half bathrooms",
      "Laundry",
      "Oil heat",
      "1500+ sq ft",
      "Close to 295, 146, Lincoln Mall",
      "Plenty of off-street parking (garage not available)",
      "Updated pictures of interior to follow, but don't feel like you have to wait to schedule a showing!",
      "Written communication preferred for initial contact, please email or text Dave to schedule a showing.",
      "Offering party is a licensed Realtor."
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$2150",
    "title": "Simply one of the coolest houses you'll find!",
    "href": "https://providence.craigslist.org/apa/d/lincoln-simply-one-of-the-coolest/7037211935.html",
    "description": [
      "This property is one of the most unique properties you can find on the rental market. On the surface it's a 3 bed/ 1.2 bath (1 full bath, 2 half bath) home boasting roughly 1500 square feet but it's so much more than that! This home sits far off the main road, allowing for access to highways and shopping while also providing the feeling of being lost in the woods (13+ acres!) that make up the property. The land is beautifully landscaped with a horse barn, fenced pasture, open back yard (approx 1 acre, poster's estimation) and lots of woods to hike through. Inside the home features a wood burning fire place, newly redone bathrooms, and TONS of natural light. The number \"1500 sq feet\" does not do this home justice as it has an open layout main living level with two huge bedrooms, including a true master, upstairs.",
      "We are offering this property for February 1st but are willing to accommodate an earlier move-in date if necessary.",
      "$50 application fee required per person 18 years of age or older. Application includes background check, income verification, credit check, reference check.",
      "The essentials:",
      "Three bedrooms",
      "One full bathroom, two half bathrooms",
      "Laundry",
      "Oil heat",
      "1500+ sq ft",
      "Close to 295, 146, Lincoln Mall",
      "Plenty of off-street parking (garage not available)",
      "Updated pictures of interior to follow, but don't feel like you have to wait to schedule a showing!",
      "Written communication preferred for initial contact, please email or text Dave to schedule a showing.",
      "Offering party is a licensed Realtor."
    ],
    "duplicates": []
  },
  {
    "price": "$0",
    "title": "Project Based Apartment open waitlist",
    "href": "https://providence.craigslist.org/apa/d/lincoln-project-based-apartment-open/7051407135.html",
    "description": [
      "Three and Four Bedroom Project-Based Apartments - Woodward St. Cumberland, RI",
      "Cumberland Housing Authority is now accepting applications for the three and four Bedroom Project Based Apartments wait list. These apartments are located on Woodward St. in Cumberland. Section 8 Project-Based subsidy included.",
      "Applicants must be income eligible and meet household size guidelines to qualify for these units.",
      "\t\t\t\tIncome Limits",
      "\t\t1 Person\t\t2 Persons\t\t3 Persons",
      "\t\t    $17,200\t\t$19,650\t\t       $22,100",
      "\t4 Persons\t 5 Persons\t  6 Persons    7 Persons\t    8 Persons",
      "\t     $25,750\t         $30,170\t          $34,590\t         $39,010\t         $43,430",
      "Applications are available at the Cumberland Housing Authority office located at 573 Mendon Road, Suite 4, Cumberland, RI 02864.  For more information, call",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1650",
    "title": "Cumberland, 1/2 duplex, 3 beds, 1 1/2 baths,",
    "href": "https://providence.craigslist.org/apa/d/lincoln-cumberland-1-2-duplex-3-beds/7050973319.html",
    "description": [
      "Cumberland, call 575-1382 for this 1/2 Duplex house, 2nd floor has 3 bedrooms with closets and refurbished hardwood floors, full bath. 1st floor has living room with fireplace, dining room, kitchen with dishwasher and stove (refrigerator not included), and 1/2 bath. The unit has been totally repainted. Basement with washer/dryer hookups, walkout to rear yard. Oil heat and hot water, electric cooking, Small rear porch, parking for 2 cars, no pets, neighboring towns are Lincoln, Pawtucket, North Attleboro MA, Attleboro MA, 15 min to Providence, 10 minutes to 95 and S. Attleboro T station. available now $1650 per month, utilities not included 575-1382"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1650",
    "title": "Cumberland, 1/2 Duplex house, 3 beds, 1 1/2 baths,",
    "href": "https://providence.craigslist.org/apa/d/lincoln-cumberland-1-2-duplex-house-3/7028937903.html",
    "description": [
      "Cumberland, call 575-1382 for this 1/2 Duplex house, 2nd floor has 3 bedrooms with closets and refurbished hardwood floors, full bath. 1st floor has living room with fireplace, dining room, kitchen with dishwasher and stove (refrigerator not included), and 1/2 bath. The unit has been totally repainted. Basement with washer/dryer hookups, walkout to rear yard. Oil heat and hot water, electric cooking, Small rear porch, parking for 2 cars, no pets, neighboring towns are Lincoln, Pawtucket, North Attleboro MA, Attleboro MA, 15 min to Providence, 10 minutes to 95 and S. Attleboro T station. available now $1650 per month, utilities not included 575-1382"
    ],
    "duplicates": []
  },
  {
    "price": "$950",
    "title": "1 Bedroom Apartment in Quiet Lincoln Neighborhood",
    "href": "https://providence.craigslist.org/apa/d/central-falls-1-bedroom-apartment-in/7047010685.html",
    "description": [
      "Newly renovated 1 bedroom apartment on the first floor. Large kitchen with brand new stainless-steel refrigerator. 12' X 8' bonus room. Walking distance to the bike path and Stop and Shop.",
      "Off street parking.",
      "Large coin-operated washer and dryer in basement.",
      "Gas heat. Utilities NOT included.",
      "No Smoking.",
      "No pets.",
      "Lincoln, RI 02865"
    ],
    "duplicates": []
  },
  {
    "price": "$1000",
    "title": "2 Bedroom Apartment $1000",
    "href": "https://providence.craigslist.org/apa/d/lincoln-2-bedroom-apartment-1000/7048444684.html",
    "description": [
      "2 Bedroom, 1 Bathroom apartment in Lincoln RI.  Hardwoods throughout, updated kitchen and bathroom, lots of sun, first floor apartment, off street parking!  Great school system",
      "Pets Negotiable",
      "Please email or text to schedule showing"
    ],
    "duplicates": []
  },
  {
    "price": "$2200",
    "title": "Duplex Apartment for Rent - Available February 1, 2020",
    "href": "https://providence.craigslist.org/apa/d/lincoln-duplex-apartment-for-rent/7033436343.html",
    "description": [
      "Brand New 2-Level Duplex Apartment in Lincoln, RI. Construction Completion date is January 31, 2020.",
      "18A & 18B Arnold Street, Lincoln, RI.",
      "Available on February 1, 2020. Now accepting rental applications and beginning the tenant screening process.",
      "3 bedrooms. 2.5 bathrooms. The Master Bedroom has an attached private Bathroom. Open Floor Plan on First Level. Gas Heat. Central Air. Stainless Steel Appliances including; Refrigerator, Stove, Dishwasher, Microwave with Exhaust Fan. Granite Countertops and Hardwood Floors. Slider Door to Back Deck and Backyard. 2-Car Driveway. Unfinished Basement with Laundry Hook-Ups and plenty of Storage Space.",
      "Easy Access to Route 146, Train Stations, Buses, Bike Path, Lincoln Public School System (very desirable), Hospitals, Shopping, Recreational Activities, minutes from Lincoln Woods State Park, Twin River Casino, Colleges, and 10 minutes to Downtown Providence. Nice Neighborhood. No Smoking. No Pets. 12 Month Lease Agreement.",
      "First Month's Rent & Security Deposit due at Lease signing.",
      "Utilities Not Included. $2,200 Per Month.",
      "Email for further information and to make an appointment for a private walk-thru to get a view of the layout before its final interior completion."
    ],
    "duplicates": []
  },
  {
    "price": "$1300",
    "title": "Renovated Apt for Rent",
    "href": "https://providence.craigslist.org/apa/d/lincoln-renovated-apt-for-rent/7031517914.html",
    "description": [
      "Don't miss out on this spotless and completely REMODELED first floor apt! Two bedrooms with an open space concept. Freshly finished hardwood flooring throughout.",
      "Granite countertops, stainless steel appliances. Built in bluetooth radio in the bathroom.",
      "Located on a quiet dead end street and very safe neighborhood in Lincoln. Great school system, minutes to highway and to Attleboro. Ready for immediate occupancy. Tenant responsible for utilities.",
      "Serious inquiries only.",
      "** Absolutely no pets **",
      "** No washer or dryer hookups **"
    ],
    "duplicates": []
  },
  {
    "price": "$1695",
    "title": "Bright Sunny open Layout Lincoln RI 2 Large Bedroom 2 Large Baths",
    "href": "https://providence.craigslist.org/apa/d/albion-bright-sunny-open-layout-lincoln/7024592501.html",
    "description": [
      "Across from a beautiful Country Club in Lincoln RI accessible to all major highways and minutes to Providence. Open layouts bright and sunny with decks and beautifully landscaped grounds. 24 hour emergency maintenance Please call Kirkbrae Properties to set up a time to tour the property.",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1250",
    "title": "Full of charm with additional features including a cozy fireplace!",
    "href": "https://providence.craigslist.org/apa/d/central-falls-full-of-charm-with/7040278197.html",
    "description": [
      "This adorable 2 bed Ranch back to life! Full of charm with additional features including a cozy fireplace, a formal dining area, central air, hardwoods throughout, an enclosed breezeway, an attached garage & young roof. Local amenities & entertainment provide great outlets for close-by things to do, Lincoln Woods State Park, Twin River Casino and many more. interested occupants contact me; watermeloncake101 @gmall . com"
    ],
    "duplicates": []
  },
  {
    "price": "$950",
    "title": "Lincoln ri  2nd floor hardwoods",
    "href": "https://providence.craigslist.org/apa/d/central-falls-lincoln-ri-2nd-floor/7027368908.html",
    "description": [
      "Two beds with harwoods. living room kitchen and bathroom. Great area with large yard ,parking coin op in basement. No animals of any size and no utilities included.  Please call mark at",
      "show contact info",
      "for quick showing . Thank you  section 8 available   Please call or text only more pictures coming tommorow"
    ],
    "duplicates": []
  },
  {
    "price": "$950",
    "title": "Beautiful 1Br/1Ba Condo for Rent! Lincoln RI",
    "href": "https://providence.craigslist.org/apa/d/central-falls-beautiful-1br-1ba-condo/7033565731.html",
    "description": [
      "Don't miss out on this beautiful one bedroom condo, walking distance from bike path. Granite Countertops, Hardwood Floors, Off Street Parking, Laundry In Building. Well maintained unit in a quiet neighborhood that is close to the highway for commuters. Sec 8 accepted."
    ],
    "duplicates": []
  },
  {
    "price": "$1650",
    "title": "LINCOLN/DUPLEX",
    "href": "https://providence.craigslist.org/apa/d/lincoln-lincoln-duplex/7052275098.html",
    "description": [
      "LINCOLN/DUPLEX SIDE BY SIDE.",
      "IT'S NOT SECTION 8 APPROVED, IT'S A 3 BEDROOM HOUSE THE BEDROOMS ARE ALL UPSTAIRS SPACIOUS ALL WITH CLOSETS AND ITS ALL COMMERCIAL CARPETED WALL TO WALL, IT HAS A LIVING ROOM WITH A CEILING FAN AND IT HAS BEAUTIFUL HARDWOOD FLOORS AND THE DINING ROOM HAS A BEAUTIFUL CHANDELIER AND ALSO WITH BEAUTIFUL HARDWOOD FLOORS, UPDATED EAT-IN KITCHEN WITH ALL STAINLESS STEEL APPLIANCES SIDE BY SIDE REFRIGERATOR WITH THE WATER AND ICE MAKER LINE AND IT ALSO HAS A DISHWASHER, CERAMIC FLOORS, GRANITE COUNTERTOP, FINISH BASEMENT IS ALL CARPETED IT HAS ITS OWN EXIT TO THE BACKYARD. THE HOUSE HAS 2 FULL BATHROOM. THE BATHROOM UPSTAIRS IS ALL NEW JUST FINISH IT ALL REMODELED, IT HAS A 3 CAR DRIVEWAY. IS A VERY QUIET NEIGHBORHOOD, WATER VIEW THE HOUSE IS IN FRONT OF A POND AND IS ALSO A DEAD END STREET. THE HOUSE IS GAS HEAT AND IT HAS 2 ZONE, SMALL DOGS OK NO MORE THAN 15 POUNDS. THE BACKYARD IS PRIVATE ALL FENCE IN WITH THE WHITE VYNIL FENCE AND IT ALSO HAS A BRICK PATIO. LOOKING FOR A GOOD FAMILY TO TAKE CARE OF THE HOUSE, GREAT SCHOOL SYSTEM, THE HOUSE HAS 3 EXIT DOORS. THIS WILL BE MOVED IN READY FOR MARCH 1ST 2020 NOT BEFORE. THE RENT WILL BE $1650.00 IF YOU ARE INTERESTED PLEASE CALL CARLOS AT",
      "show contact info",
      "THANK YOU"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$2150",
    "title": "One of the most unique houses you can find for rent!",
    "href": "https://providence.craigslist.org/apa/d/lincoln-one-of-the-most-unique-houses/7037944365.html",
    "description": [
      "This property is one of the most unique properties you can find on the rental market. On the surface it's a 3 bed/ 1.2 bath (1 full bath, 2 half bath) home boasting roughly 1500 square feet but it's so much more than that! This home sits far off the main road, allowing for access to highways and shopping while also providing the feeling of being lost in the woods (13+ acres!) that make up the property. The land is beautifully landscaped with a horse barn, fenced pasture, open back yard (approx 1 acre, poster's estimation) and lots of woods to hike through. Inside the home features a wood burning fire place, newly redone bathrooms, and TONS of natural light. The number \"1500 sq feet\" does not do this home justice as it has an open layout main living level with two huge bedrooms, including a true master, upstairs.",
      "We are offering this property for February 1st but are willing to accommodate an earlier move-in date if necessary.",
      "$50 application fee required per person 18 years of age or older. Application includes background check, income verification, credit check, reference check.",
      "The essentials:",
      "Three bedrooms",
      "One full bathroom, two half bathrooms",
      "Laundry",
      "Oil heat",
      "1500+ sq ft",
      "Close to 295, 146, Lincoln Mall",
      "Plenty of off-street parking (garage not available)",
      "Updated pictures of interior to follow, but don't feel like you have to wait to schedule a showing!",
      "Written communication preferred for initial contact, please email or text Dave to schedule a showing.",
      "Offering party is a licensed Realtor."
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1650",
    "title": "Cumberland, 1/2 duplex, 3 beds, 1 1/2 baths,",
    "href": "https://providence.craigslist.org/apa/d/lincoln-cumberland-1-2-duplex-3-beds/7050973319.html",
    "description": [
      "Cumberland, call 575-1382 for this 1/2 Duplex house, 2nd floor has 3 bedrooms with closets and refurbished hardwood floors, full bath. 1st floor has living room with fireplace, dining room, kitchen with dishwasher and stove (refrigerator not included), and 1/2 bath. The unit has been totally repainted. Basement with washer/dryer hookups, walkout to rear yard. Oil heat and hot water, electric cooking, Small rear porch, parking for 2 cars, no pets, neighboring towns are Lincoln, Pawtucket, North Attleboro MA, Attleboro MA, 15 min to Providence, 10 minutes to 95 and S. Attleboro T station. available now $1650 per month, utilities not included 575-1382"
    ],
    "duplicates": [
      null
    ]
  }
]