[
  {
    "price": "$1100",
    "title": "Cumberland/ Valley Falls Brand-New Two Bed Rental",
    "href": "https://providence.craigslist.org/apa/d/central-falls-cumberland-valley-falls/7049439404.html",
    "description": [
      "Ready for immediate occupancy! Includes wide-open floor plan with fresh paint, spotless hardwoods and over 800 sq. feet of immaculate living space Great natural lighting with brand-new everything throughout.  house also has brand new warm vinyl windows and insulation Fully updated kitchen with all granite and new appliances, including dishwasher and hood microwave Bright and sunny family room with all hardwoods, easily large enough to make one side a dining area Spotless bath with stand up shower and all brand new fixtures, vanity and toilet Spacious beds, also with hardwoods and ample closet space Dedicated laundry for just 1st floor Private front and side entrances Off street parking including one garage spot Shared fenced yard Great Cumberland location, between RT 114 and 123, just minutes to 95 and less than a ten minute drive to South Attleboro Commuter Rail."
    ],
    "duplicates": []
  },
  {
    "price": "$1250",
    "title": "YOU DO NOT WANT TO MISS THIS",
    "href": "https://providence.craigslist.org/apa/d/cumberland-you-do-not-want-to-miss-this/7049055471.html",
    "description": [
      "3bed, 2 full bath Cape in a great area. Generous closet storage. Brand new high efficiency oil forced water heating system installed 2018. City sewer and city water. Oak kitchen cabinets with corian counter tops, hard wood floors with dining area and a dining room for entertaining."
    ],
    "duplicates": []
  },
  {
    "price": "$1550",
    "title": "Small 4 Bedroom",
    "href": "https://providence.craigslist.org/apa/d/cumberland-small-4-bedroom/7057561893.html",
    "description": [
      "Newly Remodeled,wood floors,Granite countertops,off street parking. No Smoking. No Pets."
    ],
    "duplicates": []
  },
  {
    "price": "$1300",
    "title": "43 East Barrows St -  2 bedrooms",
    "href": "https://providence.craigslist.org/apa/d/central-falls-43-east-barrows-st-2/7055167141.html",
    "description": [
      "Cumberland/Attleboro Line. Rental  2 bedroom, well insulated, remodeled, granite counter top kitchen and bathroom re-done. Hardwood Floors. Dishwasher & Laundry Hook up in basement. Spacious & Sunny with double parlor. 2 car parking. Close to 4 highways. NO SMOKING, NO PETS. Private setting, beautiful, peaceful, safe neighborhood. $1300 per month. 1st month, plus security due at lease signing. Call the owner at",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1250",
    "title": "Spacious remodeled 3 bedrooms on 1st floor in Cumberland",
    "href": "https://providence.craigslist.org/apa/d/central-falls-spacious-remodeled-3/7054613637.html",
    "description": [
      "Beautiful 3 bedroom apartment on first floor in excellent convenient Cumberland location. Great school, Next to school, playground and baseball field. Beautifully remodeled modern eat in kitchen, newer stainless appliances, large living room, spacious modern bathroom and good sized bedrooms, all hardwood floor, new kitchen floor, replacement windows, gas heating, free parking. Utility not included in the rent. Application required. Please cantact Ray at",
      "show contact info",
      "for showing."
    ],
    "duplicates": [
      "5877213368"
    ]
  },
  {
    "price": "$1250",
    "title": "Beautiful remodeled 1st floor 3 bedroom in Cumberland",
    "href": "https://providence.craigslist.org/apa/d/central-falls-beautiful-remodeled-1st/7054010284.html",
    "description": [
      "Beautiful 3 bedroom apartment on first floor in excellent convenient Cumberland location. Next to school, playground and baseball field. Beautifully remodeled modern eat in kitchen, newer stainless appliances, large living room, spacious modern bathroom and good sized bedrooms, all hardwood floor, new kitchen floor, replacement windows, gas heating, free parking. Utility not included in the rent. Application required. Please cantact Ray at",
      "show contact info",
      "for showing."
    ],
    "duplicates": []
  },
  {
    "price": "$1000",
    "title": "Gorgeous 2 Bed in Cumberland",
    "href": "https://providence.craigslist.org/apa/d/gorgeous-2-bed-in-cumberland/7052649635.html",
    "description": [
      "A beautiful, well cared for apartment building above quiet real estate office available in the Valley Falls section of Cumberland. Pride in ownership. Available to move in early March.",
      "Cumberland offers a great school system and a safe place to live. Next to BVP schools. Apartment Building is minutes from the MBTA (commuter train) and Routes 95, 295, & 146.",
      "Apartment consists of two spacious bed rooms with plenty of closet space. It also consists of a large kitchen/dining area with granite counter tops and appliances (gas stove, fridge), a large living room and bathroom.",
      "Private parking in rear of building. On-Site Laundry. Gas Heat & Central AC.",
      "Rent is $1000 with no utilities. No pets please.",
      "Please contact Jorge @",
      "show contact info",
      "or email with any questions.",
      "Thanks"
    ],
    "duplicates": []
  },
  {
    "price": "$0",
    "title": "Project Based Apartment open waitlist",
    "href": "https://providence.craigslist.org/apa/d/lincoln-project-based-apartment-open/7051407135.html",
    "description": [
      "Three and Four Bedroom Project-Based Apartments - Woodward St. Cumberland, RI",
      "Cumberland Housing Authority is now accepting applications for the three and four Bedroom Project Based Apartments wait list. These apartments are located on Woodward St. in Cumberland. Section 8 Project-Based subsidy included.",
      "Applicants must be income eligible and meet household size guidelines to qualify for these units.",
      "\t\t\t\tIncome Limits",
      "\t\t1 Person\t\t2 Persons\t\t3 Persons",
      "\t\t    $17,200\t\t$19,650\t\t       $22,100",
      "\t4 Persons\t 5 Persons\t  6 Persons    7 Persons\t    8 Persons",
      "\t     $25,750\t         $30,170\t          $34,590\t         $39,010\t         $43,430",
      "Applications are available at the Cumberland Housing Authority office located at 573 Mendon Road, Suite 4, Cumberland, RI 02864.  For more information, call",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1650",
    "title": "Cumberland, 1/2 duplex, 3 beds, 1 1/2 baths,",
    "href": "https://providence.craigslist.org/apa/d/lincoln-cumberland-1-2-duplex-3-beds/7050973319.html",
    "description": [
      "Cumberland, call 575-1382 for this 1/2 Duplex house, 2nd floor has 3 bedrooms with closets and refurbished hardwood floors, full bath. 1st floor has living room with fireplace, dining room, kitchen with dishwasher and stove (refrigerator not included), and 1/2 bath. The unit has been totally repainted. Basement with washer/dryer hookups, walkout to rear yard. Oil heat and hot water, electric cooking, Small rear porch, parking for 2 cars, no pets, neighboring towns are Lincoln, Pawtucket, North Attleboro MA, Attleboro MA, 15 min to Providence, 10 minutes to 95 and S. Attleboro T station. available now $1650 per month, utilities not included 575-1382"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1650",
    "title": "Cumberland, 1/2 Duplex house, 3 beds, 1 1/2 baths,",
    "href": "https://providence.craigslist.org/apa/d/lincoln-cumberland-1-2-duplex-house-3/7028937903.html",
    "description": [
      "Cumberland, call 575-1382 for this 1/2 Duplex house, 2nd floor has 3 bedrooms with closets and refurbished hardwood floors, full bath. 1st floor has living room with fireplace, dining room, kitchen with dishwasher and stove (refrigerator not included), and 1/2 bath. The unit has been totally repainted. Basement with washer/dryer hookups, walkout to rear yard. Oil heat and hot water, electric cooking, Small rear porch, parking for 2 cars, no pets, neighboring towns are Lincoln, Pawtucket, North Attleboro MA, Attleboro MA, 15 min to Providence, 10 minutes to 95 and S. Attleboro T station. available now $1650 per month, utilities not included 575-1382"
    ],
    "duplicates": []
  },
  {
    "price": "$1700",
    "title": "Cumberland-single family house, 3 beds, 1 1/2 baths gas",
    "href": "https://providence.craigslist.org/apa/d/manville-cumberland-single-family-house/7043292381.html",
    "description": [
      "Cumberland, call 575-1382 for this single family house, ranch, 3 bedrooms with closets and new hardwood floors, living room with new hardwood floor, kitchen with dishwasher, stove, (refrigerator not included), ceramic tile floor, and slider door leading to rear deck, full bath with new vanity, toilet and lighting, lower level with finished playroom, 1/2 bath, basement storage and single car garage. All newly painted, gas heat and Central A/C., no pets, convenient to Lincoln, Providence, Pawtucket, Smithfield, Attleboro MA, North Attleboro, rent is $1700.00 per month, utilities not included, available now, please call 575-1382 with RI area code 401"
    ],
    "duplicates": [
      "7001538099",
      "7001538099"
    ]
  },
  {
    "price": "$1700",
    "title": "Cumberland-single family house, 3 beds, 1 1/2 baths gas",
    "href": "https://providence.craigslist.org/apa/d/manville-cumberland-single-family-house/7043291869.html",
    "description": [
      "Cumberland, call 575-1382 for this single family house, ranch, 3 bedrooms with closets and new hardwood floors, living room with new hardwood floor, kitchen with dishwsher, stove, (refrigerator not included), ceramic tile floor, and slider door leading to rear deck, full bath with new vanity, toilet and lighting, lower level with finished playroom, 1/2 bath, basement storage and single car garage. All newly painted, gas heat and Central A/C., no pets, convenient to Lincoln, Providence, Pawtucket, Smithfield, Attleboro Ma, North Attleboro, rent is $1700.00 per month, utilities not included, available now, please call for a showing 575-1382 with RI area code 401"
    ],
    "duplicates": []
  },
  {
    "price": "$1700",
    "title": "Cumberland-single family house, 3 beds, 1 1/2 baths gas",
    "href": "https://providence.craigslist.org/apa/d/manville-cumberland-single-family-house/7043290660.html",
    "description": [
      "Cumberland, call 575-1382 for this single family house, ranch, 3 bedrooms with closets and new hardwood floors, living room with new hardwood floor, kitchen with dishwasher, stove, (refrigerator not included), ceramic tile floor, and slider door leading to rear deck, full bath with new vanity, toilet and lighting, lower level with finished playroom, 1/2 bath, basement storage and single car garage. All newly painted, gas heat and Central A/C., no pets, convenient to Lincoln, Providence, Pawtucket, Smithfield, Attleboro MA, North Attleboro rent is $1700.00 per month, utilities not included, available now, please call for a showing 401 RI area code 575-1382"
    ],
    "duplicates": []
  },
  {
    "price": "$1400",
    "title": "3 BR Apartment For Rent",
    "href": "https://providence.craigslist.org/apa/d/albion-3-br-apartment-for-rent/7050881859.html",
    "description": [
      "Brand New 3 bedroom apartment with stainless steel appliances! Plenty of parking. Mixed use building."
    ],
    "duplicates": []
  },
  {
    "price": "$1250",
    "title": "$1250 / 2b for rent in Cumberland",
    "href": "https://providence.craigslist.org/apa/d/manville-b-for-rent-in-cumberland/7050582302.html",
    "description": [
      "2 bed / 1 bath apartment for rent in 4Elms condo in Cumberland, reserved car parking, Tennis court, Pool, nice friendly community easy commute to CVS, Fidelity, citizen bank, close to 295, 99 route. Across JJ Hill Elementary school walk able. pls call / text if interested."
    ],
    "duplicates": []
  },
  {
    "price": "$2322",
    "title": "Lease to own!",
    "href": "https://providence.craigslist.org/apa/d/cumberland-lease-to-own/7050201264.html",
    "description": [
      "LEASE TO OWN our 3bed, 2 full bath Cape in a great area. Generous closet storage. Brand new high efficiency oil forced water heating system installed November of 2018. City sewer and city water. Oak kitchen cabinets with corian counter tops, hard wood floors with dining area and a dining room for entertaining. Generous living room running front to back of the house and a 4 season sun room with access to back deck for entertaining. 2 car integral garage with asphalt driveway. The walk out basement offers an office and laundry area. For deserving buyers with a good down payment!",
      "Call",
      "show contact info",
      "x2 for more info!"
    ],
    "duplicates": [
      null,
      null
    ]
  },
  {
    "price": "$2322",
    "title": "Rent to own!",
    "href": "https://providence.craigslist.org/apa/d/cumberland-rent-to-own/7046237565.html",
    "description": [
      "LEASE TO OWN our 3bed, 2 full bath Cape in a great area. Generous closet storage. Brand new high efficiency oil forced water heating system installed November of 2018. City sewer and city water. Oak kitchen cabinets with corian counter tops, hard wood floors with dining area and a dining room for entertaining. Generous living room running front to back of the house and a 4 season sun room with access to back deck for entertaining. 2 car integral garage with asphalt driveway. The walk out basement offers an office and laundry area.  For deserving buyers with a good down payment!",
      "Call",
      "show contact info",
      "x2 for more info!"
    ],
    "duplicates": []
  },
  {
    "price": "$2322",
    "title": "LEASE TO OWN",
    "href": "https://providence.craigslist.org/apa/d/cumberland-lease-to-own/7041917656.html",
    "description": [
      "LEASE TO OWN our 3bed, 2 full bath Cape in a great area. Generous closet storage. Brand new high efficiency oil forced water heating system installed November of 2018. City sewer and city water. Oak kitchen cabinets with corian counter tops, hard wood floors with dining area and a dining room for entertaining. Generous living room running front to back of the house and a 4 season sun room with access to back deck for entertaining. 2 car integral garage with asphalt driveway. The walk out basement offers an office and laundry area. For deserving buyers with a good down payment!",
      "Call",
      "show contact info",
      "x2 for more info!"
    ],
    "duplicates": []
  },
  {
    "price": "$600",
    "title": "▬open concept featuring 3 bedrooms, 2 bathrooms home▬",
    "href": "https://providence.craigslist.org/apa/d/cumberland-open-concept-featuring-3/7038280135.html",
    "description": [
      "All this and more which includes water, sewer, trash and off-street parking. These newer, luxury Houses include the following: open concept featuring 3 bedrooms, 2 bathrooms home.",
      "F",
      "o",
      "r",
      "m",
      "o",
      "r",
      "e",
      "i",
      "n",
      "f",
      "o",
      "r",
      "m",
      "a",
      "t",
      "i",
      "o",
      "n",
      "V",
      "i",
      "s",
      "i",
      "t",
      "T",
      "o",
      "d",
      "a",
      "y",
      "w",
      "w",
      "w.",
      "R",
      "t",
      "o",
      "F",
      "i",
      "n",
      "d",
      "e",
      "r",
      "s",
      ".",
      "c",
      "o",
      "m",
      "Friendly, without being invasive existing housemates. Looking for mellow, genuinely easygoing, friendly without being invasive and respectful person. I know I wrote an essay here, just being forward in describing the place.\nEngineer/business professional, 3 total including you in large house. Place is laid out almost like a duplex, little living area leading into a very large for area kitchen with big 6-seat eat-in kitchen table (huge by apt standards), 2 upstairs bedrooms separate from common area 30' apart from each other), I’m in back suite type area you could call it (master + couple rooms on 1st floor). Rarely see each other. Just work a lot these days. Very lowkey.\nUnderstanding, Even-Keel Positive and good attitude is most important, place is great location, good size, near newly built.\n\nAT times you'll feel like you have a 2-bed apt to yourself, you'll share 1000+ sqft half of house (n small courtyard) w 1 person, super nice friendly. Professionally worked in manufacturing on management side, and side working on more dedicated focus on martech/software. Other housemate insurance/finance co.\n\nDoesn't matter what you do. As long as you're reliable, mentally well balanced, pay your bills, and get on easily with people. Must work at/near full-time/have full-time schedule.\n\nClose to beach/Back Bay (3 blk run to trails), flexible but all roommates have tended to stay at least a year, up to 2-1/2-3 years til work/relationship took elsewhere.\n\n2min onto 55fwy and 405 interchange, SFR on 6000+sqft lot with neighbors far off for a beach area, wood floors, new stainless appliances, newer frontload washer/dryer, BBQ, unique spot in established neighborhood with Newport blocks away. If you miss living in a house, tired of sharing walls, parking lot walk, waiting on laundry, tired of small room, Melrose Place drama of a complex, neighbor or kids stomping feet above your bedroom all hours on a worknight, this may be a good place for you.\n\nBoth of us Very active after workday, usually just crash and watch some comedy after eating later. When home, buried in something technical on PC, friendly and early to later mid-30s college grad professionals (if you're late 20s that's fine, if value a calm recharge spot, lived w grad student and a post-doc researcher in past), guys/women 27-40 usually.\nFocused often working on entrepreneurial effort in addition to normal FT work, rarely see me before 9/10p. Used to be avid cyclist at times rode as much as car (more running lately as easier/takes less time, or gym as can do that early/late). Past few years been too busy, but in past have been heavily into sailing, surf/ski/snowboarding, traveled, etc. Used to scuba, more interests than spare time these days. Not looking to relive college, just offset expenses some. Most of the time we miss each other with work schedules.\n\nReally need someone who kind of \"gets it\" on that front and doesn't take it personal when someone's \"on the run\" getting things done (50-60 hour working not uncommon, etc.).\n\nLots of things here free for use so you'll save on things from laundry to nicer kitchen pans/dishes/appliances/etc., in-house Washer/Dryer ... that kind of thing.\n\n\nLooking for person who: isn't needy, live's healthy, low anxiety, has a career or pursuing one, stable job, etc. Age doesn't necessarily matter, 28-37 is current roommates.\nNot interested in 2 friends to a room, kids staying weekends, recently divorced, no intent of staying awhile (though it's month-to-month, most stay 1+ to near 3 years), like to keep it low-key and drama free. Looking for positive vibe people. Know how to have fun, but house is meant to relax, decompress, rest, laugh, watch some TV, have some wine/beer once in awhile, use proximity to outdoors which is great here, not deal with drama or excessive coming/going of randoms. Friendly, have outside lives going on.\n\nGood spot If you want to avoid Irvine Co. raising rent often, and neighbors on each side (nearest building 30’+). Kinda place you just have to see (UCI isn't far if you're an older grad student, worked well living with post-doc UCI employees as well as older students). Lived in area long-time, close enough to action/beach, highway access close for work. Beach is close yet far enough away say now/summer when your neighbor decides to AirBnB to anyone with a pulse, so that you can sleep year round and find parking (driveway), area doesn't have temp or 9mo rentals. Find it best of both worlds as it's more room/quieter/less tourists/easy parking/etc., yet close to everything, used to live closer to beach/Peninsula and it took 15+ minutes just to get to highway access once south of the Triangle, plus the highway commute.\n\nHouse is large/private enough and bigger than what you'll find in area (small half sized 3bd rundown house around corner is going well over $3000+ as reference, 2bd apt 700sqft apt with decent room size near us run $2400 in 50+ year old buildings sometimes even lacking insulation as my old place did), comparable newer similar house near corner recently lasted 2 weeks before $5300 rental. This room is priced bit under as I carry everything financially, and prefer good fit, less churn, keep the peace and attract right person, rather than rush to fill vacancy based on $. Not going to raise every 6-12 mos for $50-$100, just offsetting some expenses.\n\nA very stable situation, not going anywhere, been living in area a long time, (essentially it's a 4bd with one serving as a flex/office room, not including a great room and large kitchen). Everything's newer, and free to use, as long as it's taken care of, laundry room as well, easy parking driveway spot. It is fully stocked house with nice stainless steel appliances, pots/pans, teak floors, etc.\n\nThere’s a lot here. Looking forward to your interest, and a bit about yourself. All the best in your search."
    ],
    "duplicates": []
  },
  {
    "price": "$1000",
    "title": "Why is everything a scam?",
    "href": "https://providence.craigslist.org/apa/d/cumberland-why-is-everything-scam/7035951772.html",
    "description": [
      "Hi guys! So we are a little family and looking for a 2 bedroom that allows pets. (Dog) everyone i have talked to from here wants money sent because their on vacation someone on a church retreat somewhere. 😂 like what the fuck? I just need a 2 bedroom decent apartment! We borh work full time and are a very quiet couple and awesome tenants! Rent will always be paid on time in full! Please someone give us this christmas gift we desperately need!"
    ],
    "duplicates": []
  },
  {
    "price": "$1875",
    "title": "2 Bedroom Condo",
    "href": "https://worcester.craigslist.org/apa/d/cumberland-2-bedroom-condo/7043763335.html",
    "description": [
      "Must See 2 story condo, custom closet and unfinished basement.  Lots of storage.    First floor en suite and 2nd floor Master Bedroom with Loft.  Perfect for home office.    Washer and Dryer  on 2nd floor.",
      "Located just minutes from bustling downtown Providence, Berkeley Commons is a quiet condominium village encompassed in lush landscaping and pedestrian-friendly sidewalks. This charming community offers stately 2-bedroom town homes with garages, cozy front porches, dual master suites, and fully applianced kitchens."
    ],
    "duplicates": []
  },
  {
    "price": "$1250",
    "title": "Spacious remodeled 3 bedrooms on 1st floor in Cumberland",
    "href": "https://providence.craigslist.org/apa/d/central-falls-spacious-remodeled-3/7054613637.html",
    "description": [
      "Beautiful 3 bedroom apartment on first floor in excellent convenient Cumberland location. Great school, Next to school, playground and baseball field. Beautifully remodeled modern eat in kitchen, newer stainless appliances, large living room, spacious modern bathroom and good sized bedrooms, all hardwood floor, new kitchen floor, replacement windows, gas heating, free parking. Utility not included in the rent. Application required. Please cantact Ray at",
      "show contact info",
      "for showing."
    ],
    "duplicates": [
      "5877213368"
    ]
  },
  {
    "price": "$1650",
    "title": "Cumberland, 1/2 duplex, 3 beds, 1 1/2 baths,",
    "href": "https://providence.craigslist.org/apa/d/lincoln-cumberland-1-2-duplex-3-beds/7050973319.html",
    "description": [
      "Cumberland, call 575-1382 for this 1/2 Duplex house, 2nd floor has 3 bedrooms with closets and refurbished hardwood floors, full bath. 1st floor has living room with fireplace, dining room, kitchen with dishwasher and stove (refrigerator not included), and 1/2 bath. The unit has been totally repainted. Basement with washer/dryer hookups, walkout to rear yard. Oil heat and hot water, electric cooking, Small rear porch, parking for 2 cars, no pets, neighboring towns are Lincoln, Pawtucket, North Attleboro MA, Attleboro MA, 15 min to Providence, 10 minutes to 95 and S. Attleboro T station. available now $1650 per month, utilities not included 575-1382"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1700",
    "title": "Cumberland-single family house, 3 beds, 1 1/2 baths gas",
    "href": "https://providence.craigslist.org/apa/d/manville-cumberland-single-family-house/7043292381.html",
    "description": [
      "Cumberland, call 575-1382 for this single family house, ranch, 3 bedrooms with closets and new hardwood floors, living room with new hardwood floor, kitchen with dishwasher, stove, (refrigerator not included), ceramic tile floor, and slider door leading to rear deck, full bath with new vanity, toilet and lighting, lower level with finished playroom, 1/2 bath, basement storage and single car garage. All newly painted, gas heat and Central A/C., no pets, convenient to Lincoln, Providence, Pawtucket, Smithfield, Attleboro MA, North Attleboro, rent is $1700.00 per month, utilities not included, available now, please call 575-1382 with RI area code 401"
    ],
    "duplicates": [
      "7001538099",
      "7001538099"
    ]
  },
  {
    "price": "$2322",
    "title": "Lease to own!",
    "href": "https://providence.craigslist.org/apa/d/cumberland-lease-to-own/7050201264.html",
    "description": [
      "LEASE TO OWN our 3bed, 2 full bath Cape in a great area. Generous closet storage. Brand new high efficiency oil forced water heating system installed November of 2018. City sewer and city water. Oak kitchen cabinets with corian counter tops, hard wood floors with dining area and a dining room for entertaining. Generous living room running front to back of the house and a 4 season sun room with access to back deck for entertaining. 2 car integral garage with asphalt driveway. The walk out basement offers an office and laundry area. For deserving buyers with a good down payment!",
      "Call",
      "show contact info",
      "x2 for more info!"
    ],
    "duplicates": [
      null,
      null
    ]
  }
]