[
  {
    "price": "$700",
    "title": "$700 / 1br - WAKEFIELD PRIVATE IN-LAW APPT. FOR 2020-2021 SCHOOL YEAR",
    "href": "https://providence.craigslist.org/apa/d/wakefield-700-1br-wakefield-private-in/7039538090.html",
    "description": [
      "AVAILABLE AUGUST 1st 2020.  Looking for a student or young professional for a 1 year lease with possibility of extension. The house is in a nice, quite neighborhood minutes from URI and Narragansett beach. The apartment is fully furnished, has a private entrance, bathroom, bedroom, and living area. Shared kitchen. The house has a large, fenced in backyard, laundry, off street parking, large basement for storage.",
      "Rent is $700.00 plus utilities",
      "We have HIGH STANDARDS because we hope you do too! No smokers, drugs, party animals, etc! No animals (we have a cat and a dog). THIS IS A RENTAL FOR ONE STUDENT OR YOUNG PROFESSIONAL ONLY",
      "If interested please CALL AND ASK FOR AMY. Please do not text me.",
      "Thank you."
    ],
    "duplicates": []
  },
  {
    "price": "$1000",
    "title": "Academic Rental  September 2020 -June 2021",
    "href": "https://providence.craigslist.org/apa/d/jamestown-academic-rental-september/7055207501.html",
    "description": [
      "Furnished Two Bedroom house in Bonnet Shores. Full bed and a Queen Size bed, Washer/Dryer, dishwasher, large deck, parking, oil heat, Free trash removal. Office space. 5.7 miles from URI.  1.5 miles from the Bay Campus. Quiet neighborhood. Give us a look,   call",
      "show contact info",
      "or text",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$950",
    "title": "1 Bed - Downtown Wakefield",
    "href": "https://providence.craigslist.org/apa/d/wakefield-1-bed-downtown-wakefield/7053472651.html",
    "description": [
      "1 bedroom apartment available Feb 1st. Located in walking distance to Main St Wakefield and bike path.",
      "$950/month",
      "No pets",
      "Call Liz at",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$700",
    "title": "WAKEFIELD PRIVATE IN-LAW APPT. FOR 2020-2021 SCHOOL YEAR",
    "href": "https://providence.craigslist.org/apa/d/wakefield-wakefield-private-in-law-appt/7023826585.html",
    "description": [
      "Private in-law apartment available starting the 1st of August 2020.",
      "Looking for a student or young professional for a 1 year lease with possibility of extension.  The house is in a nice, quite neighborhood minutes from URI and Narragansett beach. The apartment is fully furnished, has a private entrance, bathroom, bedroom, and living area. Shared kitchen. The house has a large, fenced in backyard, laundry, off street parking, large basement for storage.",
      "Rent is $700.00 plus utilities",
      "We have HIGH STANDARDS because we hope you do too! No smokers, drugs, party animals, etc! No animals (we have a cat and a dog).   THIS IS A RENTAL FOR A STUDENT OR YOUNG PROFESSIONAL ONLY",
      "If interested please CALL AND ASK FOR AMY. Please do not text me.",
      "Thank you."
    ],
    "duplicates": []
  }
]