[
  {
    "price": "$950",
    "title": "1 Bedroom Turnkey Fully Furnished $950",
    "href": "https://providence.craigslist.org/apa/d/north-smithfield-1-bedroom-turnkey/7058331276.html",
    "description": [
      "One bedroom separate apartment in a beautifully restored antique home in safe convenient area of North Smithfield. Available now. Perfect for one in transition or here on contract.",
      "$950 rent includes hot water, wi-fi, basic cable TV,  kitchen appliances, tableware. and off-street parking space.",
      "One year lease.  First month + $950 cleaning/security (Shorter term may be considered with higher monthly rent.)",
      "Entrance is private. This second floor apartment has hardwood floors, a kitchenette with small stove and refrigerator, and large microwave. There is a full bath with soaking tub/shower. No washer/dryer on site, but laundromat is nearby.",
      "The space is divided into a living area and 14' x 14' separate bedroom with complete lovely furnishings for one on a temporary contract or experiencing a time of transition.",
      "No smoking nor pets."
    ],
    "duplicates": []
  },
  {
    "price": "$1400",
    "title": "Looking for apartment for my family",
    "href": "https://providence.craigslist.org/apa/d/north-smithfield-looking-for-apartment/7057206169.html",
    "description": [
      "Looking for at least a 2 bedroom apartment in the woonsocket area. Looking to move in as soon as possible.",
      "Depending on what utilities are included or not depends on rent price highest I can go is $1,300-$1,400",
      "My name is CoriAnne I have two daughters a 2 year old and a newborn and fiance that would be moving in. My fiance works five days a week and I will be returning to work in February as I am on maturity leave at the moment. I am just waiting on my taxes for a down deposit as we do not live together. Its been hard to come up with the whole deposit amount at the moment due to living at a family members and my fiance living in his car.",
      "You can reach me at",
      "show contact info",
      "Or my Fiance Cory at",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$995",
    "title": "Realtor offering services to landlords, renters, buyers, and sellers",
    "href": "https://providence.craigslist.org/apa/d/north-smithfield-realtor-offering/7045335809.html",
    "description": [
      "Hello! I am a licensed Realtor offering my services to anyone in search of a home to rent, home to purchase, home to sell, or to landlords in search of renters for a rental property.",
      "Before discussing my services here, the last person to respond to this ad listed his condo with me for sale in the last week of October and we put it under contract, at FULL ASKING PRICE, within five days. I'd love to repeat the feat for you!",
      "To landlords: I have successfully rented approximately 150 apartments in my career with a near spotless eviction record. I am only aware of two evictions out of all of the deals I have put together. I am also a property owner and have experience managing homes, scheduling repairs, and rent collection. My commission for renting an apartment is one month's rent.",
      "To buyers: I specialize in working with first time home buyers. I have worked with all types of buyers, but my greatest joy comes from walking first-timers through the oft-scary process of buying a home. My resource team, with whom I have worked for years including on purchases of my own, is amazing and always takes great care of my clients. Even if you don't think you're ready to buy, I am willing to have a conversation with you FOR FREE to help put you in great position to purchase a home.",
      "To sellers: I specialize in properly assessing the market value of your home and walking you through the process of how I arrive at my price opinion. The listing price of your home is not a number I decide on, but a number WE decide on as a team. I am not the realtor who tells you that you can get a million dollars for a half million dollar home. I paint a realistic picture of the market for you and we decide from there how you would like to proceed. I will offer my opinion on the price of your home FOR FREE. No strings attached.",
      "To renters: Renting today is scary. Do you have area expertise? Do you have any idea if the rent you are being charged is fair? Do you know what your rights are as a tenant? I do. I can help guide you through this process.",
      "I'd love to talk to you and see how I can help you fulfill your real estate goals."
    ],
    "duplicates": []
  },
  {
    "price": "$900",
    "title": "1st Floor Cozy 2 Bedroom Apartment",
    "href": "https://providence.craigslist.org/apa/d/slatersville-1st-floor-cozy-2-bedroom/7056237666.html",
    "description": [
      "Call to see this 2 bedroom apartment in nice area.",
      "Has off street parking, yard in back and front",
      "No pets;  Section 8 welcome to apply",
      "Call Sandra at",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$900",
    "title": "Great location 2 bedroom 2nd floor",
    "href": "https://providence.craigslist.org/apa/d/north-smithfield-great-location-2/7045186927.html",
    "description": [
      "Freshly painted 2 bedroom, second floor apartment with carpeting and appliances.",
      "Storage in basement. Off street parking. No pets. Heat and hot water included. $900.00/mo",
      "Nicely located near North Smithfield line."
    ],
    "duplicates": []
  },
  {
    "price": "$950",
    "title": "Great location 1st floor 2 bedroom",
    "href": "https://providence.craigslist.org/apa/d/north-smithfield-great-location-1st/7045201920.html",
    "description": [
      "Newly renovated first floor, 2 bedroom apartment. Freshly painted, new carpeting and new appliances.",
      "Storage in basement. Off street parking. No pets. Heat and hot water included. $950.00/mo",
      "Nicely located near North Smithfield line."
    ],
    "duplicates": []
  },
  {
    "price": "$1300",
    "title": "Mill Building Condo for Rent - North Smithfield",
    "href": "https://providence.craigslist.org/apa/d/north-smithfield-mill-building-condo/7054040041.html",
    "description": [
      "1 bedroom/1 bath condo for rent in North Smithfield Mill Building!  Right on the MA line!  Easy commute to Providence or Worcester.  $50 non refundable application fee for credit check. No pets.  This is a small unit with the galley style kitchen on the first floor and the living area/small bedroom/bath on the second floor. 2 off street parking spaces.  Washer/Dryer hookups.  Kitchen appliances included. Common rooms include a gym, gameroom, library and a common rooftop deck."
    ],
    "duplicates": []
  },
  {
    "price": "$1100",
    "title": "3 bedroom 2nd Floor",
    "href": "https://providence.craigslist.org/apa/d/slatersville-3-bedroom-2nd-floor/7051058165.html",
    "description": [
      "2nd floor. 3 Bedroom, 1 bath. Heat and hot water included. Laundry hookups. Nice apt and neighborhood. Conveniently located. No smoking. No pets. $1100 month .  1st + Security. Call Dan.",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$950",
    "title": "One Bedroom Apartment",
    "href": "https://providence.craigslist.org/apa/d/forestdale-one-bedroom-apartment/7043133122.html",
    "description": [
      "Recently renovated one bedroom apartment in North Smithfield with easy access to route 102, 146 and 295.  Heat and hot water included.  Coin operated laundry.  Includes upgraded kitchen with Corian countertops and outdoor deck/patio.  Applicant must have prior rental and credit history.  No pets and no smoking.  Available Jan 15, 2020."
    ],
    "duplicates": []
  }
]