[
  {
    "price": "$2250",
    "title": "Lovely Unfurn/Furnish 3 bed Apt, 2 Blocks to Brown Avail Now or 20-21",
    "href": "https://providence.craigslist.org/apa/d/providence-lovely-unfurn-furnish-3-bed/7049788327.html",
    "description": [
      "This beautiful, spacious, renovated, well-located, 3 bedroom, 2nd floor apt is on Preston St (between Hope St and Ives St) and is close to everything at Brown University. It can be rented furnished or unfurnished for January, February, Spring, or the 2020-2021 academic year.  The apt is located is in the heart of College Hill and is just 2 blocks from Brown University and close walking distance to RISD, Rhode Island Hospital, Hasbro Hospital, Thayer St, Wickenden St, Wayland Square, Whole Foods, Eastside Marketplace, Starbucks, Walgreens, bus stop, restaurants, & shops. It’s also biking distance to Butler and Miriam Hospitals. The apt has lovely hardwoods, tall ceilings, kitchen with updated stainless steel appliances, microwave, coffeemaker, dishwasher, garbage disposal, nice dining table, & kitchenware.The bathroom has an Ikea sink & vanity, clawfoot tub & shower, and marble floors. Free laundry is available in the basement and plenty of closet storage is available. There is a large yard and parking lot in back of the house with one off-street parking space included with the rental.  A second parking space is negotiable for a monthly fee. WIFI is available. Pets ok with pet fee. 1 block to a park. This apt has housed many happy undergraduate & graduate students, visiting scholars, speakers, professors, travel nurses and other professionals. $2250-$2400 per month (depending on if you are renting unfurnished or furnished, or $750-$800 per person for 3 people if you can find your own roommates. Price and lease length negotiable. Owner is willing to consider short-term monthly rentals for the Spring and 1 year leases for the 2020-2021 academic year.  Feel free to email me if you are looking for safe, affordable furnished housing close to Brown for January, February, Spring, or the 2020-2021 academic year in Providence, Ri."
    ],
    "duplicates": []
  },
  {
    "price": "$2100",
    "title": "Lovely Unfurn/Furnish 2-3 bed Apt Wayland Square Avail Feb or 2020-21",
    "href": "https://providence.craigslist.org/apa/d/providence-lovely-unfurn-furnish-2-3/7049844248.html",
    "description": [
      "This beautiful, well-located 2-3 bedroom, 2nd floor unfurnished or furnished apt is located in College Hill's Wayland Square in an amazing neighborhood close to all amenities on a quiet, beautiful, residential street  It's available February 1 and for the Spring, Summer, or 2020-2021 academic year as an unfurnished rental for $2100 per month or as a furnished rental for $2250 per month.  Price and lease length negotiable. Owner is willing to consider short-term monthly rentals for the Spring and 1 year leases for the 2020-2021 academic year",
      "The apt is close walking or biking distance to Brown & RISD, Rhode Island Hospital, Hasbro Hospital, Butler and Miriam Hospitals, Thayer St, Wickenden St, and is 2-3 blocks walk to trendy Wayland Square, Whole Foods, Eastside Marketplace, Walgreens, Starbucks, restaurants, shops, a 5 block walk to Blackstone Blvd, the best scenic, running, walking, biking trail in the city,  1 block walk to the playground, & bus stop, and 2 blocks walk to the dog park.  The apt has two bedrooms (1 king bed and 1 queen bed), and the possibility of a third bedroom or large office  (1 queen futon). It features a sunlit living room, lovely hardwoods, leather sofa and armchairs, dining table, and ceiling fans. The fully equipped kitchen has a fridge, stove, microwave, coffeemaker, and kitchenware.  Bathroom has a nice clawfoot bathtub and expanded \"rainshower\" showerhead.  Wireless internet, free laundry (washer and dryer in the building), and free parking are included with the rental.  Utilities are not included except for cold water/garbage. Pets allowed for a pet fee. Blackout curtains are also available.  This apt has housed many happy undergraduate & graduate students, visiting scholars, speakers, professors, travel nurses and other professionals. $2250 if rented as a furnished 2-3 bedroom. $2100 if rented as an unfurnished 2-3 bedroom. Brown, RISD, downtown Providence and the hospitals are easily accessible by walking straight down historic Angell St.  If you want an apt that is beautiful, safe, and central to the colleges and downtown this is the perfect place for those looking to work and live near Brown and RISD and the best that College Hill has to offer. Feel free to email me if you are looking for safe, affordable furnished housing close to Brown for February, Spring, or the 2020-2021 academic year in Providence, Ri.",
      "1st months rent, 1 month  security deposit, and $40 background/credit check fee with lease signing. Tenant pays utilities. Parking available. No smoking. Pets allowed with fee."
    ],
    "duplicates": []
  },
  {
    "price": "$1900",
    "title": "Lovely Unfurnished 2 bed Apt Wayland Square Avail July 1",
    "href": "https://providence.craigslist.org/apa/d/providence-lovely-unfurnished-2-bed-apt/7056885799.html",
    "description": [
      "This beautiful, well-located 2 bedroom, 1st floor unfurnished apt is located in College Hill's Wayland Square in an amazing neighborhood close to all amenities on a quiet, beautiful, residential street  It's available July 1  as an unfurnished rental for $1900 per month.",
      "The apt is close walking or biking distance to Brown & RISD, Rhode Island Hospital, Hasbro Hospital, Butler and Miriam Hospitals, Thayer St, Wickenden St, and is 2-3 blocks walk to trendy Wayland Square, Whole Foods, Eastside Marketplace, Walgreens, Starbucks, restaurants, shops, a 5 block walk to Blackstone Blvd, the best scenic, running, walking, biking trail in the city,  1 block walk to the playground, & bus stop, and 2 blocks walk to the dog park.  The apt has two bedrooms, and the possibility of a large office or dining room. It also features a sunlit living room, lovely hardwoods and ceiling fans. The fully equipped kitchen has a fridge, stove and microwave.  Wifi available for an additional fee.  Free laundry (washer and dryer in the building), and free parking are included with the rental.  Utilities are not included except for cold water/garbage. Pets allowed for a pet fee.  This apt has housed many happy undergraduate & graduate students, visiting scholars, speakers, professors, travel nurses and other professionals.  Brown, RISD, downtown Providence and the hospitals are easily accessible by walking straight down historic Angell St.  If you want an apt that is beautiful, safe, and central to the colleges and downtown this is the perfect place for those looking to work and live near Brown and RISD and the best that College Hill has to offer. Feel free to email me if you are looking for safe, affordable housing close to Brown starting July 1st.",
      "1st months rent, 1 month  security deposit, and $40 background/credit check fee with lease signing. Tenant pays utilities. Parking available. No smoking. Pets allowed with fee."
    ],
    "duplicates": []
  },
  {
    "price": "$2250",
    "title": "Beautiful Unfurn/Furnish 3 bed, 2 Blocks to Brown Avail 9/1",
    "href": "https://providence.craigslist.org/apa/d/providence-beautiful-unfurn-furnish-3/7057279260.html",
    "description": [
      "This charming 3 bedroom, 1 bathroom apt is located in the heart of College Hill. The apt is just 2 blocks to Brown University & a short walk to RISD & Thayer St. Beautiful, inexpensive & central to the colleges this is the perfect place! This spacious 1st floor apt has been remodeled with newer appliances, hardwood floors and cabinets, impressive french doors, high ceilings, ceiling fan, and has lots of natural light. It's available starting  9/1 as an  unfurnished rental for $2250 per month, $2400 per month for a furnished rental for a 1 to 2 year or longer lease. Just two blocks from Brown University, the apt features 3 large bedrooms, 1 bathroom, and 1 living room. The kitchen has a gas stove, refrigerator, and dishwasher. The bathroom has a tub shower.  Free laundry available in the building, plenty of storage and a decorative fireplace. The backyard is a large yard and parking lot with off- street parking available. The apt is located in the heart of College Hill and is just 2 blocks from Brown University and close walking distance to RISD, Rhode Island Hospital, Hasbro Hospital, Thayer St, Wickenden St, Wayland Square, Whole Foods, Eastside Marketplace, Starbucks, Walgreens, bus stop, restaurants, & shops. It's also biking distance to Butler and Miriam Hospitals.  It's also 1 block to the nearest playground & bus stop, near Zipcars, and within walking distance  to downtown amenities. This apt is well above the average condition of most apartments close to Brown, and is the perfect rental for students or professionals looking to work and live near Brown and RISD.  One or two year or longer lease available. 1st months rent, last months rent, 1 months security deposit, and $40 background/credit check fee with lease signing. Tenant pays utilities. Parking available. No smoking or pets."
    ],
    "duplicates": []
  },
  {
    "price": "$1650",
    "title": "Beautiful 2 bed/Ready June/Summit/East Side",
    "href": "https://providence.craigslist.org/apa/d/providence-beautiful-2-bed-ready-june/7056680148.html",
    "description": [
      "Beautiful two bedroom, one bathroom first floor apartment ready to rent come June. Located in the Summit neighborhood. Steps away from Mariam hospital, Summer's Farmer's markets at Lippitt park, and Blackstone Blvd. Near to Brown University, RISD, and easy highway access. Comes with private washer and dryer in basement. Hardwood floor, dishwasher, large eat in kitchen, one bathroom, living room, and two bedrooms. Off street parking available. Shared backyard with patio. Pets considered. Ready June."
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1650",
    "title": "East Side/June/2 bed/Summit neighborhood",
    "href": "https://providence.craigslist.org/apa/d/providence-east-side-june-2-bed-summit/7056027559.html",
    "description": [
      "Beautiful two bedroom, one bathroom first floor apartment ready to rent come June.",
      "Located in the Summit neighborhood. Steps away from Mariam hospital, Summer's Farmer's markets at Lippitt park, and Blackstone Blvd. Near to Brown University, RISD, and easy highway access.",
      "Comes with private washer and dryer in basement.",
      "Hardwood floor, dishwasher, large eat in kitchen, one bathroom, living room, and two bedrooms.",
      "Off street parking available.",
      "Shared backyard with patio.",
      "Pets considered.",
      "Snow removal and grounds keep included in your rent.",
      "Ready June.",
      "When emailing me please tell me a little about yourself."
    ],
    "duplicates": []
  },
  {
    "price": "$3200",
    "title": "Fox Pt./East Side/SF house/ June 1st",
    "href": "https://providence.craigslist.org/apa/d/providence-fox-pt-east-side-sf-house/7046990155.html",
    "description": [
      "Ready June 1st",
      "4 bedrooms, 1 and half bathrooms, kitchen, dinning room, living room, and basement with washer and dryer included in your rent. Yard, and off street parking for about four vehicles.",
      "Professionally managed property.",
      "Near Brown University and RISD located in Fox Point's East Side neighborhood.",
      "Contact through email and please tell me about yourself.",
      "Tenants pay their own gas heat and electric.",
      "Hardwood floors  throughout and tile in bathrooms.",
      "Ready June 1st",
      "$3,200.00 a month."
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$3200",
    "title": "Fox Pt./East Side 4 Bed/SF house/ June 1st",
    "href": "https://providence.craigslist.org/apa/d/providence-fox-pt-east-side-4-bed-sf/7028965020.html",
    "description": [
      "Ready June 1st, 2020 Single family house for rent with parking",
      "4 Bedroom 1 and half bathrooms",
      "Located in Fox Point neighborhood on East Side.",
      "Hardwood floors, kitchen, living room, dining room, and half bathroom on the first floor. Second floor has four good size bedrooms and a full bathroom.",
      "Basement has washer and dryer for tenants to use.",
      "There's a yard and off street parking.",
      "Tenants pay their own gas and electric",
      "Owner pays sewer and water",
      "Near to Brown University and RISD",
      "and sits on the corner of Governor and Power Street. Ideal for professionals or students.",
      "Email me for more details.",
      "Please tell me a bit about yourself when emailing."
    ],
    "duplicates": []
  },
  {
    "price": "$2100",
    "title": "Charming two bedroom Fox Point Cottage",
    "href": "https://providence.craigslist.org/apa/d/providence-charming-two-bedroom-fox/7053896328.html",
    "description": [
      "A newly renovated two bedroom cottage perfectly located on the east side of Providence in Fox Point. This bright and charming home features high efficiency heating and air conditioning, granite countertops, stainless steel appliances and hardwood flooring throughout. Two bedrooms with ample closet space and in-unit laundry. Apartment IS Pet Friendly, and one off street parking is included.",
      "This can be seen just behind Talulah Tacos, and walking distance to many of Providence's favorites on the east side including PVD Donuts, 102 Noodles, The Shop and countless others on Wickeden Street.",
      "Please feel free to reach out via phone or email to schedule viewings, please give 24-48 hour notice to respect current tenant.",
      "Text",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$800",
    "title": "205 Cole Ave, Rent to own, 2 beds 2 bath-- sqft",
    "href": "https://providence.craigslist.org/apa/d/providence-205-cole-ave-rent-to-own-2/7059055740.html",
    "description": [
      "Whole house, recently fully renovated - available for rent to own in one of the most enviable neighborhood of Providence RI - 2 bedrooms upstairs, Living room and Kitchen downstairs, full bathroom upstairs and half bath on the first floor. People usually rent to own it the moment they see it.",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1100",
    "title": "Spectacular views of Prospect Park looking for rent to own@",
    "href": "https://providence.craigslist.org/apa/d/providence-spectacular-views-of/7059051958.html",
    "description": [
      "Spectacular views of Prospect Park looking over downtown Providence! This second floor 1 bedroom 1 and a half bathroom has high ceilings and a ton of closet space! Apartment also features built in storage in the living area, a small outdoor courtyard, 1 off street parking space and washer and dryer in unit! Must see to appreciate the views and location!",
      "Available for rent to own, please recently contact my personal mail:",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1095",
    "title": "Attractive 2 bed, off Hope/Fireplace/ New Price",
    "href": "https://providence.craigslist.org/apa/d/providence-attractive-2-bed-off-hope/7059088094.html",
    "description": [
      "New price: $1095, lovely 5 rooms, Off Hope, two bedrooms, first fl, double parlor, mirrored fireplace, and finished wood floors, eat-in-kitchen and pantry, full bath. Great location for Brown or RISD and Downtown! Walk to Hope restaurants and Farmer's Market at Lippitt Park/Blackstone Blvd and Miriam Hospital. Brown and RISD are a short bike ride.  Easy access to Interstate 95.  This property is sunny and bright, newer heat, new stainless appliances, new windows and recent paint. Parking and private backyard.",
      "Easy to show call Owner/manager:",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1095",
    "title": "Large apartment, off Hope, 5 rms, 2 bed",
    "href": "https://providence.craigslist.org/apa/d/providence-large-apartment-off-hope-5/7059087404.html",
    "description": [
      "East Side: new price, $1095 large apartment, double parlor! Near all East Side conveniences: Hope St restaurants, Farmers Market and Blackstone Blvd, Whole Foods, Garden Grille, LA Fitness etc! This apartment has double parlor with hardwood floors throughout, kitchen, full bath, parking.  Available now. It is sunny and bright, new heat, newer appliances, recent paint. Nice yard.",
      "Easy to show call Owner/manager:",
      "show contact info"
    ],
    "duplicates": [
      "4828116310"
    ]
  },
  {
    "price": "$1095",
    "title": "Large apartment, off Hope, 5 rms, 2 bed",
    "href": "https://providence.craigslist.org/apa/d/providence-large-apartment-off-hope-5/7054349914.html",
    "description": [
      "East Side: new price, $1095 large apartment, double parlor! Near all East Side conveniences: Hope St restaurants, Farmers Market and Blackstone Blvd, Whole Foods, Garden Grille, LA Fitness etc! This apartment has double parlor with hardwood floors throughout, kitchen, full bath, parking.  Available now. It is sunny and bright, new heat, newer appliances, recent paint. Nice yard.",
      "Easy to show call Owner/manager:",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1050",
    "title": "56 Hillside Ave, 3 Beds 2.5 Beds For Rent to Own",
    "href": "https://providence.craigslist.org/apa/d/providence-56-hillside-ave-3-beds-25/7056489828.html",
    "description": [
      "Well cared for, 3 bed 2.5 bath on a double lot on the East Side of Providence. Features include an updated kitchen, 2 updated bathrooms, hardwoods throughout, new roof, newer heating system, and so much more. The custom porch overlooks the additional lot with a fully fenced yard making it perfect for young children and furry friends. This home sits in the perfect location. Walk to the farmer's market at Lippitt Park, Blackstone Blvd. and all the shops and restaurants on Hope St. This property won't last ACT NOW!! If you are interested, please send a message",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1495",
    "title": "3rdFlr 3Bed RENOVATED Hardwoods FreshPaint PetsOK Laundry Prkg Storage",
    "href": "https://providence.craigslist.org/apa/d/providence-3rdflr-3bed-renovated/7042096690.html",
    "description": [
      "407 Morris Avenue Unit 3, Providence RI, 02906",
      "View our walkthrough of the property on YouTube:",
      "https://www.youtube.com/watch?v=shWHhBwkwl4",
      "(Copy and Paste link into Browser)",
      "FEATURES:",
      "-3rd Floor Apartment",
      "-RECENTLY RENOVATED! Includes New Paintjob and Redone & Repolished Hardwood Flooring",
      "-Reliable Location, Close to Hope Street Shopping, Blackstone Blvd, Thayer Street and Brown University",
      "-Gas Baseboard Heat throughout Apartment",
      "-3 Bedrooms (See Video for Sizes), 2 Bedrooms feature Closet Spaces w/ Double Glass Sliding Doors",
      "-Medium Kitchen Area w/ Dining Room featuring Open Window Set Up!",
      "-Kitchen features Large Refrigerator, 4 Burner Gas Stove w/ Oven and Exhaust Fan, and a Double Bin Stainless Steel Sink w/ Spray Nozzle",
      "-Plenty of Cabinets and Counter Tops in Kitchen!",
      "-Medium Bathroom w/ Full Tub and Cabinets for Storage",
      "-Bathroom features Stylish Tile Flooring",
      "-Private Patio Space located to Rear of Apartment, lots of Room and Very Secluded!!",
      "-Shared Front Entrance and Rear Entrance to Apt",
      "-Free Laundry and Storage Available in Basement!!",
      "-Pets are OK w/ $25 monthly fee per Pet",
      "-1 Off Street Parking Spot available! Unlimited Street Parking available w/ Permit!",
      "-Landscaping and Snow Removal Included",
      "-Water and Sewer are provided!",
      "-This is a 3 Unit Building!",
      "-Pay Rent Online",
      "-File Maintenance Requests Online",
      "-Chat With Staff Live 24/7",
      "-New Tenant Receives Nexus Welcome Package",
      "*Tenant is responsible for Electric, Gas, and Other Personal Utilities (Water + Sewer are provided)",
      "Ready to move in, First Come, First Serve basis",
      "REQUIREMENTS:",
      "*1st months rent and equal security deposit required for move in",
      "**Must pass background investigation and credit check",
      "***$25 Application Fee (Per adult 18 and over)",
      "****Gross (Before Tax) Monthly Income Must Be At Least 3X Monthly Rent (Must Provide Proof)",
      "Text Nexus Text Assist at 888-98-NEXUS to schedule a showing ASAP",
      "Reply to this ad via EMAIL and a Nexus Agent will contact you ASAP for a showing",
      "Call NEXUS today to schedule a showing at a moments notice at",
      "show contact info",
      "Curious About Nexus?",
      "View Our Reviews Here! (https://plus.google.com/+Nexri/posts)",
      "Benefits of Renting With NEXUS",
      "-24/7 Response Line",
      "-Online Portal for all Tenants",
      "-Epayments",
      "-Easy Maintenance Request Submission",
      "-Key Copying Service",
      "-Regular Inspections for Preventative Maintenance",
      "-Skilled & Responsive Staff",
      "-Notary Public Service",
      "Nexus Property Management",
      "\"Connecting You to Better Living\"",
      "RI/MA Website - www.NexRI.com",
      "Corporate Website - www.Nexuspropertymanagement.com"
    ],
    "duplicates": []
  },
  {
    "price": "$450",
    "title": "Beautiful 2 bedroom 2 bathroom apart located in Rhode island, $450",
    "href": "https://providence.craigslist.org/apa/d/providence-beautiful-2-bedroom-2/7058960162.html",
    "description": [
      "Beautiful 2 bedroom 2 bathroom apart located in Rhode island, $450",
      "Fully renovated and upgraded single family house, comprising of a fully renovated guest house as well. We offer centrally located, affordable apartments with comfortable and convenient apartment living. Residents will enjoy amenities such as fully equipped kitchens with pantries, spacious walk-in closets, and personal patios or balconies. Our community itself holds entertainment such as: planned social activities, our sparkling swimming pool, and an outdoor sports court. Take a virtual tour of our “Media Gallery,” or stop by in-person today!Spacious, freshly painted two bedrom/two bath apartment with open floor plan, washer/dryer hookups, large 6x9 walk-in closet and fully-furnished kitchen with stove, built-in microwave, refrigerator with ice maker, and dishwasher. Enjoy watching the summer wildlife from your backyard,Local museums and parks are always having sponsored activities to develop new hobbies while getting to know your neighbors.All appliances included. Pets negotiable. All apartments have updated appliances, furnished mini-blinds, and individual furnaces and air-conditioners that you control.1 year (will need to sign a lease)Ready for Move-IN.Enjoy watching the summer wildlife from your backyard.",
      "If you are serious to this house kindly visit",
      "homerentfinder.com",
      ". THanksss"
    ],
    "duplicates": []
  },
  {
    "price": "$3500",
    "title": "LUXURY Tri-level- Granite/Steel, 2.5 BA's, C-Air, W&D, Locale",
    "href": "https://providence.craigslist.org/apa/d/providence-luxury-tri-level-granite/7056594243.html",
    "description": [
      "Stunning ALL NEW Tri-level Townhouse features endless Luxury finishes including expansive Granite Kitchen ornate with State of the Art Stainless Steel Appliances & Breakfast Bar, Brazilian Hardwoods, Large Windows pour in plenty of natural light, 4 Sizable Bedrooms, 2.5 Marble Baths, Cathedral Ceilings, Equipped with Finished basement and Washer and Dryer, Central Air, Efficient Gas heating System, Prominent East Side Location with Steps to popular Wickenden Street, Wayland Square, Whole Foods and Seconds to Interstate Highways.",
      "Available June 1, 2020",
      "Call Martha, Pyramid Realty Inc at",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$2000",
    "title": "Beautiful Townhouse- Period Details, Fireplace, Sunny~Prominent Locale",
    "href": "https://providence.craigslist.org/apa/d/providence-beautiful-townhouse-period/7056596083.html",
    "description": [
      "Sprawling stunning Townhouse with bonus room features Exquisite period details, Crown Moldings and builtins, Sunny kitchen, Inviting living room offers wood burning fireplace, French doors open to Dining room, Large windows throughout pour in plenty of natural light, Closets and storage space galore.",
      "Laundry on-site and washer and dryer hook up also available in unit.",
      "Pets considered.",
      "Prominently located Desirable East Side neighborhood with steps to Wayland square,  Short distance to Brown University and Interstate Highways.",
      "Call Martha, Pyramid Realty Inc at",
      "show contact info",
      "for more information or to schedule showing."
    ],
    "duplicates": []
  },
  {
    "price": "$875",
    "title": "Wonderful updated sunny second floor unit for rent to own@",
    "href": "https://providence.craigslist.org/apa/d/providence-wonderful-updated-sunny/7057027959.html",
    "description": [
      "Location is everything! This wonderful updated sunny second floor unit is a short distance to Hope Street, highways, hospitals, great restaurants, downtown, and the train station. Enjoy the farmers market in the summer of the indoor market during the colder months. Hardwood floors throughout, modern bathroom, a large kitchen with granite, lots of beautiful cabinets, stainless steel appliances, space of a table to enjoy your meals. A good size living room.",
      "Please contact text:",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$3200",
    "title": "STUNNING 2 floor penthouse-2000 sf, 2 BR, 2.5 Bath- ALL NEW",
    "href": "https://providence.craigslist.org/apa/d/providence-stunning-2-floor-penthouse/7058908520.html",
    "description": [
      "FLEXIBLE MOVE IN DATE- Immediate, Feb 1, March 1, or April 1.",
      "WOW! NEW 2 BR 2 floor luxury penthouse apartment on Sheldon St - one of the most desired streets in Providence to live on in Fox Point / East Side!",
      "-2 Floors",
      "-2000 square feet",
      "-Energy efficient, insulated building (rare in PVD)",
      "-Central A/C and heating",
      "-Private deck",
      "-Key-less entry",
      "-Private dining room",
      "-Eat-in Kitchen with counter overhang for stools",
      "-Stunning Master Bedroom w/3 closets and large master bathroom w/ soaker tub",
      "-In-unit washer and dryer",
      "The penthouse apartment incorporates the top 2 floors (2nd and 3rd) of the building, boasts hardwood floors, large modern tile in the bathrooms and original wrap around staircases.",
      "Large kitchen open to an even larger living room. The kitchen is fully-appointed with stainless steel appliances, commercial range hood, wine fridge, modern cabinets, granite, island with overhang for seating, USB outlets, recessed and pendants lighting, and a dining area.",
      "Enjoy Penthouse living with a HUGE Master Suite with 3 large closets - including a walk-in! Large Master Bathroom with Granite Double Vanity, Modern Freestanding Soaker tub to relax in and separate shower with Frameless Glass Shower Door!",
      "Second large bedroom has its own private bathroom and large double door closet.",
      "Large 1/2 bath on the lower level where you can enjoy the convenience of in-unit laundry with a brand new energy-efficient washer and high-end dryer with steam settings!",
      "Sunny South Facing Private deck off the back to sit and enjoy morning coffee or relax and have a drink after work!",
      "New energy efficient heating and A/C system.",
      "The renovations have still maintained the original charm of the area but with a modern twist. Apartment located on a quiet neighborhood, but still only steps from Wickenden St. shops and restaurants while still having easy access to I-95, I-195, walk to India Point Park and the East Bay bike path. Close to Brown, RISD and JWU."
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$3200",
    "title": "2-floor PENTHOUSE in Fox Point- in-unit laundry, 1800 sf, A/C",
    "href": "https://providence.craigslist.org/apa/d/providence-2-floor-penthouse-in-fox/7052702679.html",
    "description": [
      "WOW! Rare find!! NEW 2-floor 2 BR luxury penthouse apartment on Sheldon St - one of the most desired streets in Providence to live on in Fox Point / East Side!",
      "Available for Move-in Now, February 1st, March 1st, or April 1st.",
      "-2 Floors",
      "-1800 square feet",
      "-Energy efficient, insulated building (rare in PVD)",
      "-Central A/C and heating",
      "-Private deck",
      "-Key-less entry",
      "-Private dining room",
      "-Eat-in Kitchen with counter overhang for stools",
      "-Stunning Master Bedroom w/3 closets and large master bathroom w/ soaker tub",
      "-In-unit washer and dryer",
      "The penthouse apartment incorporates the top 2 floors (2nd and 3rd) of the building, boasts hardwood floors, large modern tile in the bathrooms and original wrap around staircases.",
      "Large kitchen open to an even larger living room. The kitchen is fully-appointed with stainless steel appliances, commercial range hood, wine fridge, modern cabinets, granite, island with overhang for seating, USB outlets, recessed and pendants lighting, and a dining area.",
      "Enjoy Penthouse living with a HUGE Master Suite with 3 large closets - including a walk-in! Large Master Bathroom with Granite Double Vanity, Modern Freestanding Soaker tub to relax in and separate shower with Frameless Glass Shower Door!",
      "Second large bedroom has its own private bathroom and large double door closet.",
      "Large 1/2 bath on the lower level where you can enjoy the convenience of in-unit laundry with a brand new energy-efficient washer and high-end dryer with steam settings!",
      "Sunny South Facing Private deck off the back to sit and enjoy morning coffee or relax and have a drink after work!",
      "New energy efficient heating and A/C system.",
      "The renovations have still maintained the original charm of the area but with a modern twist. Apartment located on a quiet neighborhood, but still only steps from Wickenden St. shops and restaurants while still having easy access to I-95, I-195, walk to India Point Park and the East Bay bike path. Close to Brown, RISD and JWU."
    ],
    "duplicates": []
  },
  {
    "price": "$1100",
    "title": "East Side....",
    "href": "https://providence.craigslist.org/apa/d/providence-east-side/7057629721.html",
    "description": [
      "Bright and sunny 1+bedroom apartment on the east side of Providence.  3rd floor.  Skylit living room. Eat In kitchen, tiled bath and a den. Off-street parking. Quiet house."
    ],
    "duplicates": []
  },
  {
    "price": "$1800",
    "title": "Meticulously Renovated w/ All the Bells & Whistles in Hip Fox Point",
    "href": "https://providence.craigslist.org/apa/d/meticulously-renovated-all-the-bells/7058846513.html",
    "description": [
      "Available now: tastefully renovated in 2018 with all new materials while maintaining period essence. Stainless steel appliances including dishwasher and granite countertops.  Oak flooring and new tile flooring throughout. Dedicated washer and dryer.  One tandem parking space.  A short distance to Downtown, College Hill, Wickenden, South Main and Thayer Streets' coffee houses, restaurants, shops, cinemas and more."
    ],
    "duplicates": []
  },
  {
    "price": "$1500",
    "title": "Free Month w Flexible Lease Available Now: Cheery Unit w/ Garage",
    "href": "https://providence.craigslist.org/apa/d/free-month-flexible-lease-available-now/7056449179.html",
    "description": [
      "Crisp two bedroom apartment with bonus office/studio space with access to sweet patio area in vibrant Fox Point, just two blocks from Wickenden Street's coffee houses, restaurants and terrific shops. Tiled, spacious eat-in-kitchen with gas cooking stove.  Coin-op washer and dryer in clean, dry basement. One secure garage space.  Utilities are tenant's responsibility.  Smoke-free building.  Sorry, no dogs."
    ],
    "duplicates": []
  },
  {
    "price": "$2000",
    "title": "Newly Furnished 3 BR on East Side",
    "href": "https://providence.craigslist.org/apa/d/providence-newly-furnished-3-br-on-east/7056289585.html",
    "description": [
      "Newly furnished 3 BR on the east side in Mount Hope",
      "* Vacant July 1st 2020",
      "* Shared washer and dryer for the unit in the basement",
      "* 1 off-street parking spot. Overnight permit parking,  $100 per year for cars registered in Providence, $200 if not.",
      "* Owner occupied house",
      "* Close to BROWN, RISD, JWU, HOSPITALS, RESTAURANTS, HOPE STREET, THAYER St, WHOLE FOODS, YMCA",
      "* Walkable, bike friendly, safe, green, mix of young professionals and families.",
      "Looking for responsible tenant, ideally working professional or graduate student. If you are interested, please send me a message and tell me a bit more about yourself and what brings you to Providence/ the East Side.",
      "Monthly Rent for $2000",
      "Security deposit ($2000) and first month’s rent required to move in",
      "No pets. No smoking in the unit or around the house."
    ],
    "duplicates": []
  },
  {
    "price": "$1350",
    "title": "89 Pleasant St # 2, Providence, RI 02906",
    "href": "https://providence.craigslist.org/apa/d/providence-89-pleasant-st-2-providence/7046154027.html",
    "description": [
      "89 Pleasant St # 2, Providence, RI 02906",
      "Apartment for rentRemolded throughout ,central air porches ,appliance and granite counter tops.",
      "Type:Apartment",
      "Cooling:Central",
      "Heating:Forced air",
      "Pets:Yes",
      "Parking:Off street",
      "Laundry:In unit",
      "Deposit & fees:$1,350",
      "Price/sqft:$1",
      "Interior details",
      "Bedrooms and bathrooms",
      "Bedrooms\t2",
      "Bathrooms\t1",
      "Flooring",
      "Flooring\tHardwood",
      "Heating",
      "Heating features\t",
      "Forced air",
      "Cooling",
      "Cooling features\t",
      "Central",
      "Other interior features",
      "Total interior livable area\t960 sqft",
      "Property details",
      "Parking",
      "Parking features\t",
      "Off street",
      "Construction details",
      "Type and style",
      "Home type\tApartment"
    ],
    "duplicates": []
  },
  {
    "price": "$1100",
    "title": "FIRST TIME RENTERS WELCOME, CLOSE TO BROWN, J&W, BUTLER, RI HOSPITAL",
    "href": "https://providence.craigslist.org/apa/d/first-time-renters-welcome-close-to/7058708618.html",
    "description": [
      "PLEASE READ ENTIRE AD BEFORE CALLING,",
      "LGBT COMMUNITY WELCOME, FIRST TIME RENTERS WELCOME.",
      "EXCELLENT LANDLORDS. QUIET, CLEAN, SAFE BUILDINGS.",
      "YOU'VE SEEN THE REST, NOW SEE THE BEST!!!",
      "VERY QUIET AND PRIVATE, FANTASTIC OPPORTUNITY, MUST SEE YOU WON'T BE DISAPPOINTED. ENTIRE FLOOR ALL TO YOURSELF",
      "102-104 Ives street",
      "4th floor",
      "2 bed",
      "Fox point/East side Providence",
      "$1100 for a couple",
      "Extra for 3rd person",
      "no utilities,",
      "two parking spots on the premise",
      "desirable location,",
      "great for med students, faculty, interns, nurses, professionals, couples, grad students. Professors",
      "right between fox point and the east side,",
      "must see take a ride by.",
      "close to Brown, RISD, Johnson and wales, Butler, RI hospital",
      "on trolley line, and walking distance close to parks, shopping and restaurants",
      "great view, very private and quiet, unique",
      "Available Now, be in by the holidays",
      "next to Noodles 102 and PVD Donuts",
      "2 large carpeted bedrooms",
      "huge multi-functional kitchen, open floor plan, skylights",
      "full bathroom large storage space",
      "clean quiet building",
      "one mature fixed cat optional, absolutely no dogs",
      "on trolley line",
      "coin op laundry",
      "great for grad students/faculty/professionals",
      "must have good references",
      "FIRST TIME RENTERS CONSIDERED!!!!",
      "12 MONTH LEASE, 1ST MONTH AND SECURITY DEPOSIT REQUIRED",
      "TAKE A RIDE BY AND CHECK IT OUT!!!",
      "SERIOUS INQUIRES BY APPOINTMENT ONLY, CAN BE SHOWN WITH ONLY A FEW HOURS NOTICE!!!!",
      "PLEASE CALL MICHAEL",
      "show contact info",
      "7 DAYS A WEEK PLUS HOLIDAYS UP TO MIDNIGHT NO EMAILS",
      "ALL CALLS RETURNED"
    ],
    "duplicates": [
      "6224087590",
      "6225548424"
    ]
  },
  {
    "price": "$1100",
    "title": "CLOSE TO BROWN, BUTLER, RI HOSP. J&W UNIV, FANTASTIC OPPORTUNITY",
    "href": "https://providence.craigslist.org/apa/d/providence-close-to-brown-butler-ri/7058321975.html",
    "description": [
      "PLEASE READ ENTIRE AD BEFORE CALLING,",
      "LGBT COMMUNITY WELCOME, FIRST TIME RENTERS WELCOME.",
      "EXCELLENT LANDLORDS. QUIET, CLEAN, SAFE BUILDINGS.",
      "YOU'VE SEEN THE REST, NOW SEE THE BEST!!!",
      "VERY QUIET AND PRIVATE, FANTASTIC OPPORTUNITY, MUST SEE YOU WON'T BE DISAPPOINTED. ENTIRE FLOOR ALL TO YOURSELF",
      "102-104 Ives st",
      "4th floor",
      "2 bed",
      "Fox point/East side Providence",
      "$1100 for couple",
      "3rd person extra",
      "no utilities,",
      "two parking spots on the premise",
      "desirable location,",
      "great for med students, faculty, interns, nurses, professionals, couples,grad students. Professors",
      "right between fox point and the east side,",
      "must see take a ride by.",
      "close to Brown, RISD, Johnson and wales, Butler, RI hospital",
      "on trolley line, and walking distance close to parks, shopping and restaurants",
      "great view, very private and quiet, unique",
      "Available now",
      "next to Noodles 102 and PVDonuts",
      "2 large carpeted bedrooms",
      "huge multi-functional kitchen, open floor plan, skylights",
      "full bathroom large storage space",
      "clean quiet building",
      "one mature fixed cat optional, absolutely no dogs",
      "on trolley line",
      "coin op laundry",
      "great for grad students/faculty/professionals",
      "must have good references",
      "FIRST TIME RENTERS CONSIDERED!!!!",
      "12 MONTH LEASE, 1ST MONTH AND SECURITY DEPOSIT REQUIRED",
      "TAKE A RIDE BY AND CHECK IT OUT!!!",
      "SERIOUS INQUIRES BY APPOINTMENT ONLY, CAN BE SHOWN WITH ONLY A FEW HOURS NOTICE!!!!",
      "PLEASE CALL MICHAEL",
      "show contact info",
      "7 DAYS A WEEK PLUS HOLIDAYS UP TO MIDNIGHT NO EMAILS",
      "ALL CALLS RETURNED"
    ],
    "duplicates": []
  },
  {
    "price": "$1100",
    "title": "CLOSE TO BROWN, BUTLER, RI HOSP. J&W UNIV, FANTASTIC OPPORTUNITY",
    "href": "https://providence.craigslist.org/apa/d/providence-close-to-brown-butler-ri/7056598705.html",
    "description": [
      "PLEASE READ ENTIRE AD BEFORE CALLING, BE IN BY THE HOLIDAYS. UP AND COMING AREA.",
      "LGBT COMMUNITY WELCOME, FIRST TIME RENTERS WELCOME.",
      "EXCELLENT LANDLORDS. QUIET, CLEAN, SAFE BUILDINGS.",
      "YOU'VE SEEN THE REST, NOW SEE THE BEST!!!",
      "VERY QUIET AND PRIVATE, FANTASTIC OPPORTUNITY, MUST SEE YOU WON'T BE DISAPPOINTED. ENTIRE FLOOR ALL TO YOURSELF",
      "102-104 Ives st",
      "4th floor",
      "Fox point/East side Providence",
      "$1100 for couple",
      "Extra for 3rd person",
      "no utilities,",
      "two parking spots on the premise",
      "desirable location,",
      "great for med students, faculty, interns, nurses, professionals, couples,grad students. Professors",
      "right between fox point and the east side,",
      "must see take a ride by.",
      "close to Brown, RISD, Johnson and wales, Butler, RI hospital",
      "on trolley line, and walking distance close to parks, shopping and restaurants",
      "great view, very private and quiet, unique",
      "Available Now.  be in by the holidays",
      "next to Noodles 102 and PVDonuts",
      "2 large carpeted bedrooms",
      "huge multi-functional kitchen, open floor plan, skylights",
      "full bathroom large storage space",
      "clean quiet building",
      "one mature fixed cat optional, absolutely no dogs",
      "on trolley line",
      "coin op laundry",
      "great for grad students/faculty/professionals",
      "must have good references",
      "FIRST TIME RENTERS CONSIDERED!!!!",
      "12 MONTH LEASE, 1ST MONTH AND SECURITY DEPOSIT REQUIRED",
      "TAKE A RIDE BY AND CHECK IT OUT!!!",
      "SERIOUS INQUIRES BY APPOINTMENT ONLY, CAN BE SHOWN WITH ONLY A FEW HOURS NOTICE!!!!",
      "PLEASE CALL MICHAEL",
      "show contact info",
      "7 DAYS A WEEK PLUS HOLIDAYS UP TO MIDNIGHT NO EMAILS",
      "ALL CALLS RETURNED"
    ],
    "duplicates": []
  },
  {
    "price": "$1000",
    "title": "Quiet, Great Location, Walking Distance to Restaurants and Shops",
    "href": "https://providence.craigslist.org/apa/d/providence-quiet-great-location-walking/7055331270.html",
    "description": [
      "7 Governor Street, Providence, RI. $1000 a month, sunny, and quiet. Great location  Two bedrooms, 2nd floor. Eat-in Kitchen, spacious Living room.  No pets, no utilities, one year rental agreement, one parking spot, on bus route trolly 92, walking distance to Great Restaurants, Bars, shops, and India point park, walk to RISD, and Brown. Serious inquiry only Call",
      "show contact info",
      "ask for Tony NO TEXTING!"
    ],
    "duplicates": [
      "4292373017"
    ]
  },
  {
    "price": "$1000",
    "title": "Quiet, Great Location, Walking Distance to Restaurants and Shops",
    "href": "https://providence.craigslist.org/apa/d/providence-quiet-great-location-walking/7054902342.html",
    "description": [
      "7 Governor Street, Providence, RI. $1000 a month, sunny, and quiet. Great location  Two bedrooms, 2nd floor. Eat-in Kitchen, spacious Living room.  No pets, no utilities, one year rental agreement, one parking spot, on bus route trolly 92, walking distance to Great Restaurants, Bars, shops, and India point park, walk to RISD, and Brown. Serious inquiry only Call",
      "show contact info",
      "ask for Tony NO TEXTING!"
    ],
    "duplicates": []
  },
  {
    "price": "$1450",
    "title": "Hardwoods. INC HEAT. Wayland Square. SAMSON REALTY 3542",
    "href": "https://providence.craigslist.org/apa/d/providence-hardwoods-inc-heat-wayland/7058438899.html",
    "description": [
      "About This Property:",
      "Affordable two bedroom apartment in Wayland Square!  Includes heat and hot water.  Hardwoods throughout.  Nice clean space.  Sunny.   Coin Laundry in the building. Parking for 1 car available for $50/mo.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 3542    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 3542279206509233.8490805472343628425373644518855066752896490436634773777168466392062330025684874086759072465350855780721254974943805577358801302550505560906802473312637764691575204752"
    ],
    "duplicates": [
      null,
      null,
      "7037665026",
      "7037651221",
      "6991909840",
      "6633439519",
      "6974753599",
      "6906592161",
      "6952936315",
      "6952931402",
      null,
      null,
      "6727190453",
      null,
      null,
      "7031360615",
      "7011327451",
      "6991023683",
      "6825427871",
      "7009399247",
      "6987664129",
      "7009375272",
      "6703584987",
      "6987660455",
      "6987660455",
      "6987682918",
      "7010033800",
      "7005420946",
      null,
      "7006035774",
      "6984609937",
      "6984652026",
      "6955803657",
      "6981951622",
      "6461604614",
      "7022362893",
      "7022345482",
      "7022992784",
      "7001435833"
    ]
  },
  {
    "price": "$1200",
    "title": "Hardwoods. Sunny. Spacious kitchen. Location! SAMSON REALTY 2212",
    "href": "https://providence.craigslist.org/apa/d/providence-hardwoods-sunny-spacious/7057099275.html",
    "description": [
      "About This Property:",
      "Sunny 2-3 bedroom apartment with hardwoods throughout. Can be used as a 3 bed or as a 2 bed with an extra room for office.  Spacious kitchen with ample cabinet space. Great central location on Ives St. Easy access to Brown, RISD, & JWU. No Pets. Parking for 1 car. Gas Heat.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "PLEASE INCLUDE YOUR PHONE NUMBER IN YOUR MESSAGE.",
      "Thank You.",
      "LISTING CODE: 2212    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 221268004121755.4313622393530173759640048799921988863982668814859951934042557627722938978274186435053127140776520289616400574890163461106861904564531636080538320859691166634123670912"
    ],
    "duplicates": []
  },
  {
    "price": "$850",
    "title": "Sunlit Studio w/ Hardwoods Near Wayland Square. SAMSON REALTY 9275",
    "href": "https://providence.craigslist.org/apa/d/providence-sunlit-studio-hardwoods-near/7056452116.html",
    "description": [
      "About This Property:",
      "Sunlit studio in great East Side location. Gas stove in the kitchen. Walking distance to Wayland Square. Hardwood floors. Large closet. Off-street parking for one car. Additional storage and coin-laundry in the basement.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 9275    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 92755013276096704.726976599150466486511717358854441064790526658918166927209331553264825669995551797288075511954481619137811830559089820314664893844177565098523499364611237521252803125"
    ],
    "duplicates": []
  },
  {
    "price": "$1600",
    "title": "June 1st. 2 bed-Hope at Wickenden, Walk to Everything SAMSON  8107",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-2-bed-hope-at/7055124230.html",
    "description": [
      "About This Property:",
      "2 bed on Hope St. Back house with spacious living room and bedrooms have big closets. Hardwoods throughout and tiled eat-in kitchen and bathroom. Right down the block from Wickenden St. Charming place that is walking distance to everything plus the colleges.  Available for 6/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 8107    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 81073347806801924.7895420236399903910435510369146151853831341602106979006358947489407808110110024156542779881524907227750657221159762355592423049383265350571343433557323622025206382322"
    ],
    "duplicates": []
  },
  {
    "price": "$3600",
    "title": "6br - Single Family Now-5/31 College Hill. SAMSON REALTY 9179",
    "href": "https://providence.craigslist.org/apa/d/providence-6br-single-family-now-5-31/7055124074.html",
    "description": [
      "About This Property:",
      "Exquisite single family home on the East Side. Spread over three floors and totaling 3500 square feet this home offers 6 spacious bedrooms, 3.5 bathrooms, central air, ample storage space throughout, and in-unit laundry. Perfect location within walking distance to Brown University, RISD, Thayer Street, Wickenden Street, & Downtown Providence. Off-street parking for two cars. \nThe price is discounted for a term that ends no later than 5/31/20.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 9179    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 91794859213464029.5837192459716375625682706321845572920043273543842174663439813082208987219382082211675887353976924743092863128958482610725593860612650373872350797916597152153033684306"
    ],
    "duplicates": []
  },
  {
    "price": "$2400",
    "title": "Sept 1st 2020, 3 Bed 1.5 Baths. College Hill Modern SAMSON REALTY 9122",
    "href": "https://providence.craigslist.org/apa/d/providence-sept-1st-bed-15-baths/7054076999.html",
    "description": [
      "About This Property:",
      "Stunning 3 bedroom, 1.5 bathroom apartment. Close proximity to Brown and RISD, Wickenden Street, & Thayer Street. Features will include central air, hardwood floors, granite counters, stainless steel appliances, and your own personal laundry machines. Near the colleges, Brown University, RISD.  Available 9/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 9122    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 91224769249820973.0638798695150672733515073369311757843482443451523598411305917815489204221249998509357177817084567516501750264975433177324168887109206686081919871301518080244307263792"
    ],
    "duplicates": []
  },
  {
    "price": "$3500",
    "title": "New Luxury Townhouse, ES SAMSON REALTY 1037",
    "href": "https://providence.craigslist.org/apa/d/providence-new-luxury-townhouse-es/7054070575.html",
    "description": [
      "About This Property:",
      "Brand New construction never lived in. Luxurious Townhouse.  4 beds 2.5 baths Finished lower level. Laundry in unit. Granite. Marble floors in bath. Hardwood floors throughout. All new Stainless appliances including built in microwave and dishwasher.  Available for 6/1/2019",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 1037    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 10377006742180.5184717051185414469478997586960924333011253478901147667260527943780465463550390716615603831644274121091857008139989420510662573326287078763000522507813523283002859262"
    ],
    "duplicates": []
  },
  {
    "price": "$2700",
    "title": "Pristine, Stainless, Near Brown.  SAMSON REALTY 3370",
    "href": "https://providence.craigslist.org/apa/d/providence-pristine-stainless-near/7054066889.html",
    "description": [
      "About This Property:",
      "Modern townhouse. Renovated. Beautiful Cherry hardwood floors. Washer/Dryer in apartment! Granite counters and plenty of cabinet space. The master bedroom has a private bath with an additional full bath. Gas heat. A/C. Gas stove.  Available for 6/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 3370    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 3370240474799314.9134398735016998706814876993317354428835588700725471401655145742794486217362314914339740799299242490909698831489617651234217495220268889270551001466774264849274662"
    ],
    "duplicates": []
  },
  {
    "price": "$3180",
    "title": "Near Brown. Angell at Thayer. SAMSON REALTY 8143",
    "href": "https://providence.craigslist.org/apa/d/providence-near-brown-angell-at-thayer/7053538555.html",
    "description": [
      "About This Property:",
      "Just minutes walk to almost all campus locations! Right on the corner of Angell and Brook, one block from Thayer Street. 4 big bedrooms and 1 bathroom. Modern kitchen with gas stove, dishwasher, and plenty of cabinet space. Laundry machines right outside your door. Near the colleges, Brown University, RISD.  Available for 6/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 8143    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 81433392604022956.6449229260399127410395576205069101411652823486438901500826136740693180955061564980634341353173954814509627953115294894437596900448176335566006766110825149596859985178"
    ],
    "duplicates": []
  },
  {
    "price": "$750",
    "title": "Thayer St. at Brown University Studio Room SAMSON REALTY 9215",
    "href": "https://providence.craigslist.org/apa/d/providence-thayer-st-at-brown/7053536777.html",
    "description": [
      "About This Property:",
      "Newly renovated studio rooms right on Thayer Street. All utilities included. Shared kitchen. Shared bathrooms. Coin-operated laundry. Central air. Walking distance to Brown University and RISD. Near public transit, restaurants, and shops. This building offers 16 units. Sizes range from 118-354 and range in price from $675-$1025. Available for 6/1/2020 and Now-5/31/20 View at SamsonRealty.com/230",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 9215    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 92154916611436461.551440480436799568432193512577445312718293744794847709054366970443668262956983169296841996101216804267203826843452186774661801621652524530885887133269214225215947225"
    ],
    "duplicates": []
  },
  {
    "price": "$825",
    "title": "Renovated Studio Room on Thayer St. SAMSON REALTY 9211",
    "href": "https://providence.craigslist.org/apa/d/providence-renovated-studio-room-on/7053536244.html",
    "description": [
      "About This Property:",
      "Newly renovated studio rooms right on Thayer Street. All utilities included. Shared kitchen. Shared bathrooms. Coin-operated laundry. Central air. Walking distance to Brown University and RISD. Near public transit, restaurants, and shops. This building offers 16 units. Sizes range from 118-354 and range in price from $675-$1025. Available for 6/1/2020 and Now through 5/31. View at SamsonRealty.com/230",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 9211    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 92114910211682710.8187819274551991269526607169692935734872415313695351545349469685914379848622281327581890446465546404911495630487424249258338590741588462070305713168955383826170832274"
    ],
    "duplicates": []
  },
  {
    "price": "$1850",
    "title": "Off Elmgrove, Great kitchen, Laundry, deck, Fireplace SAMSON 8769",
    "href": "https://providence.craigslist.org/apa/d/providence-off-elmgrove-great-kitchen/7052700504.html",
    "description": [
      "About This Property:",
      "Off Elmgrove Ave (1 block) Roomy 2 bed on the 2nd floor in the center of the East Side of Providence. Brick  Fireplace. Hardwoods. Modern Chef’s kitchen which has stainless appliances and includes a dishwasher & built in microwave. Free laundry machines, 2 car off-street parking. 2nd floor Deck/Balcony. Available for 6/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 8769    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 876912710169238406.8443928710741399745391706489537566331652879091071099240145380506607701958286789589760840652423453927892793545591628709507833464125587552541368116207218920598559152658"
    ],
    "duplicates": []
  },
  {
    "price": "$1050",
    "title": "Large bathroom, hardwood floors on East Side SAMSON REALTY 6619",
    "href": "https://providence.craigslist.org/apa/d/providence-large-bathroom-hardwood/7052696835.html",
    "description": [
      "About This Property:",
      "Beautiful studio with very spacious bathroom. Heat and hot water included and tenant has thermostat in unit.  Laundry in building. Near the colleges, Brown University, RISD. Available for 6/1/2020\n",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 6619    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 66191822036243584.1114128184029890523645512824123934473192490945315414267255310051553591964538708642223705859787469896693479410157751766489596869720578234183075535784196670526460469586"
    ],
    "duplicates": []
  },
  {
    "price": "$2700",
    "title": "June 1st, 3 bed, 2 bath Modern Air Laundry. SAMSON REALTY 3367",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-3-bed-2-bath-modern/7052229496.html",
    "description": [
      "About This Property:",
      "3 bed, 2 full bath, modern first floor apartment close to Brown & Wayland Square! Laundry in unit, Cherry hardwood floors, with central air. Replacement windows. Beautiful modern kitchen with stainless steel appliances and granite countertops. Near the colleges, Brown University, RISD. Available for 6/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 3367    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 3367239833153287.3625662392882653220294284526737469003919730782059875596085632434850454010171787785549072619910377324967483736353940028089644964889953065780716450790833193778459686602"
    ],
    "duplicates": []
  },
  {
    "price": "$1050",
    "title": "Newer studio in Wayland Square SAMSON REALTY 6751",
    "href": "https://providence.craigslist.org/apa/d/providence-newer-studio-in-wayland/7052049149.html",
    "description": [
      "About This Property:",
      "Studio in Wayland Square with nice view of the East Side. Everything is renovated and brand new, including windows and skylight. Kitchen includes garbage disposal and built in microwave. Heat and hot water included. Near the colleges, Brown University, RISD.\nAvailable for 6/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 6751    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 67511933232966401.4576501910020228829630708640458821851906791146523119299639746153564460388995973033222175440295067348916073157505125831707837060305997579122318038819108776831104650554"
    ],
    "duplicates": []
  },
  {
    "price": "$985",
    "title": "Renovated studio right in Wayland Square SAMSON REALTY 4626",
    "href": "https://providence.craigslist.org/apa/d/providence-renovated-studio-right-in/7051410153.html",
    "description": [
      "About This Property:",
      "Completely renovated / newer construction. Heat and hot water included with a thermostat in the unit. Microwave and garbage disposal. Near the colleges, Brown University, RISD. Available for 6/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 4626    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 4626622009121757.7845691211732190662857780071484320223963574997251078126493962087876419828595155512994121244538412799790448934169858918907859000031885577665704796074055776855243056304"
    ],
    "duplicates": []
  },
  {
    "price": "$1575",
    "title": "Sunny & Spacious 3 Bed 1 Bath. 1st Fl. Renovated. SAMSON REALTY 2820",
    "href": "https://providence.craigslist.org/apa/d/providence-sunny-spacious-3-bed-1-bath/7051406119.html",
    "description": [
      "About This Property:",
      "Sunny and spacious 3 bed 1 bath apartment. On the first floor, recently renovated with new carpets, new windows, new hardwood floors in the living room. Coin laundry in the basement. Charming yard out back. Off-street parking for 2. Near the colleges, Brown University, RISD, Available for 6/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 2820    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 2820140905255999.8181406674638343603224216726731744141709362332672824798993506279365292054892545780856759908157622595815958547451688668836638827871902996066132634646416456424767472"
    ],
    "duplicates": []
  },
  {
    "price": "$1600",
    "title": "Off Blvd Renovated All Utilities Included Deck SAMSON REALTY 1757",
    "href": "https://providence.craigslist.org/apa/d/providence-off-blvd-renovated-all/7048906118.html",
    "description": [
      "About This Property:",
      "Bright and cheerful second floor two bedroom apartment in great East Side location. Off Blackstone Boulevard, near Wayland Square This apartment has been renovated and features new flooring and new countertops. Off street parking for two. Coin laundry in the basement. All utilities included. Near the colleges, Brown University, RISD.  Available 12/1/19.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 1757    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 175734079652115.2864157412880668850955558324411684164607249680655743947897326848419553033619464462949758342266390508861140929244518823609527628621195041707597189410752502605911461022"
    ],
    "duplicates": []
  },
  {
    "price": "$3600",
    "title": "June 1st 4 bed 4 baths College Hill New Townhouse SAMSON REALTY 8935",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-4-bed-4-baths/7048906029.html",
    "description": [
      "About This Property:",
      "Construction completed in 2018! Luxurious Townhouse. 4 bed, 3 baths.  Laundry in unit.  Hardwood flooring. Modern kitchen with stainless steel appliances including a dishwasher. Great cabinets. Beautiful marble tile bathrooms. Central air conditioning. \nAvailable for 6/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 8985    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 89854557578027634.239653226884344051671637957074146644768727300322423502792880655041891407098991355955487355467824805435327491375703635849680074493981545936701598074631128790347111775"
    ],
    "duplicates": []
  },
  {
    "price": "$2400",
    "title": "June 1st, 4 bed Near Brown, Laundry in Unit SAMSON REALTY 8447",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-4-bed-near-brown/7048902820.html",
    "description": [
      "About This Property:",
      "Four bedroom. Hardwoods just redone and freshly painted. Excellent Location, walking distance Hope St & Wickenden St shops. Brand new standing shower. New appliances, Large walk in closet. Near the colleges, Brown University, RISD.  \nAvailable for 6/1/2020 or 7/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 8447    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 84473786930640759.2928938056962670830384922978866702941387175722142870352045526273893263879656362459697794859661384944575301370307326331580849587875396160631348847829706116980671339642"
    ],
    "duplicates": []
  },
  {
    "price": "$2400",
    "title": "Single Family. Hardwoods. Fireplace! Porch.  SAMSON REALTY 6295",
    "href": "https://providence.craigslist.org/apa/d/providence-single-family-hardwoods/7048274139.html",
    "description": [
      "About This Property:",
      "4 bedroom 1.5 bath single family home in Providence’s East Side! Hardwoods and carpets in two of the bedrooms. Fireplace in the living room. Large foyer with a beautiful staircase heading upstairs. Eat-In kitchen with plenty of counter and cabinet space. Half bath on the first floor. Full bath upstairs. Parking for two cars.  Laundry hookups in the basement. Will allow a small dog! Gas heat and stove.  Ample storage room.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 6295    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 62951567353910151.364171943861748223645164595835509283048291564833440498427803699880252801173500714007076167717997584566770041306259327301691865241709924934646882866170035930474935825"
    ],
    "duplicates": []
  },
  {
    "price": "$2550",
    "title": "June 1st, 4 Bed 2 Bath College Hill. Brand New. SAMSON REALTY 1754",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-4-bed-2-bath/7048273948.html",
    "description": [
      "About This Property:",
      "3 bedroom 2 bathroom in great College Hill location. Close distance to Brown & RISD. Totally renovated and features hardwood floors, stainless steel appliances, and granite counters. Central air and heat. Laundry right in the unit.Near the colleges, Brown University, RISD.   The property is currently being renovated. The property photos displayed are from similar properties owned by this owner that have been recently renovated. Available for 6/1/2020.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 1754    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 175433905381505.3941088225560593005049590182378157521027639342083146518184471392990951531899301780375780463887433892664602790397505070813287856106274655936011701650761432887296937456"
    ],
    "duplicates": []
  },
  {
    "price": "$1125",
    "title": "1 Bed w/ Hardwoods. HEAT INCL. Eat-in Kitchen SAMSON REALTY 636",
    "href": "https://providence.craigslist.org/apa/d/providence-1-bed-hardwoods-heat-incl/7048273831.html",
    "description": [
      "About This Property:",
      "Large one bedroom apartment. Hardwoods throughout. Sunny living room and pristine eat-in kitchen.Closets in bedroom and living room. Third floor apartment. 1 parking spot. HEAT INCLUDED. Located off Elmgrove Ave and close to the Blackstone Boulevard and all East Side amenities.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 636    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 6361616408834.0722133113587558262089688158779895928461729268928952708945012664581302145787059710331361015948048688956958859649130928904030303788338638054792300607630643906121002624"
    ],
    "duplicates": []
  },
  {
    "price": "$4650",
    "title": "6/1/20  Brand new construction. SAMSON REALTY 8992",
    "href": "https://providence.craigslist.org/apa/d/providence-brand-new-construction/7048273664.html",
    "description": [
      "About This Property:",
      "Stunning 6 bedroom, 3 bathroom townhouse. Brand new construction close to Brown University. Top of the line features to include hardwood floors, central air, granite counters, high-end appliances including a dishwasher and laundry machines. \nAvailable 6/1/20",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 8992    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 89924568238430823.9813546168751460571102874294712216636766509551275597400712834679480645142302198411252551639163870660693107972696149225856899567710224572278683927650447610580704100352"
    ],
    "duplicates": []
  },
  {
    "price": "$3400",
    "title": "June 1st, 4 Bed 3 Bath College Hill Renovated. SAMSON REALTY 1752",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-4-bed-3-bath/7048273545.html",
    "description": [
      "About This Property:",
      "Barnes Street near Prospect Street. Totally brand new 4 bed, 3 bathroom apartment. Hardwood floors. Laundry in unit. Central air and heat. Excellent location. Near the colleges, Brown University, RISD.   The property is currently being renovated. The property photos displayed are from similar properties owned by this owner that have been recently renovated. Available for 6/1/2020.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 1752    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 175233789531782.8419544050376681552870851425758379032484348019421906458387097630254474061011149194783616990727220824276107912122139299929964020705851512868267705849991614577267090432"
    ],
    "duplicates": []
  },
  {
    "price": "$3400",
    "title": "June 1st, 4 Bed 3 Bath College Hill Renovated. SAMSON REALTY 1752",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-4-bed-3-bath/7047330938.html",
    "description": [
      "About This Property:",
      "Barnes Street near Prospect Street. Totally brand new 4 bed, 3 bathroom apartment. Hardwood floors. Laundry in unit. Central air and heat. Excellent location. Near the colleges, Brown University, RISD.   The property is currently being renovated. The property photos displayed are from similar properties owned by this owner that have been recently renovated. Available for 6/1/2020.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 1752    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 175233789531782.8419544050376681552870851425758379032484348019421906458387097630254474061011149194783616990727220824276107912122139299929964020705851512868267705849991614577267090432"
    ],
    "duplicates": []
  },
  {
    "price": "$3400",
    "title": "June 1st, 4 Bed 3 Bath College Hill  NEW. SAMSON REALTY 1753",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-4-bed-3-bath/7046749767.html",
    "description": [
      "About This Property:",
      "Brand new! Second floor 4 bedroom 3 bathroom apartment in College Hill. Granite counters, stainless steel appliances, central air, hardwood floors, and laundry in the unit. The location doesn’t get better! Near the colleges, Brown University, RISD.   The property is currently being renovated. The property photos displayed are from similar properties owned by this owner that have been recently renovated. Available now until 8/31/2020.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 1753    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 175333847423600.8465011563515815778129167465954908418478567407122276343613565575493099612992749790876769243434116996134615884226809044041049905875823951528837156796732590311400091958"
    ],
    "duplicates": []
  },
  {
    "price": "$2300",
    "title": "Single Family off Hope St next to Brown Observatory SAMSON REALTY 8067",
    "href": "https://providence.craigslist.org/apa/d/providence-single-family-off-hope-st/7046747481.html",
    "description": [
      "About This Property:",
      "This house is 4 bedroom located right off Hope St, across the street from the Brown University Ladd Observatory. Windows on every corner of the house, built-in bureaus in each of the four bedrooms. Eat-in Kitchen, dining room and living room on first floor, all bedrooms and bathroom on second. Decorative fireplace in living space, front porch of house great for entertaining. \nParking for two cars.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 8067    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 80673298496588069.4233198075592956183317752542418913385733645517478180298140829062765094553162297838923309299480310015218871458711781189519952725227599282468258204349237335748377351202"
    ],
    "duplicates": []
  },
  {
    "price": "$2700",
    "title": "June 1st 3 Bed/2 Bath, Modern, Laundry Near Brown SAMSON REALTY 3369",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-3-bed-2-bath-modern/7045120892.html",
    "description": [
      "About This Property:",
      "Luxury Townhouse. This unit has been totally renovated. Splendid wood floors. Washer/Dryer in apartment! Granite counters and plenty of cabinet space. The master bedroom has a private bath with an additional full bath. Gas heat. A/C. Gas stove. Parking not included but may be available for rent nearby. Available for 6/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 3369    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 3369240260790309.9883866149620167405680089264878151423438966001726535221529980128442398344506533807945055108766059665386468337204752755636948353716135595447985676050920323056157328086"
    ],
    "duplicates": []
  },
  {
    "price": "$6405",
    "title": "June 1st. 7 Bed. Near Brown Athletic Center. SAMSON REALTY 4143",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-7-bed-near-brown/7044727517.html",
    "description": [
      "About This Property:",
      "This unique duplex townhouse is just 2 short blocks from the Brown University Nelson Athletic Center. It is currently going through a complete renovation. It will feature 7 bedrooms, 5 Full baths, Modern Kitchen, Laundry, & Hardwoods throughout. Large living room. Beautiful bay windows bring in lots of light. Off street parking for 1 car.  Close to numerous restaurants and shops on Thayer St. Near the Colleges Brown University & RISD.  The pictures are of other renovations by the owner that demonstrates the quality of work that will be done. See the plans. Available for 6/1/2020. For More Information View:",
      "SamsonRealty.com/144",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 4143    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 4143446811835218.5899521642661939565495452895721537480583916896666179454395418605233034177792943251946890493799164612803548852344976942046100352421611570202345655856576778241025033178"
    ],
    "duplicates": []
  },
  {
    "price": "$3600",
    "title": "New Construction Townhouse  SAMSON REALTY 8990",
    "href": "https://providence.craigslist.org/apa/d/providence-new-construction-townhouse/7043866825.html",
    "description": [
      "About This Property:",
      "Recently built two-story 4 bedroom 2 bathroom townhouse. Hardwood floors, granite counters, stainless steel appliances, central air, and laundry. Located on Wickenden Street, great restaurants and shops are all within walking distance. Near the colleges, Brown University, RISD.  Pictures shown are from similar properties owned by this owner. Available 8/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 8990    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 89904565190906954.6162242435068273277597638988436373283590995127526076170896102237028772225171202296311929155116380712820497790492303684955354182522756238179061285527778376310643746"
    ],
    "duplicates": []
  },
  {
    "price": "$1650",
    "title": "June 1st, 2 Bed. College Hill. Great condition SAMSON REALTY 3783",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-2-bed-college-hill/7043516149.html",
    "description": [
      "About This Property:",
      "Charming two bedroom first floor apartment.  Hardwoods throughout. Beautiful eat-in kitchen with a dishwasher. Gas Heat. Coin laundry in the building. Small yard. Near Wickenden Street and Fox Point. Also near the colleges, Brown University, RISD. Off-street parking for two. Available for 6/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "PLEASE INCLUDE YOUR PHONE NUMBER IN YOUR MESSAGE.",
      "Thank You.",
      "LISTING CODE: 3783    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 3783340164424900.9625541890759941841082715112670435672898515429625141522127377102431817555799332667963485876853513102345254571273092173987883521334244713254382504025174474630419417098"
    ],
    "duplicates": []
  },
  {
    "price": "$4650",
    "title": "JUNE 2020, 6 Bed  New Construction SAMSON REALTY 4419",
    "href": "https://providence.craigslist.org/apa/d/providence-june-bed-new-construction/7043508514.html",
    "description": [
      "About This Property:",
      "Brand new! 6 bedroom 3 bathroom townhouse in great East Side location. High-end features will include granite counters, stainless steel appliances, central air, hardwood floors, and laundry in the unit. The location doesn’t get better! Walking distance to all the nearby coffee shops and restaurants has to offer. Near the colleges, Brown University and RISD. Available 6/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 4419    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 4419542190461587.9585058296837099822374802229499951039484871952017737615375563196027009070486229072900412473685609591843115758164381652570033253470814590459325423661731944054263009186"
    ],
    "duplicates": []
  },
  {
    "price": "$885",
    "title": "June 1st & Now. Studio Rooms Thayer St Near Brown SAMSON Realty 9204",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-now-studio-rooms/7042465892.html",
    "description": [
      "About This Property:",
      "Newly renovated studio rooms right on Thayer Street. All utilities included. Shared kitchen. Shared bathrooms. Coin-operated laundry. Central air. Excellent location at the corner of Thayer & Angell. Near Brown University & RISD. Public transportation, restaurants, and shops right outside your door. This building offers 16 units. Sizes range from 118-354 square feet and range in price from $675-$1075 These photos are a sampling of all the units in the building. View at SamsonRealty.com/230 Available for 6/1/2020 and Now-5/31.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 9204    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 92044899025481186.6095071017629216712122002750173446695706292206456029928651235703151109432097490795580735945675012536341303478884298589410754895344525451790725434879659789659317417856"
    ],
    "duplicates": []
  },
  {
    "price": "$3200",
    "title": "Near Brown & RISD. Renovated Apt On 2 Floors. SAMSON REALTY 3784",
    "href": "https://providence.craigslist.org/apa/d/providence-near-brown-risd-renovated/7042460977.html",
    "description": [
      "About This Property:",
      "Recently renovated apartment minutes from Brown University, RISD, and Wickenden St. 4 Bedroom with an extra room for possible office/den. Beautiful new hardwood flooring, New kitchen cabinets, countertops and appliances. All new shower units, tub, sink and toilets. Gorgeous sunlit rooms,  Coin Op Laundry in Basement.  Available for 6/1/2020",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 3784    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 3784680868507775.0388177610918599238266328437830583039408389211899865528769967071834740624720044577406136211853278701194340105419624320768353614511227458867541980385574327954104440832"
    ],
    "duplicates": []
  },
  {
    "price": "$3500",
    "title": "Stunning Townhouse Near Brown University SAMSON REALTY 2224",
    "href": "https://providence.craigslist.org/apa/d/providence-stunning-townhouse-near/7042459628.html",
    "description": [
      "About This Property:",
      "Beautiful new townhouse in Fox Point with 4 beds and 2.5 baths on 3 floors. Centrally located near Brown & RISD, walking distance to PVD Donuts, Ives and Wickenden St. Shops. Open floor plan on first floor. New stainless steel appliances and granite counters in the kitchen. Marbel bathrooms. Gorgeous new hardwood floors throughout. Finished basement with washer and dryer. Gas heat and central air conditioning. big>",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 2224    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 222431077740.3699242983220924071978717569154936371022471268183331350876054122423581921599960375605427424616873385879158412527249920879109769212411728225917185964391715528439125504"
    ],
    "duplicates": []
  },
  {
    "price": "$1300",
    "title": "Includes Utilities. Hardwoods. Fireplace.  SAMSON REALTY 8781",
    "href": "https://providence.craigslist.org/apa/d/providence-includes-utilities-hardwoods/7041872424.html",
    "description": [
      "About This Property:",
      "Beautiful one bedroom apartment. Overlooks river. 15 foot ceilings. Rent includes all utilities. Gleaming hardwoods throughout.  Large kitchen with white cabinets and bay windows. Elegant fireplace. Off-street parking for two cars. This property is in East Providence right over the Henderson (Red) Bridge and is just a quick jump to the East Side Wayland Square area.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 8781    samsoneastbay samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 87814254140213226.4554089133386970924240849374273068468346822477075026559514951123626573310262311342112878708310167224659034047509212938110320491247751201619271309267096431584841913214"
    ],
    "duplicates": []
  },
  {
    "price": "$1350",
    "title": "Charming 2 Bed. Great Location near Wayland Square. SAMSON REALTY 697",
    "href": "https://providence.craigslist.org/apa/d/providence-charming-2-bed-great/7041872094.html",
    "description": [
      "About This Property:",
      "Charming 2 bedroom apartment. Highly desirable East Side location near Wayland Square. On the first floor. Off-street parking for 1 car. Laundry in the basement. Nice backyard area surrounded by lush foliage. Truly a great apartment.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "PLEASE INCLUDE YOUR PHONE NUMBER IN YOUR MESSAGE.",
      "Thank You.",
      "LISTING CODE: 697    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 6972127542295.7142385855577118572263590312365060802249829725921314992775883648469666889357948368276921996469990953867380427692257108969540953719566975894126640607632426670901265142"
    ],
    "duplicates": []
  },
  {
    "price": "$1800",
    "title": "Close to Brown, Hardwoods, Fireplace SAMSON REALTY 8963",
    "href": "https://providence.craigslist.org/apa/d/providence-close-to-brown-hardwoods/7041871951.html",
    "description": [
      "About This Property:",
      "Charming three bedroom apartment available on the East Side of providence. Close to Blackstone blvd, Hope Street, and wayland square. Walking distance to Brown Stadium.  Hardwood floors, decorative fireplace, dishwasher. Laundry in Basement. Parking for 2.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 8963    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 89634524181896953.3907941518515731815849183127374576159161650871488559921112450474563688420892142103069612393728825246332892465586197960233939453754675659247042280197037582859434920738"
    ],
    "duplicates": []
  },
  {
    "price": "$1500",
    "title": "1 Bed in Wayland Square. Hot Water Incl. SAMSON REALTY 9094",
    "href": "https://providence.craigslist.org/apa/d/providence-1-bed-in-wayland-square-hot/7040627620.html",
    "description": [
      "About This Property:",
      "Charming East Side apartment with high ceilings, hardwood floors, and a decorative fireplace. Large double parlor with pocket doors, eat-in kitchen with all the appliances including a dishwasher, one bedroom with ample closet space. In the heart of Wayland Square with its restaurants, coffee shops, and stores all within walking distance. Free laundry on-site. Off-street parking for one. Hot water included. Near the colleges, Brown University, RISD.  (Lease term 3/1/20-12/31/20)",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 9094    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 90944725466818518.8042827390888231701112456905609813693488779445182706090972406121969164486691262937937442718792231562022626573942499228474994534596744118935363385791386116957878027536"
    ],
    "duplicates": []
  },
  {
    "price": "$1400",
    "title": "Angell st/September 2020/RISD & Brown/JLD",
    "href": "https://providence.craigslist.org/apa/d/providence-angell-st-september-2020/7051523398.html",
    "description": [
      "Location- Angell st",
      "Rent: $1,400 Month",
      "Beds: 1",
      "Bath: 1",
      "Available Date: 09/01/2020",
      "Pet: Pet-Friendly",
      "Parking:For Rent, Outdoor, $75.00 / Month",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL",
      "**Email for information on 2020-2021 Rentals. **",
      "Please contact us by email or text only"
    ],
    "duplicates": []
  },
  {
    "price": "$3300",
    "title": "5 Bd on Angell St/Main Green/June 2020/WIFI",
    "href": "https://providence.craigslist.org/apa/d/providence-5-bd-on-angell-st-main-green/7051516645.html",
    "description": [
      "Location- Angell st",
      "Rent: $3,300  Month",
      "Beds: 3",
      "Bath: 1.5",
      "Available Date: 06/01/2020",
      "Pet: Pet-Friendly",
      "Rent Includes: Internet, Furnished",
      "Parking: For Rent, Outdoor, $75.00 / Month",
      "Central Air",
      "Dishwasher",
      "Laundry in Unit",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL"
    ],
    "duplicates": []
  },
  {
    "price": "$3400",
    "title": "2020-2021/Barnes st/Brown & RISD/JLD",
    "href": "https://providence.craigslist.org/apa/d/providence-barnes-st-brown-risd-jld/7051518894.html",
    "description": [
      "Location- Barnes st",
      "Rent: $3,400 Month",
      "Beds: 4",
      "Bath: 3",
      "Available Date: 06/01/2020",
      "Pet: No Pets",
      "Central Air",
      "Dishwasher",
      "Laundry in Unit",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL"
    ],
    "duplicates": [
      null,
      null
    ]
  },
  {
    "price": "$3400",
    "title": "2020-2021/Barnes st/Brown & RISD/JLD",
    "href": "https://providence.craigslist.org/apa/d/providence-barnes-st-brown-risd-jld/7040111571.html",
    "description": [
      "Location- Barnes st",
      "Rent: $3400  Month",
      "Beds: 4",
      "Bath: 3",
      "Available Date: 06/01/2020",
      "Pet: No Pets",
      "Laundry in Unit",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL",
      "**Email for information on 2020-2021 Rentals. **",
      "Please contact us by email or text only"
    ],
    "duplicates": []
  },
  {
    "price": "$3400",
    "title": "2020-2021/Barnes st/Brown & RISD/JLD",
    "href": "https://providence.craigslist.org/apa/d/providence-barnes-st-brown-risd-jld/7023021702.html",
    "description": [
      "Location- Barnes st",
      "Rent: $3,400 Month",
      "Beds: 4",
      "Bath: 3",
      "Available Date: 06/01/2020",
      "Pet: No Pets",
      "Central Air",
      "Dishwasher",
      "Laundry in Unit",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL"
    ],
    "duplicates": []
  },
  {
    "price": "$2700",
    "title": "Updated apartment near Brown University/Jose L Diaz KW",
    "href": "https://providence.craigslist.org/apa/d/providence-updated-apartment-near-brown/7051521162.html",
    "description": [
      "Location- Angell st",
      "Bedrooms: 3",
      "Bathrooms: 2",
      "Rent: $2700",
      "Deposit: $2700",
      "Square Footage: 1200",
      "Pets Allowed: No",
      "Lease Term: 1 year /06/01/2020",
      "Laundry in unit",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL"
    ],
    "duplicates": [
      null,
      null,
      null
    ]
  },
  {
    "price": "$2700",
    "title": "Updated apartment near Brown University/Jose L Diaz KW",
    "href": "https://providence.craigslist.org/apa/d/providence-updated-apartment-near-brown/7040104430.html",
    "description": [
      "Location-Angell st",
      "Rent: $2,700  Month",
      "Deposit: $2700",
      "Laundry in unit",
      "Beds: 3",
      "Bath: 2",
      "Square Footage: 1200",
      "Lease Term: 1 year",
      "Available Date: 06/01/2020",
      "Pets Allowed: No",
      "This nice three bedrooms, two bathrooms apartment is located on the East Side of Providence. It is centrally located near schools and university. This apartment is 1200 square feet and offers a  renovated kitchen and bathroom.",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL",
      "**Email for information on 2020-2021 Rentals. **",
      "Please contact us by email or text only"
    ],
    "duplicates": []
  },
  {
    "price": "$2700",
    "title": "Updated apartment near Brown University/Jose L Diaz KW",
    "href": "https://providence.craigslist.org/apa/d/providence-updated-apartment-near-brown/7036452627.html",
    "description": [
      "Location- Angell st",
      "Rent: $2,700 Month",
      "Deposit: $2700",
      "Square Footage: 1200",
      "Beds: 3",
      "Bath: 2",
      "Laundry in unit/Dishwasher",
      "Lease Term: 1 year",
      "Available Date: 06/01/2020",
      "Pet: No Pets",
      "This nice three bedrooms, two bathrooms apartment is located on the East Side of Providence. It is centrally located near schools and universities. This apartment is 1200 square feet and offers a  renovated kitchen and bathroom.",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL",
      "**Email for information on 2020-2021 Rentals. **",
      "Please contact us by email or text only"
    ],
    "duplicates": []
  },
  {
    "price": "$2700",
    "title": "Updated apartment near Brown University/2020/JLD",
    "href": "https://providence.craigslist.org/apa/d/providence-updated-apartment-near-brown/7022429960.html",
    "description": [
      "Location-Angell st",
      "Rent: $2,700 Month",
      "Deposit: $2700",
      "Square Footage: 1200",
      "Beds: 3",
      "Bath: 2",
      "Available Date: 06/01/2020",
      "Pet: No Pet",
      "Laundry in unit",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL",
      "**Email for information on 2020-2021 Rentals. **",
      "Please contact us by email or text only"
    ],
    "duplicates": []
  },
  {
    "price": "$900",
    "title": "Brand new 2nd floor apartment in Providence",
    "href": "https://providence.craigslist.org/apa/d/providence-brand-new-2nd-floor/7058300474.html",
    "description": [
      "Brand new 2nd floor apartment, never before lived in. Brand new 5' red oak wide plank hardwood floors, custom maple mahogany cabinetry with granite and stainless steel appliances. Tiled bathroom shower makes a luxurious feel. 2 bedrooms, eat in kitchen, and large living room make this the perfect Fox Point rental. New washer/dryer for your use. Brand new fenced in backyard with a 200sqft patio. You are steps away from dining, night life and downtown providence. Today to schedule your personal tour! Contact me",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1200",
    "title": "One bedroom apartment - $1,200/month heat and water included",
    "href": "https://providence.craigslist.org/apa/d/providence-one-bedroom-apartment-month/7058286138.html",
    "description": [
      "A One bedroom apartment is available in Wayland Square starting September 1, 2019",
      "- The apartment on the 3rd floor at 37-41 South Angell street.",
      "- $1,2000 per month, heat and hot water included.",
      "- Very quiet and secure building.",
      "- Walking distance to number of shops, cafes, and restaurants, including CVS, Wholefoods, Starbucks.",
      "- Coin-operated laundry and dryer in basement",
      "- Parking spots available at $100/month",
      "- 15 minute walk to campus",
      "- Three bus routes (32, 33, 34) stop outside the apartment and travels to campus and downcity"
    ],
    "duplicates": []
  },
  {
    "price": "$1850",
    "title": "New Construction! Located in the heart of the East side of Providence",
    "href": "https://providence.craigslist.org/apa/d/providence-new-construction-located-in/7049615169.html",
    "description": [
      "NEW CONSTRUCTION! BRAND NEW APARTMENTS LOCATED IN THE HEART OF THE PRESTIGIOUS EAST SIDE OF PROVIDENCE! WALKING DISTANCE TO THE BEST RESTAURANTS, SHOPPING AND OTHER CONVENIENCES!",
      "KEN DULGARIAN, LUXURY LANDLORD WITH OVER 40 YRS OF EXCEPTIONAL SERVICE AND COMMITMENT TO HIS CLIENTS!",
      "Go to premierprov.com for testimonials"
    ],
    "duplicates": []
  },
  {
    "price": "$1850",
    "title": "Lloyd Manor 1A",
    "href": "https://providence.craigslist.org/apa/d/providence-lloyd-manor-1a/7046150105.html",
    "description": [
      "Lloyd Manor is a stately brick historic apartment building on the corner of Lloyd and Taber Avenue. It has beautiful moldings and trims, chandeliers throughout, and all common hallways have been recently painted and Hotel quality carpeting has been installed throughout. Also decorated with marble pedestals within the hallways.",
      "This apartment is absolutely beautiful, bright spacious one bedroom with lots of storage,  granite  countertops, Stainless steel appliances.",
      "KEN DULGARIAN, LUXURY LANDLORD WITH OVER 40 YRS OF EXCEPTIONAL SERVICE AND COMMITMENT TO HIS CLIENTS!",
      "Go to premierprov.com for testimonials"
    ],
    "duplicates": []
  },
  {
    "price": "$513",
    "title": "4+1.5 BED+BATH HOME- Eat-In Kitchen W/ Stove Refrigerator, Dishwasher!",
    "href": "https://providence.craigslist.org/apa/d/providence-415-bedbath-home-eat-in/7058006921.html",
    "description": [
      "4 Bedrooms, 1.5 Bathrooms, Eat-In Kitchen, Stainless Steel Appliances, Huge Backyard With Patio, Great For Entertaining. Washer And Dryer In The Basement. Plenty Of Storage. All Stainless Steel Appliances, The Kitchen Over Looks The Living Room For Easy Entertaining And Living Space. Living Room Has Big Windows And Plenty Of Natural Light. Lots Of Closet Space. Laundry Is Right In The Unit! Eat-In Kitchen With Stove Refrigerator And Dishwasher And Garbage Disposal. Parking. Close To Hospitals, School, Restaurant. Completely Updated Kitchen, Oak Floors, A Bonus Office Space At The Front Of The House, And An Enclosed Front Porch. Newer Mechanicals. 1 Garage Space And Lovely Back Yard With Patio For Summer Dining.",
      "-Features Include An Open Layout, Stainless Steel Appliances, Beautiful Hardwood Floors, Granite Countertops, Central A/C, High Efficiency Forced-Air Gas Furnace, Generous Closet Space, Small Front Deck, And More. -Off Street Parking-",
      "4+1.5 BED+BATH HOME- Eat-In Kitchen W/ Stove Refrigerator, Dishwasher!!",
      "4+1.5 BED+BATH HOME- Eat-In Kitchen W/ Stove Refrigerator, Dishwasher!!"
    ],
    "duplicates": []
  },
  {
    "price": "$0",
    "title": "Handyman's. Painting cleaning",
    "href": "https://providence.craigslist.org/apa/d/providence-handymans-painting-cleaning/7046787263.html",
    "description": [
      "INTERIOR PAINTING",
      "ROOMS START AS LOW AS",
      "$90.00 PER ROOM AND UP",
      "DEPENDS ON SIZE",
      "ALL 2 COATS",
      "INCLUDES..WALLS ..TRIM..DOORS...CLOSETS",
      "CUSTOMER BUYS PAINT...",
      "CEILINGS EXTRA...",
      "EXTERIOR PAINTING ....",
      "HOMES START AS LOW AS $900.00 AND UP DEPENDS ON SIZE OF HOME",
      "ALL HAND SCRAPED...",
      "ALL HAND BRUSHED..",
      "ALL 2 COATS...",
      "7 YEAR GAURANTEE...( ON CERTAIN PAINTS)",
      "REPAIRS EXTRA...",
      "CUSTOMER BUYS PAINT / PRIMMER AND ANY MATERIALS NEED FOR THE JOB...",
      "CAN ALSO SAVE UP TO $200.00. OFF YOUR ESTERIMATE",
      "WE ACCEPT CASH AND CHECKS ONLY",
      "DEPOSIT IS REQUIRED UPO. SIGNING CONTRACT TO SET DATE TO START ...",
      "WE ALSO DO....",
      "In business since 1986",
      "Serving mass . R.i. And ct",
      "Lowest prices in new England",
      "We do....",
      "Interior / exterior painting...",
      "Powerwashing ....",
      "Skim coat....",
      "Sheetrock ....",
      "Landscaping...",
      "Minor electric....",
      "Minor plumbing....",
      "Minor cement work...",
      "Janitorial...",
      "Some flooring ...",
      "Stain ...",
      "Gutting out homes....",
      "Apartment turnovers ....",
      "Wall/ ceiling repairs...",
      "Mold removal....",
      "Carpet removal...",
      "Wallpaper removal...",
      "Clean outs...",
      "Porch / deck repairs/ demo....",
      "Strip /wax floors....",
      "Window washing...",
      "Gutter cleaning / repairs...",
      "Install interior doors....",
      "Water seal basements...",
      "Paint basement/garage floors.....",
      "And much much more",
      "We do it all at very low prices.",
      "We will also barter services for many items in good to excellent condition.",
      "Call today for a free estimate",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$2100",
    "title": "Cozy & Gorgeous New 2Bd, 1-1/2ba Cottage w/ Laundry, Parking, A/C",
    "href": "https://providence.craigslist.org/apa/d/providence-cozy-gorgeous-new-2bd-1-1/7056234608.html",
    "description": [
      "Awesome new single family cottage next to all the great shops and restaurants/",
      "All new everything:",
      "From the foundation to the roof, every wall, ceiling, floor, insulation, electrical, plumbing, super high efficiency heating and A/C....",
      "The Oak floors, a gorgeous new solid wood kitchen with built-in microwave, 5 burner gas stove and 1.5 beautiful new baths, there's a/c, laundry in unit, and a dining area separate from the kitchen.",
      "2nd floor has 2 bedrooms and a full bath, and lots of closet space throughout.",
      "Walk to everything while you live in this beautiful place.",
      "Fabulous walk-able neighborhood with lots to do and easy highway access.",
      "This is a quiet house with no parties, no students, and NO SMOKING.",
      "Professionally managed.",
      "We are pet friendly, as long as you have a quiet, well behaved pet.",
      "We cannot accept aggressive animals or breeds prohibited by the insurance company.",
      "Small fees apply: $150 one time pet fee and $15/month pet rent.",
      "The rent is $2,200/month and the lease has a reward clause for those who pay on time before noon on the 1st of the month, deduct $100 making the rent $2,100/month.",
      "The water, sewer and trash pick up are included in the rent.",
      "The gas and electric are separately metered and your cost is based on your usage.",
      "That should be very modest as everything is new and efficient and insulated.",
      "Applicants should have excellent credit and verifiable rental and employment histories.",
      "1 month deposit is due with the submission of your application to hold the place off the market while we check your references.",
      "Upon approval that will become your security deposit.",
      "If you are not accepted, your check will be voided and a picture of the voided check texted to you.",
      "To set up a time to view this place, please TEXT your Name and apartment code #29D (so we know which place you are inquiring about) to",
      "show contact info",
      "Let us know several days and times that would work for you to meet and see the place.",
      "The house is available starting February 1st as the 1st resident needs to move.",
      "Thanks so much for your interest and we look forward to hearing from you.",
      "Happy House Hunting!"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$2100",
    "title": "Gorgeous New 2Bd, 1-1/2ba Cottage w/ Laundry, Parking, A/C",
    "href": "https://providence.craigslist.org/apa/d/providence-gorgeous-new-2bd-1-1-2ba/7054728812.html",
    "description": [
      "Fabulous Fox Point Newly Renovated Single Family Cottage with off street parking.",
      "All new everything:",
      "From the foundation to the roof, every wall, ceiling, floor, insulation, electrical, plumbing, super high efficiency heating and A/C....",
      "The Oak floors, a gorgeous new solid wood kitchen with built-in microwave, 5 burner gas stove and 1.5 beautiful new baths, there's a/c, laundry in unit, and a dining area separate from the kitchen.",
      "2nd floor has 2 bedrooms and a full bath, and lots of closet space throughout.",
      "Walk to everything while you live in this beautiful place.",
      "Fabulous walk-able neighborhood with lots to do and easy highway access.",
      "This is a quiet house with no parties, no students, and NO SMOKING.",
      "Professionally managed.",
      "We are pet friendly, as long as you have a quiet, well behaved pet.",
      "We cannot accept aggressive animals or breeds prohibited by the insurance company.",
      "Small fees apply: $150 one time pet fee and $15/month pet rent.",
      "The rent is $2,200/month and the lease has a reward clause for those who pay on time before noon on the 1st of the month, deduct $100 making the rent $2,100/month.",
      "The water, sewer and trash pick up are included in the rent.",
      "The gas and electric are separately metered and your cost is based on your usage.",
      "That should be very modest as everything is new and efficient and insulated.",
      "Applicants should have excellent credit and verifiable rental and employment histories.",
      "1 month deposit is due with the submission of your application to hold the place off the market while we check your references.",
      "Upon approval that will become your security deposit.",
      "If you are not accepted, your check will be voided and a picture of the voided check texted to you.",
      "To set up a time to view this place, please TEXT your Name and apartment code #29D (so we know which place you are inquiring about) to",
      "show contact info",
      "Let us know several days and times that would work for you to meet and see the place.",
      "The house is available starting February 1st as the 1st resident needs to move.",
      "Thanks so much for your interest and we look forward to hearing from you.",
      "Happy House Hunting!"
    ],
    "duplicates": []
  },
  {
    "price": "$2000",
    "title": "Brand New 2 Bed Loft",
    "href": "https://providence.craigslist.org/apa/d/providence-brand-new-2-bed-loft/7057969611.html",
    "description": [
      "This 3rd floor, newly renovated loft is a modernly designed oasis among older homes. With exposed wood beams, new granite counter tops, a tiled shower, and high-quality light fixtures, it's a truly unique 2 bedroom apartment!",
      "Amenities also include washer and dryer in the building, plenty of storage/ closet space in unit, an off-street parking spot and landlord next door for quick responses to questions.",
      "Looking for a February 1 move-in date, but could be flexible based on the situation.",
      "Please call or text for serious inquiries only."
    ],
    "duplicates": []
  },
  {
    "price": "$1600",
    "title": "2 Bedroom W/Parking & Laundry 2nd Floor",
    "href": "https://providence.craigslist.org/apa/d/providence-2-bedroom-parking-laundry/7057963517.html",
    "description": [
      "1+ year lease available for a 2bed/1bathroom 2nd floor apartment around the corner from Noodles 102 and PVD Donuts in the Fox Point Neighborhood of East Side of Providence. This is the 1st floor of a 3-floor apartment home.",
      "Amenities include a driveway parking spot off-street, free use of a washer and dryer in the building, and a hands-on landlord next door for quick responses.",
      "Looking for a February 1 move-in date, but could be flexible based on the situation.",
      "Please call or text for serious inquiries only."
    ],
    "duplicates": []
  },
  {
    "price": "$1600",
    "title": "2 Bedroom W/Parking & Laundry 1st Floor",
    "href": "https://providence.craigslist.org/apa/d/providence-2-bedroom-parking-laundry/7057921620.html",
    "description": [
      "1+ year lease available for a 2bed/1bathroom 1st floor apartment around the corner from Noodles 102 and PVD Donuts in the Fox Point Neighborhood of East Side of Providence. This is the 1st floor of a 3-floor apartment home.",
      "Amenities include a driveway parking spot off-street, free use of a washer and dryer in the building, and a hands-on landlord next door for quick responses.",
      "Looking for a February 1 move-in date, but could be flexible based on the situation.",
      "Please call or text for serious inquiries only."
    ],
    "duplicates": []
  },
  {
    "price": "$1150",
    "title": "PRIME EAST SIDE LOCATION: 1 bedroom MASTERPIECE w/ HEAT+HW++ INCLUDED!",
    "href": "https://providence.craigslist.org/apa/d/providence-prime-east-side-location-1/7041739394.html",
    "description": [
      "1 bedroom apartment w/ HEAT, HW & COOKING GAS INCLUDED!",
      "PRIME location! Quick walk to BROWN & RISD!",
      "Perfectly located in the EAST SIDE OF PROVIDENCE off Angell, Waterman & Wickenden. Walking distance to everything on the Brown University campus, RISD & the hospitals!",
      "*** This apartment can come fully furnished with a VERY nice queen-size bed, couch, and kitchen table! *** If you don't want the furniture, that is no problem at all. The furniture is offered to you for free but is completely optional!",
      "Laundry & plenty of safe, off-street parking in the parking lot!",
      "READY FOR YOU TO MOVE IN!!! *** FLEXIBLE lease! *** FLEXIBLE!",
      "Please call me right now at",
      "show contact info",
      "to discuss & to schedule an appointment to view! SHOWING TODAY!",
      "show contact info"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1150",
    "title": "EAST SIDE: FURNISHED 1 bedroom apartment W/ HEAT+HW+GAS INCLUDED+W&D!",
    "href": "https://providence.craigslist.org/apa/d/providence-east-side-furnished-1/7038194029.html",
    "description": [
      "FURNISHED 1 bedroom apartment w/ HEAT, HW & COOKING GAS INCLUDED!",
      "PRIME location! Quick walk to BROWN & RISD!",
      "Perfectly located in the EAST SIDE OF PROVIDENCE off Angell, Waterman & Wickenden. Walking distance to everything on the Brown University campus, RISD & the hospitals!",
      "This apartment will be fully furnished with a VERY nice queen-size bed, couch, and kitchen table. Laundry & off-street parking in the parking lot!",
      "Ready for you to move in!!! *** FLEXIBLE lease! *** FLEXIBLE!",
      "Please call me right now at",
      "show contact info",
      "to discuss & to schedule an appointment to view! SHOWING TODAY!"
    ],
    "duplicates": []
  },
  {
    "price": "$1150",
    "title": "Great Space! - Walk to Brown  Risd and Wickenden/Thayer Streets",
    "href": "https://providence.craigslist.org/apa/d/providence-great-space-walk-to-brown/7054617926.html",
    "description": [
      "Contact info:",
      "Glenn",
      "2BR/1BA Apartment - Providence",
      "290 Williams St, Providence, RI 02906",
      "$1,150/mo",
      "KEY FEATURES",
      "Sq Footage:",
      "1000 sqft.",
      "Bedrooms:",
      "2 Beds",
      "Bathrooms:",
      "1 Bath",
      "Parking:",
      "1 Off street",
      "Lease Duration:",
      "1 Year (See Details Below)",
      "Deposit:",
      "$1,150",
      "Pets Policy:",
      "Cats & Dogs OK",
      "Laundry:",
      "Shared",
      "Floor:",
      "2nd",
      "Property Type:",
      "Apartment",
      "DESCRIPTION",
      "Bright and spacious, 2nd floor, 2 bedrooms with smaller 3rd room for a study, wood/tile flooring.  Great location in FoxPoint/College Hill neighborhood close to shops, restaurants, cafes, steps away from trolley/bus stops and an easy walk or bike ride to Brown/RISD, Wayland Square, Thayer St and Wickenden St.",
      "RENTAL FEATURES",
      "Living room",
      "Storage space",
      "Office",
      "Range / Oven",
      "Refrigerator",
      "Heat: forced air",
      "Hardwood floor",
      "Tile floor",
      "COMMUNITY FEATURES",
      "Secured entry",
      "Near transportation",
      "LEASE TERMS",
      "The rent is $1150mo. coin op laundry, always accessible off street parking with snow removal, lease from 02/01/20 pet considered.  Please send an email with some basic info about yourself and if possible a phone # and best times you can be reached.  Thanks!"
    ],
    "duplicates": []
  },
  {
    "price": "$1000",
    "title": "Providence/Fox Point Third Floor Two Bed - $1,000",
    "href": "https://providence.craigslist.org/apa/d/providence-providence-fox-point-third/7052845679.html",
    "description": [
      "This third floor, two bed unit is located in one of the most desirable areas of Providence, just seconds from Wayland Square and College Hill",
      "• Includes over 700 sq. feet of living space with fresh paint throughout",
      "• Spacious eat in kitchen with updated appliances",
      "• Bright and sunny livingroom",
      "• Spacious beds with carpeting and ample closet space",
      "• Large clean bath with full tub and all ceramic tile",
      "• Comfortable steam heat throughout – tenant responsible for oil and electric",
      "• Coin-op laundry in building",
      "• Two off-street parking spots included",
      "• Cats allowed - no dogs",
      "• Great East Side/Fox Point location, walking distance to Brown, Wayland Square, Wickenden and less than 1 mile to 195",
      "Real Property Management",
      "show contact info",
      "Please call Ron Caliri at",
      "show contact info",
      "to schedule a viewing"
    ],
    "duplicates": []
  },
  {
    "price": "$1450",
    "title": "Exclusive East Side-Two Bed Condo - $1,450",
    "href": "https://providence.craigslist.org/apa/d/providence-exclusive-east-side-two-bed/7052085817.html",
    "description": [
      "***Walking distance to Miriam Hospital***",
      "This 1st floor unit has almost 1,000 sq. feet of living space with fresh paint and immaculate hardwoods throughout",
      "• Beautiful wide open floor plan with great natural lighting throughout",
      "• Updated kitchen with stainless steel and gas cooking",
      "• Double parlor with spotless hardwood flooring – great set up as a formal dining area!",
      "• Over-sized bath with full tub, all ceramic tile and new pedestal sink",
      "• Spacious beds with ample closet space and warm vinyl windows",
      "• Efficient gas heat and hot water",
      "• Unit also has Central AC!!",
      "• Two off-street parking spaces",
      "• Private laundry in basement",
      "• Very desirable East Side location, seconds to Miriam and just minutes to Brown, RISD and RT 95",
      "• NO PETS",
      "Real Property Management",
      "show contact info",
      "Please call Ron Caliri at",
      "show contact info",
      "to schedule a viewing"
    ],
    "duplicates": []
  },
  {
    "price": "$2385",
    "title": "$2385 / 3br - 1200ft on Arnold/Benefit RISD/Brown",
    "href": "https://providence.craigslist.org/apa/d/providence-br-ft-on-arnold-benefit-risd/7057780808.html",
    "description": [
      "1rd floor 3BR apartment available in house on prime block on College Hill. Location is great for Brown and RISD students, especially RISD ID and Architecture. 5 min walk to Wickenden St and 10 min walk downtown over new bridge. Great restaraunts and coffee just a block or two away by foot.",
      "Currently occupied by Brown Students. Great for 3 people.",
      "Spacious and updated rooms. Updated gourmet kitchen with granite counter island and view of downtown, dishwasher, stove, countertops, sink, etc. Updated tile bath. Monitored alarm and smoke detectors system. Coin laundry (new dryer) and personal private storage lockers in basement.",
      "Private back yard and driveway parking (5 spots shared with other housemates) available.",
      "Plenty of storage room in basement. Each bedroom has their own personal storage locker in basement, Windows have been updated for efficiency and house has recently fully insulated. All 3 apartments are on separate meters and have separate heating systems, allowing each group to individually track expenses. Exterior of house was recently entirely renovated, insulated and painted. The house is professionally landscaped and maintained.",
      "This is our 18th year anniversary in the house and we have had many very happy tenants over the years. Happy to share references.",
      "Available June 1, 2020. Lease term is 1 year June 1 - May 31. We are open to a 2 year lease.",
      "We are not professional landlords. This is our only property, and we will look for students that have good references and that will take good care of the house.",
      "If you are interested, please contact us.",
      "Dimitry Herman"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$3180",
    "title": "$3180 / 4br - 1200ft2 on Arnold/Benefit RISD/Brown Students",
    "href": "https://providence.craigslist.org/apa/d/providence-br-ft2-on-arnold-benefit/7057756815.html",
    "description": [
      "3rd floor 4BR apartment available in house on prime block on College Hill. Location is great for Brown and RISD students, especially RISD ID and Architecture. 5 min walk to Wickenden St and 10 min walk downtown over new bridge.  Great restaraunts and coffee just a block or two away by foot.",
      "Currently occupied by Brown and RISD Students. Great for 4 or 5 people.",
      "Spacious and updated rooms. Updated gourmet kitchen with granite counter island and view of downtown, dishwasher, stove, countertops, sink, etc. Updated tile bath. Monitored alarm and smoke detectors system. Coin laundry (new dryer) and personal private storage lockers in basement.",
      "Private back yard and driveway parking (5 spots shared with other housemates) available.",
      "Plenty of storage room in basement. Each bedroom has their own personal storage locker in basement, Windows have been updated for efficiency and house has recently fully insulated. All 3 apartments are on separate meters and have separate heating systems, allowing each group to individually track expenses. Exterior of house was recently entirely renovated, insulated and painted. The house is professionally landscaped and maintained.",
      "This is our 18th year anniversary in the house and we have had many very happy tenants over the years. Happy to share references.",
      "Available June 1, 2020. Lease term is 1 year June 1 - May 31. We are open to a 2 year lease.",
      "We are not professional landlords. This is our only property, and we will look for students that have good references and that will take good care of the house.",
      "If you are interested, please contact us.",
      "Dimitry Herman"
    ],
    "duplicates": []
  },
  {
    "price": "$2500",
    "title": "Still Have a few Fox Point houses and apartments for 2020",
    "href": "https://providence.craigslist.org/apa/d/providence-still-have-few-fox-point/7051590800.html",
    "description": [
      "We currently have a single family house which has 6 bedrooms, two full bathrooms, a washer dryer in the house, hardwood floors throughout and includes some parking.  This house is right on Gano St and only a short walk to everything the Fox Point neighborhood has to offer.  We also still have a 5 bedroom and a 3 Bedroom apartment located on John St across the street from the French American school.  On top of that we have a large 5 Bedroom house located right across the street from Providence College.  These houses and apartments start at only 550 per bedroom.  Give us a call to schedule a tour.  These are all for June 1 start dates."
    ],
    "duplicates": []
  },
  {
    "price": "$2800",
    "title": "Spectacular 4 Bed 2 Bath Newly Renovated apartment",
    "href": "https://providence.craigslist.org/apa/d/providence-spectacular-4-bed-2-bath/7051591541.html",
    "description": [
      "VIEW MORE PICS AND OVER 100 MORE APARTMENTS ON OUR SITE!",
      "WWW.LENOXPROPERTY.COM",
      "29 Creighton 3rd floor",
      "Property Details",
      "Description: We currently have a spectacular 4 Bedroom 2 Full Bathroom apartment located on the third floor in one of the nicest neighborhoods on College Hill's East Side. This apartment comes furnished although if someone wanted it unfurnished we could negotiate. The apartment was completely remodeled this year and includes parking for two cars. We are leasing it until June of next year and it is an easy show. The apartment has a gourmet kitchen, central AC and brand new everything. For more information and to set up a showing contact Gabe at",
      "show contact info",
      "Price: $ 2800",
      "Bedrooms: 4",
      "Address: 29 Creighton St",
      "City: Providence",
      "State: Rhode Island",
      "Neighborhood: East Side/College Hill",
      "\";",
      "Lenox Realty Group",
      "380 Broadway",
      "Providence RI 02909",
      "WWW.LENOXPROPERTY.COM",
      "http://lenoxproperty.com/rhode-island/realty/29-creighton-3rd-floor"
    ],
    "duplicates": []
  },
  {
    "price": "$2400",
    "title": "June 1, 2020- NEW 3 Bed/2 Bath- Elton St/East Side- Close to Brown",
    "href": "https://providence.craigslist.org/apa/d/providence-june-new-3-bed-2-bath-elton/7048946178.html",
    "description": [
      "Stunning 3 bedroom/2 bathroom rental on Elton Street in beautiful East Side. Available June 1, 2020. Renovated kitchen with granite, marble bathrooms, laundry in-unit, central air, plus so much more. Includes off-street parking for 1 vehicle. Utilities not included.  Other occupants in the building are Brown medical students. For more information or to schedule a showing, please email/call/text Ryan LeMay at RentProv Realty",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1700",
    "title": "Furnished 2 Bed- ON THAYER STREET- January 1st- Students Welcome- RARE",
    "href": "https://providence.craigslist.org/apa/d/providence-furnished-2-bed-on-thayer/7050743510.html",
    "description": [
      "Newly listed Furnished 2 bedroom located ON Thayer Street in the East Side of Providence. Available January 1st. Students welcome. RARE rental. Will not be available long. $1,700 with utilities not included. Walking distance to restaurants, nightlife, entertainment, and so much more. Coin-operated laundry on site. Parking avaialble for 1. Sorry, no pets please. For more information or to schedule a showing, please email/call/text Ryan LeMay at RentProv Realty",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$2750",
    "title": "September 1st Rental:  Renovated 5 Bed-2.5 Bath- East Side- Students",
    "href": "https://providence.craigslist.org/apa/d/providence-september-1st-rental/7052234137.html",
    "description": [
      "Contact info:",
      "Ryan | RentProv Realty |",
      "show contact info",
      "|",
      "September 1st Rental:  Renovated 5 Bed-2.5 Bath- East Side- Students Welcome",
      "25 Evergreen St 2nd & 3rd, Providence, RI 02906",
      "$2,750/mo",
      "KEY FEATURES",
      "Bedrooms:",
      "5 Beds",
      "Bathrooms:",
      "2.5 Baths",
      "Parking:",
      "4+ Off street",
      "Lease Duration:",
      "1 Year (See Details Below)",
      "Deposit:",
      "$2,750",
      "Pets Policy:",
      "No Pets Allowed",
      "Laundry:",
      "Shared",
      "Property Type:",
      "Townhouse",
      "DESCRIPTION",
      "Beautiful 5 bed/2.5 bath located in East Side of Providence.  Pictures do not do justice!  Close to Brown University, RISD, and many other amenities.  Students welcome.  Includes off-street parking for multiple vehicles and shared laundry on site.  $2,750 utilities not included.  For more information or to schedule a showing, please email/call/text Ryan at RentProv Realty",
      "show contact info",
      "RENTAL FEATURES",
      "Living room",
      "Walk-in closet",
      "Master bath",
      "Range / Oven",
      "Refrigerator",
      "Dishwasher",
      "Microwave",
      "Garbage disposal",
      "Stainless steel appliances",
      "Freezer",
      "Wired",
      "Hardwood floor",
      "Granite countertop",
      "COMMUNITY FEATURES",
      "New property",
      "Off-street parking",
      "LEASE TERMS",
      "September 1st Rental- 1 Year Lease",
      "ADDITIONAL LINKS",
      "Website:",
      "Contact info:",
      "Ryan",
      "RentProv Realty",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1050",
    "title": "Rare 2 bedroom single family home in desired Fox point area",
    "href": "https://providence.craigslist.org/apa/d/providence-rare-2-bedroom-single-family/7057565549.html",
    "description": [
      "Single family home located in much desired Fox Point/Wickenden area. 2 Bedrooms and 2 Full Bathrooms, renovated kitchen, open Living room/kitchen space and large loft space. Lower level family room. Laundry in unit. Private patio with 2 car tandem parking. Walk to shops and restaurants. This is an amazing offer with utilities included in the rent, it will not last long."
    ],
    "duplicates": []
  },
  {
    "price": "$1000",
    "title": "Rent to Own @  Wonderful East Side 2bed 1bayh home, 45 Olney Street.",
    "href": "https://providence.craigslist.org/apa/d/providence-rent-to-own-wonderful-east/7057261733.html",
    "description": [
      "Welcome home to this wonderful East Side apartment. This second floor unit features a spacious living room and dining area. The lovely private deck off the kitchen is perfect to sip your morning coffee or to dine al fresco in the evenings. Featuring two large bedrooms with ample storage space. Meticulously maintained common areas and extra storage and FREE laundry in the lower level. One off street space is included in the rent. Tenant pays utilities. This is a wonderful place to call home! Pet fridly, Available for rent to own. For showing house or more information, email here:",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1100",
    "title": "22 Halsey St UNIT 1, Rent To Own, Beautiful and charming",
    "href": "https://providence.craigslist.org/apa/d/providence-22-halsey-st-unit-1-rent-to/7052761919.html",
    "description": [
      "Beautiful and charming, classic college hill condo with 2 of everything! 2 huge bedrooms. 2 baths! 2 patios! 2 assigned parking spots! Too cute to tell, and too close to EVERY imaginable amenity to pass up this opportunity. Ready for immediate occupancy. You'll love the history of this converted tenement - originally built by Nathaniel Helme in 1843, and later converted to a boarding house by Mrs. Helme. You'll love the open layout, the fireplace, the neighborhood, the restaurants, the arts, the culture, etc. etc. etc. Just steps from the city's most storied Benefit St., this home is not to be missed, and will not last. Brand new appliances and heating system!",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1100",
    "title": "29 Hart St, Rent To Own, gorgeous remodeled 3 bedroom 1.5 bath home",
    "href": "https://providence.craigslist.org/apa/d/providence-29-hart-st-rent-to-own/7053308949.html",
    "description": [
      "Desirable area on the East Side of Providence, gorgeous remodeled 3 bedroom 1.5 bath home on corner lot. Large farmers porch front of home, leading into a magnificent foyer area. Gleaming hardwood floors throughout, spacious rooms with high ceilings. Updated kitchen with stainless appliances, granite countertops with island leading to a walkout deck and huge fenced in yard. Updated 2nd floor bath with double sink vanity, ceramic stand alone tub, tiled/glass shower, private water closet, along with laundry area. Roof is less than 2 years old, complete updated plumbing/electrical throughout home. Includes a 2car detached garage w/ loft and large driveway. Walking distance to East Side Shops, Hope Street Shops, Restaurants, Recreational Facilities and Lippitt Park Farmers Market. Minutes to Universities, Hospitals, Providence Train Station and So. Attleboro Commuter Train Station.",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$3300",
    "title": "Angell St/Brown/WiFi included/Furnished/JLD",
    "href": "https://providence.craigslist.org/apa/d/providence-angell-st-brown-wifi/7040109580.html",
    "description": [
      "Location- Angell st",
      "Rent: $3,300 Month",
      "Beds: 3",
      "Bath: 1.5",
      "Available Date: 06/01/2020",
      "Pet: Pet-Friendly",
      "Rent Includes: Internet",
      "Parking:For Rent, Outdoor, $75.00 / Month",
      "Furnished",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL",
      "**Email for information on 2020-2021 Rentals. **",
      "Please contact us by email or text only"
    ],
    "duplicates": []
  },
  {
    "price": "$1000",
    "title": "2 Bedroom 1st Floor",
    "href": "https://providence.craigslist.org/apa/d/providence-2-bedroom-1st-floor/7056872972.html",
    "description": [
      "2 Bedroom Apartment on the first floor of a 3 family home, Double Parlor, 2 off street parking spots, fenced in backyard,  conveniently located, Call Mike at",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$2200",
    "title": "Beuatiful apartment East Side",
    "href": "https://providence.craigslist.org/apa/d/providence-beuatiful-apartment-east-side/7056835301.html",
    "description": [
      "Beautiful, just updated apartment in the heart of East Side, quiet street, close to Brown, Wayman Sq., Blackstone Blv., is for rent from February 1st 2020.",
      "The second floor apartment (first is owner occupied) has 2 good size bedrooms, 1 new bathroom, new kitchen open to dining room, good size living room with fireplace (double parlor) and a den that can be used as office or spare bedroom.",
      "1472 square feet",
      "The kitchen and bathroom have quartz counters, brand new Bosch appliances, (gas stove, dishwasher fridge) new bathroom has a shower and a free standing soaking tub.",
      "New water heater, new, very efficient gas steam boiler heating, new LG washer and dryer in the private basement.",
      "There are 2 private staircase entrances to the apartment. The main entrance is from front and second is side entrance with access to the private basement laundry and leads upstairs into the kitchen.",
      "The apartment comes with 1 garage space and 1 parking space in the driveway and we are working on the access to the backyard for grilling and possibly small enclosed area for dog",
      "Wifi, Hulu TV, Netflix, water, parking for 2 cars included",
      "For information and private showing please call Daniela",
      "show contact info",
      "The apartment is in the process of renovating floors and walls, they are unfinished on the pictures."
    ],
    "duplicates": []
  },
  {
    "price": "$1225",
    "title": "Nice One Bedroom in Great Location, Includes Heat, Hot Water - June 1",
    "href": "https://providence.craigslist.org/apa/d/providence-nice-one-bedroom-in-great/7056717113.html",
    "description": [
      "Awesome East Side One Bedroom. Located directly in Wayland Square you are just steps away from gourmet dining, boutique shopping, and conveniences. This apartment features hardwood floors, large bright windows, historic moldings, eat in kitchen, and laundry in the building. Rent includes heat and  hot water. Available June 1st!   Overnight parking may be available for additional fee.  Pet friendly (some breed restrictions/pet fees apply).  For more info or to schedule an appointment please call",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1195",
    "title": "Newer Studio, Walk to Wayland Square, Incl Heat/Parking - June 1st",
    "href": "https://providence.craigslist.org/apa/d/providence-newer-studio-walk-to-wayland/7050894335.html",
    "description": [
      "Great East Side Location! This studio is on the first floor, features stainless appliances, granite counter tops, tiled flooring and extra storage in the basement. Close to Blackstone Blvd., Whole Foods, public transportation and conveniences. The rent includes heat, hot water, parking for one car and free laundry. Please call",
      "show contact info",
      "for more info. Credit and background check required.  Pet friendly (some breed restrictions/pet fees apply).  Studio is for one person and will be available June 1st!  Thanks for viewing our listing! If you're looking for an apartment please give us a call."
    ],
    "duplicates": []
  },
  {
    "price": "$1250",
    "title": "Great East Side Location, 1 Bed, Includes Heat, HW & Parking - April 1",
    "href": "https://providence.craigslist.org/apa/d/providence-great-east-side-location-1/7050976266.html",
    "description": [
      "This apartment is just steps from Wayland Square's dining, shopping, and conveniences. Walk to beautiful Blackstone Blvd., Brown, and RISD. This second floor apartment has nice hardwood floors, ceiling fan, tiled kitchen and bath.  Rent Includes Heat, Hot Water, and Parking. To schedule an appointment, please call",
      "show contact info",
      ". Available April 1st!  Pet friendly (some breed restrictions/pet fees apply)."
    ],
    "duplicates": []
  },
  {
    "price": "$1150",
    "title": "Wayland Square One Bedroom Includes Parking - June 1",
    "href": "https://providence.craigslist.org/apa/d/providence-wayland-square-one-bedroom/7050980991.html",
    "description": [
      "Great East Side location!  This community offers amazing restaurants and unique shopping all within walking distance to Wayland Square, Blackstone Blvd, and Brown University.  This top floor one bedroom features hardwood floors, granite counter tops in kitchen and tiled bath.  Rent includes hot water and one parking space.   Pets are welcome (pet rent charges will apply/some breed restrictions).  Please call",
      "show contact info",
      "for more info.  Available June 1st!  Credit and background check required.  Thanks for viewing our listing!"
    ],
    "duplicates": []
  },
  {
    "price": "$1050",
    "title": "Newer Studio, Walk to Wayland Square, Includes Parking - April 1st",
    "href": "https://providence.craigslist.org/apa/d/providence-newer-studio-walk-to-wayland/7051408832.html",
    "description": [
      "Newer studio in great East Side location!  This community offers amazing restaurants and unique shopping all within walking distance to Wayland Square, Blackstone Blvd, and Brown University.  This lower level studio is very well insulated for energy efficiency; it features stainless appliances, granite counter tops, tiled bath with stall shower, generous storage closet, air conditioning, dehumidifier and private entrance.  Studio is for one person and includes one parking space.   Pets are welcome (pet rent charges will apply/some breed restrictions).  Please call",
      "show contact info",
      "for more info.  Available April 1st!  Credit and background check required.  Thanks for viewing our listing!"
    ],
    "duplicates": []
  },
  {
    "price": "$1500",
    "title": "2-4 Month Lease Furnished Lux Apartment By Brown Risd Hope Street!",
    "href": "https://providence.craigslist.org/apa/d/providence-2-4-month-lease-furnished/7045912039.html",
    "description": [
      "Rare find. Gorgeous 2 bedroom 1 bathroom newly renovated apartment by Brown University and a block from Hope Street! Complete with granite counter tops and stainless appliances, this amazing and spacious apartment is two blocks from 7 star bakery and hope street ! Huge living room and combined kitchen with new hardwood floors. New stone and tile bathrooms with rain shower ! Available for 2-4 Months with a possibility of renewal. This place just finished renovations and will go fast at $1600 ! Looking for spring semester students, grad students and professionals.",
      "This is Available Furnished or Unfurnished. 2 Private parking spots",
      "Available Jan 10t!",
      "Next to Miriam Hospital, Wickenden street, by college hill, rhode island hospital, brown university hasbro children's hospital."
    ],
    "duplicates": []
  },
  {
    "price": "$1100",
    "title": "Great 2 bed apartment",
    "href": "https://providence.craigslist.org/apa/d/providence-great-2-bed-apartment/7056527213.html",
    "description": [
      "Cute 2 bedroom located in the heart of the east side, large double parlor, large kitchen. Shared yard,off street parking available during parking bans, please call/text Gian",
      "show contact info",
      ", thanks!"
    ],
    "duplicates": []
  },
  {
    "price": "$1675",
    "title": "Furnished 2 bed - East Side",
    "href": "https://providence.craigslist.org/apa/d/providence-furnished-2-bed-east-side/7054813436.html",
    "description": [
      "Completely furnished bright, airy 2 bed, 2nd floor with laundry in unit, dishwasher, beautiful porch, off Street one car parking and Street permit parking. Walk to Brown, bus, Hope Street shops. All utilities included- heat, gas, electric and WiFi.",
      "Photos speak to condition! Available 2/1/20"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1675",
    "title": "Furnished 2bed East Side",
    "href": "https://providence.craigslist.org/apa/d/providence-furnished-2bed-east-side/7054805436.html",
    "description": [
      "Completely furnished!",
      "2 bed, bright, airy, fabulous 3rd fl loft space with galley kitchen, kick ass large bathroom with walk-in shower and claw foot tub. Dishwasher, laundry on premise, nice balcony porch. 1 car parking and permit street.",
      "Call or text - no emails please!",
      "Available now."
    ],
    "duplicates": []
  },
  {
    "price": "$1900",
    "title": "READY FOR IMMEDIATE MOVE! EAST SIDE- FREE PARKING",
    "href": "https://providence.craigslist.org/apa/d/ready-for-immediate-move-east-side-free/7051081032.html",
    "description": [
      "New construction at its finest! a young 22-unit luxury apartment building nestled in the desirable Hope section of Providence. This creative area is minutes to universities, hospitals, highways, and shopping!",
      "This building features super-insulated, double stud wall construction for extreme energy efficiency, superb indoor air quality, and elegant studio, one, & two bedroom apartments. All the units feature modern architect designed kitchens and bathrooms, generous living spaces, off-street parking, floor to ceiling windows, and did we mention that it's steps from the East Side?",
      "Well designed kitchen features stainless steel appliance package with granite counter tops, dishwasher, microwave with vented hood for all your cooking needs! Trendy ceramic tile back-splash accents the granite and the stainless steel making this kitchen a true showpiece!!",
      "Open floor plan allows all the comforts to your family and friends. The light from the floor to ceiling windows illuminates the unit with light and sweeps it with warm air! Spacious and cozy bedrooms deliver generous closets; large windows welcoming sunlight an fresh morning breezes!",
      "This unit shines with bamboo flooring throughout, custom lighting, and calming paint colors. Tile bath with tub/stall shower and granite counters.",
      "Building features: Secure entry with intercom and remote entry system, access to fitness room and comfy lobby with FREE WIFI. A dedicated indoor bike room, package room, and elevator access to all 4 floors. Ample exterior parking for additional vehicles and guests. A dedicated laundry area on site.",
      "We welcome your pets in our pet friendly community ( pet rent charges will apply/restricted breed list). High efficiency heat-pump heating and cooling system in each room allows you to control temperatures where needed. Did we already mention the iconic EAST SIDE?",
      "This walkable community offers delicious restaurants, unique shopping, and magnificent entertainment. This thriving community offers all the conveniences locally yet nestled in a warm welcoming neighborhood.",
      "Contact Kate for more information about this incredible opportunity!!",
      "show contact info",
      "from 8AM-8PM View the floor plans and pricing on our website at www.101-Hillside.com."
    ],
    "duplicates": [
      null,
      null
    ]
  },
  {
    "price": "$1675",
    "title": "NEW CONSTRUCTION!! READY TO OCCUPY! PARKING & RENT SPECIALS",
    "href": "https://providence.craigslist.org/apa/d/providence-new-construction-ready-to/7027568888.html",
    "description": [
      "New construction at its finest! The Upton Residences - a brand new 30-unit luxury apartment building nestled in the desirable West Side of Providence is now leasing! Our elegant and spacious one and two-bedroom apartments are roomier and have nicer finishes than the competition. All the units feature modern kitchens and bathrooms, generous living spaces, large windows and off-street parking, all within a few minutes’ walk of Downtown Providence.",
      "Inside, the well-designed kitchen features stainless steel appliance package with granite counter tops, tile backsplash, dishwasher and microwave with vented hood for all your cooking needs! Open floor plans allow you to furnish freely for your family and friends. Also, you’ll find spacious bedrooms with ample closets, not to mention that each apartment comes with abundant storage space and closets. There are handsome and durable bamboo flooring throughout, except in the bathrooms, which are tile with tile shower surrounds and granite counters. There is a dedicated laundry room on each floor.",
      "This building features super-insulated construction for extreme energy-efficiency, and continuous ventilation for superb indoor air quality. High efficiency heat-pump heating and cooling systems in each room allows you to “set it and forget it” while saving on your monthly utility bill!",
      "As for security, the Upton comes with secure entrances with intercom and remote entry system as well as security cameras throughout. There is secure covered parking on the ground floor (1 FREE SPACE FOR 1 YEAR, IF APPROVED BY 12/31/19) with indoor Bike storage (no charge). In addition, there is elevator access to all 3 floors from the parking areas, and ample exterior parking on site. Also we offer a dedicated secure package area in the lobby.",
      "We welcome your pets in our pet friendly community (pet rent charges will apply/restricted breed list/weight limits).",
      "This walkable community offers delicious restaurants, unique shopping, and plenty of entertainment venues nearby. Also, you’ll find this thriving community offers most conveniences locally yet sits in a warm and welcoming neighborhood. (Not to mention the fabulous new Urban Greens Food Co-op right next door!)",
      "Contact Kate for more information about this incredible opportunity!! Call/TEXT 450-0731 from 8AM-8PM View the floor plans, pricing, and availability on our website at www.Uptonpvd.com.",
      "THIS IS A NON-SMOKING FACILITY."
    ],
    "duplicates": []
  },
  {
    "price": "$1395",
    "title": "PARKING SPECIALS! RENT SPECIALS! NEW CONSTRUCTION!",
    "href": "https://providence.craigslist.org/apa/d/providence-parking-specials-rent/7027539288.html",
    "description": [
      "New construction at its finest! The Upton Residences - a brand new 30-unit luxury apartment building nestled in the desirable West Side of Providence is now leasing! Our elegant and spacious one and two-bedroom apartments are roomier and have nicer finishes than the competition. All the units feature modern kitchens and bathrooms, generous living spaces, large windows and off-street parking, all within a few minutes’ walk of Downtown Providence.",
      "Inside, the well-designed kitchen features stainless steel appliance package with granite counter tops, tile backsplash, dishwasher and microwave with vented hood for all your cooking needs! Open floor plans allow you to furnish freely for your family and friends. Also, you’ll find spacious bedrooms with ample closets, not to mention that each apartment comes with abundant storage space and closets. There are handsome and durable bamboo flooring throughout, except in the bathrooms, which are tile with tile shower surrounds and granite counters. There is a dedicated laundry room on each floor.",
      "This building features super-insulated construction for extreme energy-efficiency, and continuous ventilation for superb indoor air quality. High efficiency heat-pump heating and cooling systems in each room allows you to “set it and forget it” while saving on your monthly utility bill!",
      "As for security, the Upton comes with secure entrances with intercom and remote entry system as well as security cameras throughout. There is secure covered parking on the ground floor (1 FREE SPACE FOR 1 YEAR, IF APPROVED BY 12/31/19) with indoor Bike storage (no charge). In addition, there is elevator access to all 3 floors from the parking areas, and ample exterior parking on site. Also we offer a dedicated secure package area in the lobby.",
      "We welcome your pets in our pet friendly community (pet rent charges will apply/restricted breed list/weight limits).",
      "This walkable community offers delicious restaurants, unique shopping, and plenty of entertainment venues nearby. Also, you’ll find this thriving community offers most conveniences locally yet sits in a warm and welcoming neighborhood. (Not to mention the fabulous new Urban Greens Food Co-op right next door!)",
      "Contact Kate for more information about this incredible opportunity!! Call/TEXT 450-0731 from 8AM-8PM View the floor plans, pricing, and availability on our website at www.Uptonpvd.com.",
      "THIS IS A NON-SMOKING FACILITY."
    ],
    "duplicates": []
  },
  {
    "price": "$1600",
    "title": "3 BR apartment- Newer kitchen/Bath, parking-March 1st",
    "href": "https://providence.craigslist.org/apa/d/providence-3-br-apartment-newer-kitchen/7052705187.html",
    "description": [
      "AVAILABLE MARCH 1st!",
      "Newer Modern 3 bedroom, 1 bathroom apartment. New Kitchen, New Bathroom, Refinished and New Hardwood floors, Fresh Paint.",
      "Newer kitchen with granite counters with overhang for counter stools, stainless steel appliances (including dishwasher) and large pantry.",
      "Bathroom has a beautiful vanity with cabinet storage, large modern tiles.",
      "2 of the bedrooms are good-sized. One is a little smaller but still a good size...could also be used for office/exercise room/art studio/sewing room.",
      "Just a couple blocks away from Hope St., Whole Foods, Brown, RISD, JWU and more..",
      "On the Miriam Hospital/Thayer St/Downtown Bus Route!",
      "1 off street parking spot included - additional overnight parking on the street available with resident sticker.",
      "Laundry in the basement. Also rentable lock and key storage rooms in the basement (additional fee).",
      "Pets are welcomed - dog breed cannot be on our insurance banned list (sorry). Please inquire about dog breeds prior to showing"
    ],
    "duplicates": []
  },
  {
    "price": "$3200",
    "title": "EXCEPTIONAL PROPERTY ON THE EAST SIDE OF PROVIDENCE available NOW!",
    "href": "https://providence.craigslist.org/apa/d/providence-exceptional-property-on-the/7039409805.html",
    "description": [
      "-LARGE 2,500 SQ. FT. NEWLY RENOVATED, SPACIOUS, SUNNY APARTMENT LOCATED ON THE PRESTIGIOUS EAST SIDE OF PROVIDENCE!",
      "-NEW AIR CONDITIONING AND HEATING SYSTEM AND REPLACEMENT WINDOWS!",
      "-7 ROOMS - 3 BEDROOMS with a Den",
      "- 2 full BATHS!",
      "-WELL LIT ON-PREMISES PARKING LOT. ABLE TO ACCOMMODATE 4 CARS!",
      "- 3BLOCKS FROM BROWN UNIVERSITY AND THAYER STREET",
      "-ON BUS ROUTE",
      "-MOST WELL RESPECTED LANDLORD ON THE EAST-SIDE.",
      "KEN DULGARIAN, LUXURY LANDLORD WITH OVER 40 YRS OF EXCEPTIONAL SERVICE AND COMMITMENT TO HIS CLIENTS!",
      "Go to premierprov.com for testimonials"
    ],
    "duplicates": []
  },
  {
    "price": "$990",
    "title": "wayland studio",
    "href": "https://providence.craigslist.org/apa/d/providence-wayland-studio/7052652563.html",
    "description": [
      "sunny 1st floor studio for one person",
      "1/2 block from Wayland square",
      "incl. utilities",
      "no smokers or pets",
      "no parking",
      "$990 as is",
      "first and last"
    ],
    "duplicates": []
  },
  {
    "price": "$800",
    "title": "Location is everything! This wonderful updated perfect living for you",
    "href": "https://providence.craigslist.org/apa/d/providence-location-is-everything-this/7055356571.html",
    "description": [
      "Location is everything! This wonderful updated sunny second floor unit is a short distance to Hope Street, highways, hospitals, great restaurants, downtown, and the train station. Enjoy the farmers market in the summer of the indoor market during the colder months. Hardwood floors throughout, modern bathroom, a large kitchen with granite, lots of beautiful cabinets, stainless steel appliances, space of a table to enjoy your meals. A good size living room. There is laundry in the basement (included in the rent), and assigned parking for one car. Great deck for summertime enjoyment. Please contact me for more information : bettyejhuffman (@) gmail  . com"
    ],
    "duplicates": []
  },
  {
    "price": "$700",
    "title": "East Side Apartment 1BD Available ASAP",
    "href": "https://providence.craigslist.org/apa/d/providence-east-side-apartment-1bd/7055299284.html",
    "description": [
      "Beautiful, spacious room in 3rd floor apartment available for rent on January 2. The apartment is semi furnished and it features hardwood floors, high cielings, double parlor, large kitchen with ample counter top space, gas stove and heat, dining area, spacious bath with shower and vanity, two bedrooms, and plenty of closet space. There is additional storage space and coin-operated laundry facilities in the basement.",
      "***Pictures depict First Floor, Third Floor is slightly different and is less furnished***",
      "The apartment is located in a historic & safe neighborhood located off of Benefit Street in the College Hill area of Providence. The apartment is within walking distance of the train station, downtown, Kennedy Plaza, Whole Foods market, Thayer Street, RISD, Brown University, and the Providence Place Mall. There is plenty of street parking on the road that is always easily accessible and close to the apartment.",
      "I am a young professional, 24 years old, looking for 1-2 roomates. No pets are allowed. First month's rent ($700) and security deposit ($700) due at signing. Utilities are not included, be prepared to spend between 50-100 a month (including wifi, gas, and electricity). Email or text/ call if interested,",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1950",
    "title": "June 1st,  Benefit/ Sheldon, RISD, Alpert Med School, Brown, Students",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-benefit-sheldon/7055162280.html",
    "description": [
      "- June 1, 2020",
      "- Great Location close to Alpert Med School, RISD, Brown Campus, Brown Shuttle, Pedestrian Bridge, Downtown, India Point Park, Wickenden Street, Thayer Street.",
      "-Renovated w/ Brand New Kitchen Including Dishwasher",
      "-New Paint",
      "- Spacious Bedrooms w/ Closets",
      "- Bright/ Natural light w/ Many Windows",
      "- Wood Floors Throughout",
      "- Coin-Op Laundry",
      "* Multiple units available"
    ],
    "duplicates": []
  },
  {
    "price": "$3100",
    "title": "June 1st, Thayer St.,  Brown University, RISD, Downtown.",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-thayer-st-brown/7039665677.html",
    "description": [
      "Great Location on Thayer St.!!  very close to Campus, Nelson Fitness/Athletic Facilities, Thayer shops/restaurants, downtown, train station.",
      "- June 1st",
      "-4 bedrooms",
      "-2 full baths",
      "- Coin- op Laundry",
      "- Off Street Parking",
      "-Building all Brown U. affiliated",
      "-No pets",
      "-No smoking"
    ],
    "duplicates": []
  },
  {
    "price": "$2250",
    "title": "Totally renovated 4 Bed 2 1/2 Bath Townhouse with Parking, laundry, an",
    "href": "https://providence.craigslist.org/apa/d/providence-totally-renovated-4-bed-bath/7045182138.html",
    "description": [
      "VIEW MORE PICS AND OVER 100 MORE APARTMENTS ON OUR SITE!",
      "WWW.LENOXPROPERTY.COM",
      "93 Evergreen",
      "Property Details",
      "Description: We just listed this totally renovated 4 bedroom 2 1/2 bathroom condo which is available immediately. This unit has hardwood floors throughout the unit and all of the bedrooms are very large. This condo includes parking for two cars and is spread out over 3 floors of living space and also has a full basement with a washer and dryer. There are stainless steel appliances and granite counters and the condo has central Air. Pets are allowed although breed restrictions apply and there is a 25 dollar per pet per month fee. For more information and to set up a showing please contact Lenox Realty Group",
      "show contact info",
      "Price: $ 2250",
      "Bedrooms: 4",
      "Address: 93 Evergreen",
      "City: Providence",
      "State: Rhode Island",
      "Neighborhood: East Side",
      "\";",
      "Lenox Realty Group",
      "380 Broadway",
      "Providence RI 02909",
      "WWW.LENOXPROPERTY.COM"
    ],
    "duplicates": []
  },
  {
    "price": "$2400",
    "title": "3 Bedroom apartment located on the first floor in Fox Point",
    "href": "https://providence.craigslist.org/apa/d/providence-3-bedroom-apartment-located/7045190129.html",
    "description": [
      "VIEW MORE PICS AND OVER 100 MORE APARTMENTS ON OUR SITE!",
      "WWW.LENOXPROPERTY.COM",
      "20 Governor 1st floor",
      "Property Details",
      "Description: We currently have a completely remodeled 3 Bedroom apartment which comes furnished and we are leasing unitl June 1. This apartment has a gourmet kitchen, hardwood floors throughout and includes off street parking. The unit is located on the first floor and also includes central AC. For more information contact Gabe at",
      "show contact info",
      "Price: $ 2400",
      "Bedrooms: 3",
      "Address: 20 Governor St",
      "City: Providence",
      "State: Rhode Island",
      "Neighborhood: East Side/Foxpoint",
      "\";",
      "Lenox Realty Group",
      "380 Broadway",
      "Providence RI 02909",
      "WWW.LENOXPROPERTY.COM"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$2400",
    "title": "3 Bedroom apartment located on the first floor in Fox Point",
    "href": "https://providence.craigslist.org/apa/d/providence-3-bedroom-apartment-located/7024319107.html",
    "description": [
      "VIEW MORE PICS AND OVER 100 MORE APARTMENTS ON OUR SITE!",
      "WWW.LENOXPROPERTY.COM",
      "20 Governor 1st floor",
      "Property Details",
      "Description: We currently have a completely remodeled 3 Bedroom apartment which comes furnished and we are leasing unitl June 1. This apartment has a gourmet kitchen, hardwood floors throughout and includes off street parking. The unit is located on the first floor and also includes central AC. For more information contact Gabe at",
      "show contact info",
      "Price: $ 2400",
      "Bedrooms: 3",
      "Address: 20 Governor St",
      "City: Providence",
      "State: Rhode Island",
      "Neighborhood: East Side/Foxpoint",
      "\";",
      "Lenox Realty Group",
      "380 Broadway",
      "Providence RI 02909",
      "WWW.LENOXPROPERTY.COM"
    ],
    "duplicates": []
  },
  {
    "price": "$3600",
    "title": "6 Bedroom 2 full bathroom house with washer/dryer",
    "href": "https://providence.craigslist.org/apa/d/providence-6-bedroom-2-full-bathroom/7045193428.html",
    "description": [
      "VIEW MORE PICS AND OVER 100 MORE APARTMENTS ON OUR SITE!",
      "WWW.LENOXPROPERTY.COM",
      "78 Gano St",
      "Property Details",
      "Description: We have a house with 6 bedrooms and two full bathrooms available for the 2020-2021 season starting June 1. This house has hardwood floors throughout and has a washer and dryer right in the unit. There is a large kitchen and an open floor plan. This house is only a short walk to everything and is only 600 per bedroom. For more information and to set up a showing please contact Gabe at",
      "show contact info",
      "Price: $ 3600",
      "Bedrooms: 6",
      "Address: 78 Gano St",
      "City: Providence",
      "State: Rhode Island",
      "Neighborhood: East Side/Foxpoint",
      "\";",
      "Lenox Realty Group",
      "380 Broadway",
      "Providence RI 02909",
      "WWW.LENOXPROPERTY.COM"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$3600",
    "title": "6 Bedroom 2 full bathroom house with washer/dryer",
    "href": "https://providence.craigslist.org/apa/d/providence-6-bedroom-2-full-bathroom/7026787226.html",
    "description": [
      "VIEW MORE PICS AND OVER 100 MORE APARTMENTS ON OUR SITE!",
      "WWW.LENOXPROPERTY.COM",
      "78 Gano St",
      "Property Details",
      "Description: We have a house with 6 bedrooms and two full bathrooms available for the 2020-2021 season starting June 1. This house has hardwood floors throughout and has a washer and dryer right in the unit. There is a large kitchen and an open floor plan. This house is only a short walk to everything and is only 600 per bedroom. For more information and to set up a showing please contact Gabe at",
      "show contact info",
      "Price: $ 3600",
      "Bedrooms: 6",
      "Address: 78 Gano St",
      "City: Providence",
      "State: Rhode Island",
      "Neighborhood: East Side/Foxpoint",
      "\";",
      "Lenox Realty Group",
      "380 Broadway",
      "Providence RI 02909",
      "WWW.LENOXPROPERTY.COM"
    ],
    "duplicates": []
  },
  {
    "price": "$2800",
    "title": "4 Bedroom 2 Full Bathroom 1st floor apartment on College HIll",
    "href": "https://providence.craigslist.org/apa/d/providence-4-bedroom-2-full-bathroom/7045191087.html",
    "description": [
      "VIEW MORE PICS AND OVER 100 MORE APARTMENTS ON OUR SITE!",
      "WWW.LENOXPROPERTY.COM",
      "29 Creighton 1st floor",
      "Property Details",
      "Description: We currently have a spectacular 4 Bedroom 2 Full Bathroom apartment located on the first floor in one of the nicest neighborhoods on College Hill's East Side. This apartment comes furnished although if someone wanted it unfurnished we could negotiate. The apartment was completely remodeled this year and includes parking for two cars. We are leasing it until June of next year and it is an easy show. The apartment has a gourmet kitchen, central AC and brand new everything. For more information and to set up a showing contact Gabe at",
      "show contact info",
      "Price: $ 2800",
      "Bedrooms: 4",
      "Address: 29 Creighton St",
      "City: Providence",
      "State: Rhode Island",
      "Neighborhood: East Side/College Hill",
      "\";",
      "Lenox Realty Group",
      "380 Broadway",
      "Providence RI 02909",
      "WWW.LENOXPROPERTY.COM"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$2800",
    "title": "4 Bedroom 2 Full Bathroom 1st floor apartment on College HIll",
    "href": "https://providence.craigslist.org/apa/d/providence-4-bedroom-2-full-bathroom/7024322292.html",
    "description": [
      "VIEW MORE PICS AND OVER 100 MORE APARTMENTS ON OUR SITE!",
      "WWW.LENOXPROPERTY.COM",
      "29 Creighton 1st floor",
      "Property Details",
      "Description: We currently have a spectacular 4 Bedroom 2 Full Bathroom apartment located on the first floor in one of the nicest neighborhoods on College Hill's East Side. This apartment comes furnished although if someone wanted it unfurnished we could negotiate. The apartment was completely remodeled this year and includes parking for two cars. We are leasing it until June of next year and it is an easy show. The apartment has a gourmet kitchen, central AC and brand new everything. For more information and to set up a showing contact Gabe at",
      "show contact info",
      "Price: $ 2800",
      "Bedrooms: 4",
      "Address: 29 Creighton St",
      "City: Providence",
      "State: Rhode Island",
      "Neighborhood: East Side/College Hill",
      "\";",
      "Lenox Realty Group",
      "380 Broadway",
      "Providence RI 02909",
      "WWW.LENOXPROPERTY.COM"
    ],
    "duplicates": []
  },
  {
    "price": "$1800",
    "title": "Bright/charming 2 bedroom  at Governor and Pitman",
    "href": "https://providence.craigslist.org/apa/d/providence-bright-charming-2-bedroom-at/7055149144.html",
    "description": [
      "Wonderful light-filled 2 bedroom 3rd floor apt in Wayland Square neighborhood. Corner lot, large apt offers living room, skylights, loft area, eat-in kitchen, fridge, stove, full bath, and small fenced in yard. Storage and laundry in basement, 1 car overnight parking. Beautiful hardwood floors. Convenient location- walk to Wayland Square, Brown, RISD, whole foods, and East Side Marketplace. Close to public transportation. Free washer and dryer in basement. Basement storage. Gas heat/Utilities included. Ready Feb 1st- open to 6 or 12 mo lease. No pets."
    ],
    "duplicates": []
  },
  {
    "price": "$2300",
    "title": "Downtown/ East Side Garden Apt, incl. utilities, Train, RISD",
    "href": "https://providence.craigslist.org/apa/d/providence-downtown-east-side-garden/7054862104.html",
    "description": [
      "One of a kind Garden Apartment with center fireplace, stone walls, new granite kitchen with dishwasher, 1-2 Bedrooms, 1 bath, laundry, Parking and private courtyard. Walk Downtown, walk to the train, mall, Brown and RISD. Hospitals within 5 min.  $2300 Includes heat, hot water, electric, parking , laundry. Available February 1,",
      "Gower and co Property Management.",
      "show contact info",
      "Other apartments available:",
      "3 bedroom, 2 bath Wayland Sq March 1, $2700+",
      "6 bedroom, 3 bath Town House available Wayland Sq $4500 January 15",
      "5 Bedroom House in Seekonk $5000 January 1, 2020",
      "Vacation rental - Westport MA- weekends, weekly, 6 months"
    ],
    "duplicates": []
  },
  {
    "price": "$4500",
    "title": "Spectacular renovated Townhouse with 6 BR, 3 Baths",
    "href": "https://providence.craigslist.org/apa/d/providence-spectacular-renovated/7054860588.html",
    "description": [
      "Renovated Townhouse with A new bright and sunny kitchen, Living room, full bath and office on the first floor, 6 bedrooms, a den, 2 baths on the upper floors. Refinished hardwood floors throughout, Great closets, historic details, Laundry room, full basement with Walkout, 3 car parking and walk to Brown / Wayland square. This is a must see Apartment . Available January 15, 2020. Can be Furnished. $4500+",
      "East Side 3 bedroom, 2 bath, 2200 sq Ft  Townhouse Available March 1, 2020 $2700+",
      "East Side/ College Hill 2 bedroom, 1 bath, June 1, $2500 includes heat, Hot water, Laundry, 1 car Parking"
    ],
    "duplicates": []
  },
  {
    "price": "$1995",
    "title": "Stunning renovated 2BR, 1 bath apartment with new granite countertops",
    "href": "https://providence.craigslist.org/apa/d/providence-stunning-renovated-2br-1/7044444395.html",
    "description": [
      "Stunning renovated 2BR, 1 bath apartment with new granite countertops, gleaming hardwood floors with 2 living rooms, large kitchen with a breakfast bar, butler room, refrigerator, dishwasher, disposal, microwave, separate dining room. Professionally managed property. Convenient to Brown University, Thayer St and highways. This apartment is a must see! This apartment can be furnished if needed.",
      "To see more properties rentals Click on Search on Rhode Island Properties on hhrehomes.com",
      "Listing #72583686"
    ],
    "duplicates": []
  },
  {
    "price": "$2600",
    "title": "Walk to Brown! Crate&Barrel style.  Fully furnished",
    "href": "https://providence.craigslist.org/apa/d/providence-walk-to-brown-cratebarrel/7054570180.html",
    "description": [
      "Short term lease!!!   Two or Four bed!",
      "This apartment is situated in the middle of a quiet residential neighborhood a few blocks from Brown!",
      "You literally just need to bring your clothes.  Parking, washer and dryer, Everything is brand new.  Please email James if you are interested.  Available now!",
      "30/60/90 day lease"
    ],
    "duplicates": []
  },
  {
    "price": "$1695",
    "title": "East Side Hope St FREE HOT WATER & HEAT",
    "href": "https://providence.craigslist.org/apa/d/providence-east-side-hope-st-free-hot/7046003513.html",
    "description": [
      "Are you looking for a sunny, professional atmosphere. completely renovated 2 bedroom apartment on the East Side?   You have found it!  No shoveling ...we do it.  No hot water bill...we pay it.  Heat...we pay.   Spacious open floor plan. directly across from Brown's Ladd Observatory park... (great dog walking) Garage available. convenient to everything. Amazing bagels nearby 😊 Walk to Brown U & their new state of the art athletic complex... open to all.  RISD, JWU..Hope & Thayer St. shops, cafes, restaurants. YMCA, Brown Stadium ...hospitals, grocery.  On 2 bus routes/near all major highways. 2 entrances.  Huge closets.  Open living room/kitchen.  Just renovated. Safe, spacious & sunny. Quiet/private.  Great neighbors.  A/C.",
      "2 off-street parking spaces. Laundry on site.   Just refinished oak floors,  tile & new carpet...granite counters.  Must see.  Lots of storage in apartment & on site.  Brand new stainless appliances including dishwasher.  A great place to live."
    ],
    "duplicates": []
  },
  {
    "price": "$530",
    "title": "Roommate in East Side of Providence walking to Brown",
    "href": "https://providence.craigslist.org/apa/d/providence-roommate-in-east-side-of/7054497707.html",
    "description": [
      "Looking for a roommate to share the 3-bedroom, 2-bathrooms apartment in the east side of Providence. Walking distance to Brown University, RISD, commuter train station & downtown Providence. Bus stops are right in the corner. One minute walk to the Whole Foods store, Starbucks and McDonald's. Laundry in the basement. Hardwood floor throughout.  Double parlor. Gas cooking and heating. Plenty of storage space in the basement. Parking lot in the back yard.",
      "Please call Linda at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1900",
    "title": "June 2020/ Angell St/Utilities Included/Brown & RISD/JLD",
    "href": "https://providence.craigslist.org/apa/d/providence-june-2020-angell-st/7037717503.html",
    "description": [
      "Location- Angell st",
      "Rent: $1,900 Month",
      "Beds: 2",
      "Bath: 1",
      "Available Date: 06/01/2020",
      "Pet: Pet-Friendly",
      "Parking:For Rent, Outdoor, $75.00 / Month",
      "Utilities included- Cap at $150",
      "Dishwasher",
      "Washer/Dryer provided in the basement.",
      "Jose Diaz",
      "Sales/Rentals",
      "Keller Williams",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL",
      "**Email for information on 2020-2021 Rentals. **",
      "Please contact us by email or text only"
    ],
    "duplicates": []
  },
  {
    "price": "$1400",
    "title": "Angell st/Brown & RISD/September 2020/JLD",
    "href": "https://providence.craigslist.org/apa/d/providence-angell-st-brown-risd/7037713875.html",
    "description": [
      "Location- Angell st",
      "Rent: $1,400  Month",
      "Beds: 1",
      "Bath: 1",
      "Available Date: 09/01/2020",
      "Pet: Pet-Friendly",
      "Parking: For Rent, Outdoor, $75.00 / Month",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL",
      "**Email for information on 2020-2021 Rentals. **",
      "Please contact us by email or text only"
    ],
    "duplicates": []
  },
  {
    "price": "$1800",
    "title": "June 1: Stunning 2bed Condo on Lloyd Ave....Must See!!",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1-stunning-2bed-condo/7036675478.html",
    "description": [
      "Stunning 2 bedroom apartment located on Lloyd Ave. in the heart of College Hill. Hardwood floors, fully furnished, parking included, laundry on-site, ALL utilities included. Good-sized bedrooms, good-sized living rooms, modern kitchen, modern bathroom, plenty of cabinet space. Walk to everything College Hill has to offer! Available for June 1 move-in. For more info or to schedule a showing please call/text Jeff from RentProv Realty at",
      "show contact info",
      "."
    ],
    "duplicates": [
      "6108880303"
    ]
  },
  {
    "price": "$1800",
    "title": "2 Bed- June 1, 2020- Lloyd Ave- Fully Furnished- Close to Brown",
    "href": "https://providence.craigslist.org/apa/d/providence-2-bed-june-lloyd-ave-fully/7029725937.html",
    "description": [
      "Newly listed 2 bed/1 bath located on Lloyd Ave in the East Side of Providence. Available June 1st, 2020.  Close to Brown University and RISD. Comes fully furnished. Students welcome. $1,800 with utilities included.  Walking distance to nightlife, restaurants, shopping, and so much more. Coin-operated laundry on site and off-street parking for 1 vehicle. Sorry, no pets please. 1st floor.  For more information or to schedule a showing, please email/call/text Ryan LeMay at RentProv Realty",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1250",
    "title": "2 Bed right off Hope St...Steps from Thayer...PRIME LOCATION!!!!",
    "href": "https://providence.craigslist.org/apa/d/providence-2-bed-right-off-hope-ststeps/7036671752.html",
    "description": [
      "2 bedroom apartment located right off Hope St. on the East Side of Providence. Perfect location! Walk to Thayer, Brown, RISD, and much more!! Laundry and parking included. This will not last! For more info or to schedule a showing please call/text Jeff from RentProv Realty at",
      "show contact info",
      "."
    ],
    "duplicates": [
      "6758669897"
    ]
  },
  {
    "price": "$1250",
    "title": "2 Bedroom- Available Now- East Side- Steps from Thayer",
    "href": "https://providence.craigslist.org/apa/d/providence-2-bedroom-available-now-east/7033340019.html",
    "description": [
      "NEW LISTING: Two bedroom on Carrington Ave in the beautiful East Side of Providence. Quiet dead-end road and steps away from Thayer Street. $1,250 with utilities not included. Off-street parking for 1-2 cars and laundry on site. 2nd floor. Available NOW.  Sorry, no pets please. For more information or to schedule a showing, please contact Ryan LeMay at RentProv Realty",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1250",
    "title": "L@@K NOW, Phone to See-EASTSIDE APT: WIRELESS WEB, by Request",
    "href": "https://providence.craigslist.org/apa/d/providence-lk-now-phone-to-see-eastside/7053391171.html",
    "description": [
      "A SM/\\RTH0USE™ APARTMENT Available VIEWING NOW FOR JANUARY 2020 OCCUPANCY, on The EAST SIDE -- A GREAT VALUE !",
      "PLEASE CALL or TEXT:",
      "Please FIRST Dial AREA CODE: \"915\"",
      ">>>>>>>>>>>>THEN===>>Dial \"996-1440\"",
      "To Set a Confirmed Appointment",
      "[if out of the office, please leave voicemail for a return phone call]",
      "Ask for Mr. Fox:",
      "---THANX",
      "A TWO BEDROOM Apartment {Unfurnished --OR-- Furnished By Request} AVAILABLE VIEWING-- for your JANUARY 2020 move-in...",
      ">>>> Grad Student or Professional, inside a 2 Bedroom, Non-Smoking EASTSIDE APARTMENT!",
      "NOW, ALSO AT YOUR OPTION: HI-SPEED WIRELESS NET ACCESS!!!",
      "1 1/2 Miles to the South for Rhode Island Hospital; Womens and Infants Hospital; and Hasboro Childrens Hospital; and Miriam Hospital to the North",
      "FOUR (4) Block walk to BROWN, RISD, Bookstores, Restaurants;",
      "Three (3) doors from Bus line-- Direct to BROWN, or RISD; and Downtown Hub",
      "Two (2) Blocks from Shopping Hub (STAPLES, STARBUCKS, WHOLE FOODS, PETCO, SPRINT, SANTANDER BANK, etc.)",
      "1/2 Block from Park, Running Track, Tennis Courts",
      "Two (2) Blocks from Indoor Basketball Court, YMCA {Work-out Gym, Swimming Pool}",
      "1 1/2 Miles from Public Library, Citizens Bank, Bank of America, STOP & SHOP, HOME DEPOT, WALMART;",
      "FIVE (5) Blocks from Neighborhood Police Station",
      "One (1) Mile from Providence Train Station and Providence Mall;",
      "Hard Wood Floors; Shaded Porch; Storage;",
      "Private, Off-Street Parking Spaces;",
      "Sunny, southern exposure;",
      "Gas Heat;",
      "Laundry available;",
      "Best Quality, High-Tech, Triple-Pane, Winter-Proof Windows;",
      "And YES, You understood correctly:",
      "ALSO>>> INCLUDES (optional) HIGH-SPEED WIRELESS INTERNET ACCESS!!",
      "PLEASE CALL or TEXT:",
      ">>>>>>>>>>>>>>>>>>>>>>>>>>>>Please",
      ">>>>>FIRST Dial AREA CODE: \"915\"",
      ">>>>>>>>>>>>THEN===>>Dial \"996-1440\"",
      "To Set a Confirmed Appointment",
      "[if out of the office, please leave voicemail for a return phone call]",
      "Ask for Mr. Fox:",
      "YOU MUST INCLUDE NAME & USA PHONE NUMBER(S) WITH ALL LEFT MESSAGES.",
      "---THANK YOU, again."
    ],
    "duplicates": []
  },
  {
    "price": "$3200",
    "title": "Fully furnished East Side Townhouse",
    "href": "https://providence.craigslist.org/apa/d/providence-fully-furnished-east-side/7047706225.html",
    "description": [
      "Amazing, sunny, centrally located East Side apartment.",
      "- 2000+ square feet of living space split between 2nd and 3rd floors of building.",
      "- heat, hot water, electricity, and high speed internet included",
      "- southern exposure provides sunshine throughout the day",
      "- 2 parking spots. 1 covered spot in a detached garage. 1 uncovered.",
      "- 5 bedrooms",
      "- 2 full bathrooms, one fully renovated in 2018 with oversized tub and marble floor with in-floor radiant heating.",
      "- private washer and dryer in the basement",
      "- ample storage space in the basement"
    ],
    "duplicates": []
  },
  {
    "price": "$1200",
    "title": "NEWLY RENOVATED ONE BEDROOM IN WAYLAND  HEAT & HOT WATER INCLUDED",
    "href": "https://providence.craigslist.org/apa/d/providence-newly-renovated-one-bedroom/7053284201.html",
    "description": [
      "NEWLY RENOVATED SECOND FLOOR ONE BEDROOM APARTMENT IN THE HEART OF WAYLAND SQUARE. FEATURES GLEAMING HARDWOOD FLOORS, TILED KITCHEN WITH GRANITE COUNTER AND ALL NEW STAINLESS APPLIANCES INCLUDING DISHWASHER. BATHROOM HAS FULLY TILED OVERSIZED SHOWER. TONS OF CLOSET SPACE. RENT INCLUDES HEAT AND HOT WATER PLUS ONE OF STREET PARKING SPACE COIN-OP LAUNDRY AND EXTRA PRIVATE BASEMENT STORAGE.",
      "$1200 MONTHLY, AVAILABLE NOW. CALL KAREN MILLER FOR MORE INFORMATION AND TO SET UP A VIEWING."
    ],
    "duplicates": []
  },
  {
    "price": "$1800",
    "title": "Fox Point, 3 Bedroom 2nd floor, June 2020",
    "href": "https://providence.craigslist.org/apa/d/providence-fox-point-3-bedroom-2nd/7053077975.html",
    "description": [
      "Located in trendy Fox Point neighborhood this sun filled 2nd floor 3 bedroom apartment is located at end of Young Orchard, 3 blocks from Brown campus. Over 1100sf clean apartment has new windows, gas heat, eat-in kitchen, living room, laundry facilities & a great attentive landlord!  Available June 1 @ $1800 monthly plus utilities.  Garage storage for bikes and parking included. No smoking."
    ],
    "duplicates": []
  },
  {
    "price": "$1950",
    "title": "Thayer st Location/Main green/Brown/2020",
    "href": "https://providence.craigslist.org/apa/d/providence-thayer-st-location-main/7036455697.html",
    "description": [
      "Location-Thayer st",
      "Rent: $1,950  Month",
      "Beds: 2",
      "Bath: 1",
      "Available Date: 06/01/2020",
      "Pet: Pet-Friendly",
      "Rent Includes: Electricity, Heat, Gas, Hot Water- Cap at $150",
      "Parking:For Rent, Outdoor, $75.00 / Month",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL",
      "**Email for information on 2020-2021 Rentals. **",
      "Please contact us by email or text only"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1950",
    "title": "on Thayer/Brown & RISD/Main green/2020-2021/JLD",
    "href": "https://providence.craigslist.org/apa/d/providence-on-thayer-brown-risd-main/7019875950.html",
    "description": [
      "Location- Thayer st",
      "Rent: 1950  Month",
      "Beds: 2",
      "Bath: 1",
      "Available Date: 06/01/2020",
      "Pet: Pet-Friendly",
      "Rent Includes: Electricity, Heat, Gas, Hot Water-Cap at $150",
      "Parking: For Rent (Outdoor)$75",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL",
      "**Email for information on 2020-2021 Rentals. **",
      "Please contact us by email or text only"
    ],
    "duplicates": []
  },
  {
    "price": "$1900",
    "title": "397 Hope #1. 3 Bed 1 Bath Apartment. $1,900",
    "href": "https://providence.craigslist.org/apa/d/providence-397-hope-1-3-bed-1-bath/7048243247.html",
    "description": [
      "Located in the College Hill area of Providence, this 1st floor apartment is in a great location. Walking distance to Tortilla Flats, East Side YMCA, Moses Brown School, Hope High School, and minutes from Thayer Street which has shops and restaurants all around. Brand new washer/dryer in basement, hardwood floors throughout, new appliances, plenty of storage throughout, and a front porch. Can be furnished or unfurnished.",
      "-3 Bedroom",
      "-1 Bathroom",
      "-No Utilities Included",
      "-Sorry No Pets",
      "-Laundry in the Basement",
      "-Parking for 2",
      "Available January 15th!!",
      "Call/Text Jared from RentProv Realty for more information or to schedule a showing!!",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$530",
    "title": "1 BR in sunny 3 BR apartment",
    "href": "https://providence.craigslist.org/apa/d/providence-1-br-in-sunny-3-br-apartment/7052522328.html",
    "description": [
      "A room is available in the three bedroom apartment from January 1 - August 31st. These dates are very flexible depending on your availability and preference.",
      "Here are some of the details:",
      "- Rent is $530 (utilities not included)",
      "-Two considerate and friendly roommates. One is a graduate student at Brown, the other a young working professional.",
      "-Free off-street parking is included. This lot is also plowed by the property manager in the event of snow.",
      "-Laundry in building",
      "-One block from Whole Foods, McDonald's, Starbucks, Liquor Store, Gym, and Rebelle Bakery",
      "-Close to Brown and RISD (20 minute walk, 5 minute drive)",
      "-Lots of natural lighting",
      "-Gorgeous hardwood floors and spacious apartment",
      "-Shared bathroom with one other person."
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$530",
    "title": "1 BR Apartment",
    "href": "https://providence.craigslist.org/apa/d/providence-1-br-apartment/7042911549.html",
    "description": [
      "A room is available in a 3 bedroom apartment from January 15 - August 31st. These dates are very flexible depending on your availability and preference.",
      "Here are some of the details:",
      "- Rent is $530 (utilities not included)",
      "-Two considerate and friendly roommates. One is a graduate student at Brown, the other a young working professional.",
      "-Free off-street parking is included. This lot is also plowed by the property manager in the event of snow.",
      "-Laundry in building",
      "-One block from Whole Foods, McDonald’s, Starbucks, Liquor Store, Gym, and Rebelle Bakery",
      "-Close to Brown and RISD (20 minute walk, 5 minute drive)",
      "-Lots of natural lighting",
      "-Gorgeous hardwood floors and spacious apartment",
      "-Shared bathroom with one other person."
    ],
    "duplicates": []
  },
  {
    "price": "$1875",
    "title": "June 1, 2020- 3 Bedroom- East Side- Students Welcome- Hope Street",
    "href": "https://providence.craigslist.org/apa/d/providence-june-bedroom-east-side/7035751803.html",
    "description": [
      "June 1, 2020: Newly listed 3 bedroom rental on Hope Street in the East Side area of Providence. Students welcome. $1,875 with utilities not included. Off-street parking for 2 and laundry on site.  1st floor.  Don't wait, contact for a showing today. For more information or to schedule a showing, please email/call/text Ryan LeMay at RentProv Realty",
      "show contact info",
      "Check out my other June rentals: http://www.ryanlemay.com/students-1.html"
    ],
    "duplicates": []
  },
  {
    "price": "$1250",
    "title": "NOW L@@K @ EASTSIDE APT-- Call to See: with WIRELESS WEB Opt",
    "href": "https://providence.craigslist.org/apa/d/providence-now-lk-eastside-apt-call-to/7039383278.html",
    "description": [
      "TELEPHONE for APPOINTMENT to SEE A SM/\\RTH0USE™ APARTMENT Available & FOR VIEWING NOW for a JANUARY 2020 move-in, on The EAST SIDE -- A GREAT VALUE",
      "PLEASE CALL or TEXT:",
      "Please FIRST Dial AREA CODE: \"915\"",
      ">>>>>>>>>>>>THEN===>>Dial \"996-1440\"",
      "To Set a Confirmed Appointment",
      "[if out of the office, please leave voicemail for a return phone call]",
      "Ask for Mr. Fox:",
      "---THANX",
      "Two Bedroom Apartment {Unfurnished --OR-- Furnished By Request}--  AVAILABLE to VIEW IMMEDIATELY --for your -- JANUARY 2020 OCCUPANCY!!",
      "YOU MUST INCLUDE NAME & USA PHONE NUMBER(S) WITH ALL LEFT MESSAGES TO RECEIVE A PROMPT TELEPHONE REPLY, AS ALL APPOINTMENTS ARE SET OVER THE PHONE-- ONLY.",
      ">>>> Grad Student or Professional, inside a 2 Bedroom, Non-Smoking EASTSIDE APARTMENT!",
      "NOW, Optional: HI-SPEED WIRELESS NET ACCESS!",
      "1 1/2 Miles to the South for Rhode Island Hospital; Womens and Infants Hospital; and Hasboro Childrens Hospital; and Miriam Hospital to the North",
      "FOUR (4) Block walk to BROWN, RISD, Bookstores, Restaurants;",
      "Three (3) doors from Bus line-- Direct to BROWN, or RISD; and Downtown Hub",
      "Two (2) Blocks from Shopping Hub (STAPLES, WHOLE FOODS, SPRINT, PETCO, SANTANDER BANK, STARBUCKS, etc.)",
      "1/2 Block from Park, Running Track, Tennis Courts",
      "Two (2) Blocks from Indoor Basketball Court, YMCA {Work-out Gym, Swimming Pool}",
      "1 1/2 Miles from Public Library, Citizens Bank, Bank of America, STOP & SHOP, HOME DEPOT, WALMART;",
      "FIVE (5) Blocks from Neighborhood Police Station",
      "One (1) Mile from Providence Train Station and Providence Mall;",
      "Hard Wood Floors; Shaded Porch; Storage;",
      "Private, Off-Street Parking Spaces;",
      "Sunny, southern exposure;",
      "Gas Heat;",
      "Laundry available;",
      "Best Quality, High-Tech, Triple-Pane, Winter-Proof Windows;",
      "And YES, You understood correctly:",
      "ALSO INCLUDES AT YOUR OPTION: HIGH-SPEED WIRELESS INTERNET ACCESS!!",
      "YOU MUST INCLUDE NAME & USA PHONE NUMBER(S) WITH ALL LEFT MESSAGES",
      "TO RECEIVE A PROMPT TELEPHONE REPLY-- AS ALL APPOINTMENTS ARE ONLY SET OVER THE PHONE.",
      "---THANK YOU.",
      "CALL or TEXT Mr. Fox: >>>>>>>>>>>>>>>>Please FIRST",
      ">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>Dial AREA CODE: \"915\"",
      ">>>>THEN===>>Dial \"996-1440\"",
      "To Set a Confirmed Appointment",
      "[please, if out of the office, leave voicemail to receive a return phone call]",
      "Thank you."
    ],
    "duplicates": []
  },
  {
    "price": "$1990",
    "title": "All Utilities Included Nice 2 BR Near Brown",
    "href": "https://providence.craigslist.org/apa/d/providence-all-utilities-included-nice/7048579069.html",
    "description": [
      "2 BEDROOMS | 1 BATHROOMS",
      "All Utilities Included!\n\nAvailable Now!\n\nThis 2 bedroom apartment is located in East Side. Walk to Brown University and Wayland Square. Nice location!\n\nAvailable now! Nice and large 2 bedroom apartment. Two levels (first and 2nd floor), with beautiful hardwood floor, nice kitchen with stainless steel appliances, with dishwasher. Large bedroom with closets. It has free laundry at the basement. Nice backyard and off the street parking. \n\nNO Pets Allowed\nNO Smoking\n\nCall or text me",
      "show contact info",
      "Criminal background and credit check required."
    ],
    "duplicates": []
  },
  {
    "price": "$2800",
    "title": "June 2020! 4 BR/ 1 1/2 BA Near Brown & Thayer St",
    "href": "https://providence.craigslist.org/apa/d/providence-june-br-ba-near-brown-thayer/7048582050.html",
    "description": [
      "Available June 1, 2020.\nAccepting Lease Now!\n\nNice 4 bedroom apartment, spacious, bright, hardwood floor. Big kitchen and tiled bathroom.\n\nLaundry in the basement (coin-operated) and off street parking.\n\nPlease call or text",
      "show contact info",
      ".",
      "***Cats Allowed***"
    ],
    "duplicates": []
  },
  {
    "price": "$1350",
    "title": "All Utilities Included Beautiful 1 BR Near Eastside!",
    "href": "https://providence.craigslist.org/apa/d/providence-all-utilities-included/7048585665.html",
    "description": [
      "1 BEDROOMS | 1 BATHROOMS",
      "All Utilities Included! Nice and large 1 BR Apartment near East Side. \nAll utilities included!\n\nNice location and close to highways.\nBeautiful and large one bedroom apartment. High ceilings beautiful hardwood floor, nice kitchen with dishwasher. bedroom.\n\nThis is a must see apartment. \n\nhttp://turbo.rent/s/97108p (copy and search this link to view some photos)\n\nPlease call or text",
      "show contact info",
      "NO dogs please!\n\nWe do credit and criminal background  check.",
      "***Cats Allowed"
    ],
    "duplicates": []
  },
  {
    "price": "$2000",
    "title": "Newly Renovated Townhouse",
    "href": "https://providence.craigslist.org/apa/d/providence-newly-renovated-townhouse/7048318576.html",
    "description": [
      "Be the first to live in this newly renovated townhouse. Located in the Summit neighborhood within walking distance to Hope Village shops, restaurants, Miriam Hospital, and a local park with farmer's market - this is one of the Eastside's favorite neighborhoods. Step inside to sun-filled open space with gleaming hardwoods and a fresh neutral decor. Fully renovated kitchen feature stainless appliances, quartz countertops and white cabinetry. The second floor features two bedrooms, a nursery/office and renovated baths with quartz vanities and new fixtures. The basement is finished and includes in-unit washer/dryer.",
      "The house is available immediately and length of lease is negotiable."
    ],
    "duplicates": []
  },
  {
    "price": "$1750",
    "title": "College Hill-Providence Furn Apt;Near Brown/RISD;w/PARKING & UTILITIES",
    "href": "https://providence.craigslist.org/apa/d/providence-college-hill-providence-furn/7051187176.html",
    "description": [
      "Very quiet and Private, light-filled spacious 2nd floor 1 bedroom apartment [1,100 sq ft - 3 rooms and bath] located on College Hill, less than 10 minute walk to RISD and Brown University Campus Green. Apartment overlooks gardens.  Cast iron woodstove in living area. Only one apartment in owner-occupied residential building. Private entrance in rear of 18th century historic brick house in highly desirable residential neighborhood. Lots of closets and storage; fire escape; and no-charge shared washer-dryer. Within easy walking distance to restaurants and shopping.",
      "Parking, heat and all utilities included in rent.",
      "Off-street parking for one vehicle is immediately adjacent to apartment entrance.",
      "Apartment is fully furnished [just bring your tooth brush].",
      "Apartment is legal. No smoking. No Cats. No Dogs.",
      "Location - 97 Williams Street between Benefit and Thayer Streets.",
      "Available immediately."
    ],
    "duplicates": []
  },
  {
    "price": "$895",
    "title": "Like new 3 bed- Income guidelines apply- ready to ove in!",
    "href": "https://providence.craigslist.org/apa/d/providence-like-new-3-bed-income/7035153781.html",
    "description": [
      "Like new 3 bedroom, 1 bath unit in desirable M. Pleasant! THIS IS A 3RD FLOOR UNIT",
      "This unit features:",
      "New heating, new windows, energy efficient appliances, gas heat, central air, washer and dryer on location, parking (1 space), dry basement storage, spacious rooms, stainless steel appliances, custom kitchens.",
      "The rent is based on HUD income guidelines for the HOME program. We have a low limit and high limit. Please have income information when calling.",
      "This is a NON SMOKING building.",
      "No pets",
      "Please email with the following information :",
      "Number of occupants?",
      "Household income amount ( total of all working members of family)?",
      "Pets?",
      "Rental History/How long have you lived at your current location?",
      "Reason for moving?",
      "Do you Any Evictions?",
      "No email will be returned unless all required information is included."
    ],
    "duplicates": []
  },
  {
    "price": "$1500",
    "title": "3-4 month lease for Renovated apartment by Brown! Stainless & Granite",
    "href": "https://providence.craigslist.org/apa/d/providence-3-4-month-lease-for/7036275565.html",
    "description": [
      "Rare find. Gorgeous 2 bedroom 1 bathroom newly renovated apartment by Brown University and a block from Hope Street! Complete with granite counter tops and stainless appliances, this amazing and spacious apartment is two blocks from 7 star bakery and hope street ! Huge living room and combined kitchen with new hardwood floors. New stone and tile bathrooms with rain shower ! Looking for at least a 6 month lease (spring lease) but willing to negotiate. This place just finished renovations and will go fast at $1600! Looking for spring semester students, grad students and professionals.",
      "Available December 18th, first person with 1st month and 1 month security gets it !",
      "Next to Miriam Hospital, Wickenden street, by college hill, rhode island hospital, brown university hasbro children's hospital and downtown. It can be rented furnished for an additional cost"
    ],
    "duplicates": []
  },
  {
    "price": "$1750",
    "title": "Charming Colonial w Loft-Style Master, 2.5 Bath,Yard~Locale",
    "href": "https://providence.craigslist.org/apa/d/providence-charming-colonial-loft-style/7037645406.html",
    "description": [
      "Beautiful Colonial home features Full kitchen, open floor, plenty of windows pour in plenty of natural light, Large bedrooms, 2.5 Baths, Loft-style Master bedroom offers  vaulted ceilings, Walk in closet, and Full Master bathroom. Gas heat, Washer and Dryer for convenience, Yard for summer enjoyment, Located on a dead end street in residential Fruit Hill, North Providence.",
      "Call Martha, Pyramid Realty Inc at",
      "show contact info",
      "for more information or to schedule a showing."
    ],
    "duplicates": []
  },
  {
    "price": "$1250",
    "title": "EASTSIDE Apt- CALL to Set Appt, Option>HIGH-SPEED WIRELESS-SHOWING NOW",
    "href": "https://providence.craigslist.org/apa/d/providence-eastside-apt-call-to-set/7044021051.html",
    "description": [
      "Come VIEW A GREAT VALUE-- THIS SM/\\RTH0USE™ APARTMENT here, on The EAST SIDE!",
      "PLEASE CALL or TEXT:",
      "Please FIRST Dial AREA CODE: \"915\"",
      ">>>>>>>>>>>>THEN===>>Dial \"996-1440\"",
      "To Set a Confirmed Appointment",
      "[if out of the office, please leave voicemail for a return phone call]",
      "Ask for Mr. Fox:",
      "---THANX",
      ">> VIEWING NOW for moving in JANUARY 2020.",
      "YOU SECURE YOUR OCCUPANCY WITH RECEIPT OF FULL DEPOSIT & and an APPLICATION Approved COMMITMENT To a SEASONAL Lease!!",
      "YOU MUST INCLUDE NAME & USA PHONE NUMBER(S) WITH ALL LEFT MESSAGES TO RECEIVE A PROMPT TELEPHONE REPLY.",
      "ALL APPOINTMENTS FOR VIEWING ARE SET ONLY OVER THE PHONE;",
      "---THANK YOU",
      ">>>>>>>>>>>>>>>>>>>>>Please Call OR Text Mr. Fox:",
      ">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>Please FIRST Dial AREA CODE: \"915\"",
      ">>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>THEN===>>Dial \"996-1440\",",
      "To Set an Appointment",
      "[if out of the office, please leave voicemail for a return phone call]",
      ">>>> Ideal accommodations for Grad Student or Professional, inside a 2 Bedroom, Non-Smoking EASTSIDE APARTMENT!",
      "IMMEDIATE VIEWING of a Two Bedroom Apartment {Unfurnished --OR-- Furnished By Request}-- AVAILABLE FOR an JANUARY 2020 move-in date!!",
      ">>>NOW, AT YOUR OPTION: HIGH-SPEED WIRELESS INTERNET ACCESS!",
      "1 1/2 Miles to the South for Rhode Island Hospital; Womens an Infants Hospital; and Hasboro Childrens Hospital; and Miriam Hospital to the North",
      "FOUR (4) Block walk to BROWN, RISD, Bookstores, Restaurants;",
      "Three (3) doors from Bus line-- Direct to BROWN, or RISD; and Downtown Hub",
      "Two (2) Blocks from Shopping Hub (STAPLES, WHOLE FOODS, STARBUCKS, PETCO, SANTANDER BANK, SPRINT, etc.)",
      "1/2 Block from Park, Running Track, Tennis Courts",
      "Two (2) Blocks from Indoor Basketball Court, YMCA {Work-out Gym, Swimming Pool}",
      "1 1/2 Miles from Public Library, Citizens Bank, Bank of America, STOP & SHOP, HOME DEPOT, WALMART;",
      "FIVE (5) Blocks from Neighborhood Police Station",
      "One (1) Mile from Providence Train Station and Providence Mall;",
      "Hard Wood Floors; Shaded Porch; Storage;",
      "Private, Off-Street Parking Spaces Available;",
      "Sunny, southern exposure;",
      "Gas Heat;",
      "Laundry available;",
      "Best Quality, High-Tech, Triple-Pane, Winter-Proof Windows;",
      "And YES, You understood correctly:",
      "ALSO INCLUDES Optional HIGH-SPEED WIRELESS INTERNET ACCESS!!",
      "YOU MUST INCLUDE NAME & USA PHONE NUMBER(S) WITH ALL LEFT MESSAGES TO RECEIVE A PROMPT TELEPHONE REPLY.",
      "ALL VIEWING APPOINTMENTS ARE ONLY SET OVER THE PHONE;",
      "---THANX",
      "Call or Text Mr. Fox:",
      "Please FIRST Dial AREA CODE: \"915\"",
      "THEN===>>Please Dial \"996-1440\"",
      "To Set  a Confirmed Appointment",
      "[also, if out of the office, please leave voicemail for a return phone call]"
    ],
    "duplicates": []
  },
  {
    "price": "$1100",
    "title": "400 Angell St/$1100per bdr/Util Incl/Avail June 1, 2020",
    "href": "https://providence.craigslist.org/apa/d/providence-400-angell-st-1100per-bdr/7036054417.html",
    "description": [
      "*Available June 01, 2020",
      "*Semester Rentals or One-year leases",
      "*Renting individual bedrooms",
      "*$1100/mo. - 1st, 2nd, or 3rd floor bedroom.   Bathroom shared with one other tenant.",
      "*Common areas include dining room, living room and kitchen",
      "*Utilities included",
      "*Walking distance to Blackstone Boulevard, Wayland Square, Brown University",
      "*Washer/Dryer on site",
      "*Dishwasher",
      "*Great location on the East Side of Providence",
      "*Off-street parking available",
      "*Hardwood floors throughout",
      "*www.walterbronhardrealestate.net",
      "*To schedule a personal tour, please call us today",
      "at",
      "show contact info",
      "or click on the REPLY box above"
    ],
    "duplicates": []
  },
  {
    "price": "$3300",
    "title": "189 Angell St./LUXURY/3Bdrm/$3300/mo/Avail June 1, 2020",
    "href": "https://providence.craigslist.org/apa/d/providence-189-angell-st-luxury-3bdrm/7036072265.html",
    "description": [
      "*Available June 1, 2020",
      "*3 Bedroom unit",
      "*$3300/mo",
      "*Walking distance to Blackstone Boulevard, Wayland Square, Brown University and R.I.S.D",
      "*Washer/Dryer in unit",
      "*Dishwasher",
      "*WIFI included",
      "*Great location on the East Side of Providence",
      "*Hardwood floors throughout",
      "*www.walterbronhardrealestate.net",
      "*Email  wlbrealestate@gmail for more info",
      "*please call us today at",
      "show contact info",
      "or click on the REPLY box above"
    ],
    "duplicates": []
  },
  {
    "price": "$3000",
    "title": "339-343 Thayer Street/3 bdrm/$3000/Avail June 2020",
    "href": "https://providence.craigslist.org/apa/d/providence-thayer-street-3-bdrm-3000/7042029573.html",
    "description": [
      "*Available June 1, 2020",
      "*3 bedrooms/1bath - $3000/mo.",
      "*Hardwood Flooring",
      "*Located on the east side walking distance to BROWN University",
      "*WIFI & Utilities included",
      "*Charming apartment",
      "*Quick walk to Brown",
      "*www.walterbronhardrealestate.net",
      "*Email wlbrealestate@gmail for more information",
      "*Please Call our Leasing agent",
      "show contact info",
      "for showings"
    ],
    "duplicates": []
  },
  {
    "price": "$2200",
    "title": "324 Angell St/2 bdrm/$2200/Available July 2020",
    "href": "https://providence.craigslist.org/apa/d/providence-324-angell-st-2-bdrm-2200/7045382580.html",
    "description": [
      "*Available July 1, 2020",
      "*Washer/Dryer on site",
      "*Applianced",
      "*Small Pet Friendly",
      "*Walking distance to BROWN",
      "*Call us today at",
      "show contact info",
      "or",
      "click on the REPLY box above",
      "*Email:  wlbrealestate@gmail for more info",
      "*Photo may be of similar unit in the building"
    ],
    "duplicates": []
  },
  {
    "price": "$500",
    "title": "Available Room w/ Walk-in in Big, Beautiful Shared House",
    "href": "https://providence.craigslist.org/apa/d/providence-available-room-walk-in-in/7050399876.html",
    "description": [
      "This room is a 12x12ft bedroom with an adjoined 8x10ft second room/walk-in closet; available March 1st, 2020 (or potentially earlier if mutually agreeable). The room is on the 3rd floor of a large house, which is owned by the landlord, and shared by 5 other roommates. It is a hassle-free place to live with trustworthy roommates, a dependable landlord, and a very reasonable price.",
      "Current roommates are young professionals and graduate students, all in their mid-20's. The household is well maintained and cared for, but still very relaxed and reasonable. Visitors are welcomed, but never excessive or unruly - when parties occur, it is a group decision . Everyone comes together as a household nicely, but remain independent for the most part... and just as a disclaimer, this is not a co-op home.",
      "The location of the house is wonderful. It is two doors down from the Billy Taylor Park; in walking distance from Whole Foods, Thayer St, Hope Artisan Village, Lippitt Park, and Blackstone Blvd; accessible to multiple bus lines in 1-3 block radius; and easy access to I-95 by car.",
      "- 2 Full bathrooms",
      "- Coin-op laundry in basement",
      "- Parking Space available",
      "- Gas stove",
      "- Full size and mini Refrigerator",
      "- Dish washer",
      "- 2nd Story balcony",
      "- Small backyard",
      "- No pets in the house (although a cat could be negotiable with landlord and roommates)",
      "WiFi, Gas, and Electric not included in rent, but range from $40-$75/month throughout the year.",
      "The room will be rented unfurnished; however, there are many items I am happy to leave in the room if desired (i.e. bed and/or bed-frame, desk, dresser, small pull-out couch, and others). Additionally, the rest of the house is furnished, but does have space for more items if so desired.",
      "I am moving because of taking a job out-of-state, but otherwise I wouldn't see any reason to leave this home - truly a great place to live. That said, I will be showing the room/house whenever convenient. Call, text, or email and I am happy to schedule a showing."
    ],
    "duplicates": []
  },
  {
    "price": "$1595",
    "title": "Beautiful Apartment for Rent in Wayland Square",
    "href": "https://providence.craigslist.org/apa/d/providence-beautiful-apartment-for-rent/7050272011.html",
    "description": [
      "Luxury apartments remodeled offer new kitchens, exposed bricks, accent walls in certain apartments and common areas, updated electric and hard wired central alarm, energy efficient heating and air conditioning in units, new windows, and 10 ft high ceilings. In addition:",
      "-coins op washers and dryers in basement",
      "-no pets policy",
      "-parking available for $85.00/month",
      "Lease Details: owner pays for trash, sewer, water and hot water. tenant pays for electric bill."
    ],
    "duplicates": []
  },
  {
    "price": "$1000",
    "title": "beautiful apartment off Hope st",
    "href": "https://providence.craigslist.org/apa/d/providence-beautiful-apartment-off-hope/7050187042.html",
    "description": [
      "Beautiful East Side Apartment, quiet location off Hope Street. Large 1 bedroom with  living room, dining room, kitchen, hardwood floors.  Amenities include parking, porch, yard, washer/dryer.  New windows & furnace.  Great location, walk to restaurants, shops, Miriam Hospital. Available end of January.  Call Kristin at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1400",
    "title": "ONE-BEDROOM APARTMENT IN HISTORIC HOUSE",
    "href": "https://providence.craigslist.org/apa/d/providence-one-bedroom-apartment-in/7050051782.html",
    "description": [
      "One-bedroom apartment in owner-occupied historic house in Summit neighborhood on the East Side. Free laundry and off-street parking for one car. Approx. 600 square feet. Large backyard and deck. One block from farmers market, Blackstone Boulevard, bus stop; three blocks from Miriam Hospital; easy walk to Hope Street shops and restaurants. $1400 (includes heat, hot water, electric). Available February or March 1."
    ],
    "duplicates": []
  },
  {
    "price": "$1600",
    "title": "2 Bedroom Off Blackstone Blvd - Providence East Side",
    "href": "https://providence.craigslist.org/apa/d/providence-2-bedroom-off-blackstone/7049698018.html",
    "description": [
      "This is a newly renovated, fully furnished, third floor apartment with 2 bedrooms and lots of natural light. It is located in a beautiful, quiet neighborhood in an owner occupied home within walking distance of Wayland Square. It offers hardwood floors, a modern kitchen with new stainless steel appliances and equipped with all necessities, a remodeled bathroom with glass door walk-in shower and new full-sized front-loading washer and dryer (not coin-operated) in the basement. It can be configured as two bedrooms or one bedroom and an office (as desired by the tenant). There are two large storage rooms and lots of closets. All utilities (water/heat/ac/electricity and high speed wi-fi) are included."
    ],
    "duplicates": []
  },
  {
    "price": "$1350",
    "title": "Fantastic, 3 Bed, Immaculate, Parking Great Location",
    "href": "https://providence.craigslist.org/apa/d/providence-fantastic-3-bed-immaculate/7044661285.html",
    "description": [
      "Nurses, Grad Students, Med Students  Near Miriam 3 bed AAA",
      "Totally Renovated - Must See - Immaculate",
      "Gorgeous, 3 bedroom 2nd Floor",
      "Parking lot with - never blocked in feature",
      "Near Restaurants, Walgreens, Shopping, Schools, few minutes to Downtown",
      "Bus line",
      "Gorgeous Hardwoods - Sanded and Varnished",
      "New pantry, New Kitchen Floor, and New bathroom",
      "Gas Heat  New Double pane Vinyl Windows= Low Utilities",
      "A Must See. Fantastic Apartment",
      "Sorry, No Pets allowed",
      "Nice people with good references only need to apply."
    ],
    "duplicates": []
  },
  {
    "price": "$1099",
    "title": "2bed/1bath**step away from great schools, parks & hospita",
    "href": "https://providence.craigslist.org/apa/d/providence-2bed-1bathstep-away-from/7049552958.html",
    "description": [
      "Popular location and style make this a winning combination! Side by side duplex provides separate entries with three season porches... Located in the Summit neighborhood within walking distance to Hope Village shops, restaurants and a local park with farmer's market this is one of the Eastside's favorite neighborhoods. Step inside to sunfilled open space with gleaming hardwoods and a fresh neutral decor. Fully renovated kitchens feature stainless appliances, quartz countertops and white cabinetry..a sitting room/office and renovated baths with quartz vanities and new fixtures. A great opportunity to have space with privacy..",
      "Popular location and style make this a winning combination! Side by side duplex provides separate entries with three season porches... Located in the Summit neighborhood within walking distance to Hope Village shops, restaurants and a local park with farmer's market this is one of the Eastside's favorite neighborhoods. Step inside to sunfilled open space with gleaming hardwoods and a fresh neutral decor. Fully renovated kitchens feature stainless appliances, quartz countertops and white cabinetry..a sitting room/office and renovated baths with quartz vanities and new fixtures. A great opportunity to have space with privacy..",
      "Popular location and style make this a winning combination! Side by side duplex provides separate entries with three season porches... Located in the Summit neighborhood within walking distance to Hope Village shops, restaurants and a local park with farmer's market this is one of the Eastside's favorite neighborhoods. Step inside to sunfilled open space with gleaming hardwoods and a fresh neutral decor. Fully renovated kitchens feature stainless appliances, quartz countertops and white cabinetry..a sitting room/office and renovated baths with quartz vanities and new fixtures. A great opportunity to have space with privacy.."
    ],
    "duplicates": []
  },
  {
    "price": "$850",
    "title": "Welcome home to this wonderful East Side apartment.",
    "href": "https://providence.craigslist.org/apa/d/providence-welcome-home-to-this/7049074077.html",
    "description": [
      "Welcome home to this wonderful East Side apartment. This second floor unit features a spacious living room and dining area. The lovely private deck off the kitchen is perfect to sip your morning coffee or to dine al fresco in the evenings. Featuring two large bedrooms with ample storage space. Meticulously maintained common areas and extra storage and FREE laundry in the lower level. One off street space is included in the rent. Tenant pays utilities. This is a wonderful place to call home!"
    ],
    "duplicates": []
  },
  {
    "price": "$625",
    "title": "ROOM FOR RENT IN LUXURY EAST SIDE APARTMENT",
    "href": "https://providence.craigslist.org/apa/d/providence-room-for-rent-in-luxury-east/7049082011.html",
    "description": [
      "This is 4 bedrooms, 2 baths apartment very near to Brown University. I’m a recent alum and my roommates are current graduate students. We’re pretty friendly, laid back folks who like to have fun every now and then, so you can expect some excitement.",
      "The apartment is super nice, spacious, and already furnished. Campus is only 0.8 miles away and Whole Foods is also just an 8 minute walk.",
      "Amenities include:",
      "- Central air and heating",
      "- Free Laundry",
      "- Gym in the basement",
      "Rent is $625/month for the empty room, not including utilities.",
      "Move in February 1st."
    ],
    "duplicates": []
  },
  {
    "price": "$3150",
    "title": "Euclid st/Brown/furnished & utilities/2020-2021",
    "href": "https://providence.craigslist.org/apa/d/providence-euclid-st-brown-furnished/7032710355.html",
    "description": [
      "Location- Euclid",
      "Rent: $3,150 Month",
      "Beds: 2",
      "Bath: 1",
      "Available Date: 06/01/2020",
      "Pet: Pet-Friendly",
      "Rent Includes: Electricity, Gas, Hot Water- Cap at $200",
      "Parking: For Rent, Outdoor, $75.00 / Month",
      "**Email for information on 2020-2021 Rentals. **",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL",
      "Please contact us by email or text only"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$3100",
    "title": "Brown/Near thayer st/2020-2021/JLD",
    "href": "https://providence.craigslist.org/apa/d/providence-brown-near-thayer-st-jld/7018721334.html",
    "description": [
      "Location- Euclid st",
      "Rent: $3100  Month",
      "Beds: 2",
      "Bath: 1",
      "Available Date: 06/01/2020",
      "Pet: Pet-Friendly",
      "Rent Includes: Electricity, Gas, Hot Water",
      "Parking: For Rent (Outdoor)$75",
      "Laundry in Unit",
      "**Email for information on 2020-2021 Rentals. **",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL",
      "**Email for information on 2020-2021 Rentals. **",
      "Please contact us by email or text only"
    ],
    "duplicates": []
  },
  {
    "price": "$1650",
    "title": "Beautiful 2 bed/Ready June/Summit/East Side",
    "href": "https://providence.craigslist.org/apa/d/providence-beautiful-2-bed-ready-june/7056680148.html",
    "description": [
      "Beautiful two bedroom, one bathroom first floor apartment ready to rent come June. Located in the Summit neighborhood. Steps away from Mariam hospital, Summer's Farmer's markets at Lippitt park, and Blackstone Blvd. Near to Brown University, RISD, and easy highway access. Comes with private washer and dryer in basement. Hardwood floor, dishwasher, large eat in kitchen, one bathroom, living room, and two bedrooms. Off street parking available. Shared backyard with patio. Pets considered. Ready June."
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$3200",
    "title": "Fox Pt./East Side/SF house/ June 1st",
    "href": "https://providence.craigslist.org/apa/d/providence-fox-pt-east-side-sf-house/7046990155.html",
    "description": [
      "Ready June 1st",
      "4 bedrooms, 1 and half bathrooms, kitchen, dinning room, living room, and basement with washer and dryer included in your rent. Yard, and off street parking for about four vehicles.",
      "Professionally managed property.",
      "Near Brown University and RISD located in Fox Point's East Side neighborhood.",
      "Contact through email and please tell me about yourself.",
      "Tenants pay their own gas heat and electric.",
      "Hardwood floors  throughout and tile in bathrooms.",
      "Ready June 1st",
      "$3,200.00 a month."
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1095",
    "title": "Large apartment, off Hope, 5 rms, 2 bed",
    "href": "https://providence.craigslist.org/apa/d/providence-large-apartment-off-hope-5/7059087404.html",
    "description": [
      "East Side: new price, $1095 large apartment, double parlor! Near all East Side conveniences: Hope St restaurants, Farmers Market and Blackstone Blvd, Whole Foods, Garden Grille, LA Fitness etc! This apartment has double parlor with hardwood floors throughout, kitchen, full bath, parking.  Available now. It is sunny and bright, new heat, newer appliances, recent paint. Nice yard.",
      "Easy to show call Owner/manager:",
      "show contact info"
    ],
    "duplicates": [
      "4828116310"
    ]
  },
  {
    "price": "$3200",
    "title": "STUNNING 2 floor penthouse-2000 sf, 2 BR, 2.5 Bath- ALL NEW",
    "href": "https://providence.craigslist.org/apa/d/providence-stunning-2-floor-penthouse/7058908520.html",
    "description": [
      "FLEXIBLE MOVE IN DATE- Immediate, Feb 1, March 1, or April 1.",
      "WOW! NEW 2 BR 2 floor luxury penthouse apartment on Sheldon St - one of the most desired streets in Providence to live on in Fox Point / East Side!",
      "-2 Floors",
      "-2000 square feet",
      "-Energy efficient, insulated building (rare in PVD)",
      "-Central A/C and heating",
      "-Private deck",
      "-Key-less entry",
      "-Private dining room",
      "-Eat-in Kitchen with counter overhang for stools",
      "-Stunning Master Bedroom w/3 closets and large master bathroom w/ soaker tub",
      "-In-unit washer and dryer",
      "The penthouse apartment incorporates the top 2 floors (2nd and 3rd) of the building, boasts hardwood floors, large modern tile in the bathrooms and original wrap around staircases.",
      "Large kitchen open to an even larger living room. The kitchen is fully-appointed with stainless steel appliances, commercial range hood, wine fridge, modern cabinets, granite, island with overhang for seating, USB outlets, recessed and pendants lighting, and a dining area.",
      "Enjoy Penthouse living with a HUGE Master Suite with 3 large closets - including a walk-in! Large Master Bathroom with Granite Double Vanity, Modern Freestanding Soaker tub to relax in and separate shower with Frameless Glass Shower Door!",
      "Second large bedroom has its own private bathroom and large double door closet.",
      "Large 1/2 bath on the lower level where you can enjoy the convenience of in-unit laundry with a brand new energy-efficient washer and high-end dryer with steam settings!",
      "Sunny South Facing Private deck off the back to sit and enjoy morning coffee or relax and have a drink after work!",
      "New energy efficient heating and A/C system.",
      "The renovations have still maintained the original charm of the area but with a modern twist. Apartment located on a quiet neighborhood, but still only steps from Wickenden St. shops and restaurants while still having easy access to I-95, I-195, walk to India Point Park and the East Bay bike path. Close to Brown, RISD and JWU."
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1100",
    "title": "FIRST TIME RENTERS WELCOME, CLOSE TO BROWN, J&W, BUTLER, RI HOSPITAL",
    "href": "https://providence.craigslist.org/apa/d/first-time-renters-welcome-close-to/7058708618.html",
    "description": [
      "PLEASE READ ENTIRE AD BEFORE CALLING,",
      "LGBT COMMUNITY WELCOME, FIRST TIME RENTERS WELCOME.",
      "EXCELLENT LANDLORDS. QUIET, CLEAN, SAFE BUILDINGS.",
      "YOU'VE SEEN THE REST, NOW SEE THE BEST!!!",
      "VERY QUIET AND PRIVATE, FANTASTIC OPPORTUNITY, MUST SEE YOU WON'T BE DISAPPOINTED. ENTIRE FLOOR ALL TO YOURSELF",
      "102-104 Ives street",
      "4th floor",
      "2 bed",
      "Fox point/East side Providence",
      "$1100 for a couple",
      "Extra for 3rd person",
      "no utilities,",
      "two parking spots on the premise",
      "desirable location,",
      "great for med students, faculty, interns, nurses, professionals, couples, grad students. Professors",
      "right between fox point and the east side,",
      "must see take a ride by.",
      "close to Brown, RISD, Johnson and wales, Butler, RI hospital",
      "on trolley line, and walking distance close to parks, shopping and restaurants",
      "great view, very private and quiet, unique",
      "Available Now, be in by the holidays",
      "next to Noodles 102 and PVD Donuts",
      "2 large carpeted bedrooms",
      "huge multi-functional kitchen, open floor plan, skylights",
      "full bathroom large storage space",
      "clean quiet building",
      "one mature fixed cat optional, absolutely no dogs",
      "on trolley line",
      "coin op laundry",
      "great for grad students/faculty/professionals",
      "must have good references",
      "FIRST TIME RENTERS CONSIDERED!!!!",
      "12 MONTH LEASE, 1ST MONTH AND SECURITY DEPOSIT REQUIRED",
      "TAKE A RIDE BY AND CHECK IT OUT!!!",
      "SERIOUS INQUIRES BY APPOINTMENT ONLY, CAN BE SHOWN WITH ONLY A FEW HOURS NOTICE!!!!",
      "PLEASE CALL MICHAEL",
      "show contact info",
      "7 DAYS A WEEK PLUS HOLIDAYS UP TO MIDNIGHT NO EMAILS",
      "ALL CALLS RETURNED"
    ],
    "duplicates": [
      "6224087590",
      "6225548424"
    ]
  },
  {
    "price": "$1000",
    "title": "Quiet, Great Location, Walking Distance to Restaurants and Shops",
    "href": "https://providence.craigslist.org/apa/d/providence-quiet-great-location-walking/7055331270.html",
    "description": [
      "7 Governor Street, Providence, RI. $1000 a month, sunny, and quiet. Great location  Two bedrooms, 2nd floor. Eat-in Kitchen, spacious Living room.  No pets, no utilities, one year rental agreement, one parking spot, on bus route trolly 92, walking distance to Great Restaurants, Bars, shops, and India point park, walk to RISD, and Brown. Serious inquiry only Call",
      "show contact info",
      "ask for Tony NO TEXTING!"
    ],
    "duplicates": [
      "4292373017"
    ]
  },
  {
    "price": "$1450",
    "title": "Hardwoods. INC HEAT. Wayland Square. SAMSON REALTY 3542",
    "href": "https://providence.craigslist.org/apa/d/providence-hardwoods-inc-heat-wayland/7058438899.html",
    "description": [
      "About This Property:",
      "Affordable two bedroom apartment in Wayland Square!  Includes heat and hot water.  Hardwoods throughout.  Nice clean space.  Sunny.   Coin Laundry in the building. Parking for 1 car available for $50/mo.",
      "__________________________________________________________________________________________________________________",
      "To make an appointment or for more information please call our office at",
      "show contact info",
      ". We specialize in residential rentals in Providence, in most of Rhode Island, and nearby Massachusetts. We have a large selection of apartments, condos, and houses available for rent.",
      "Thank You.",
      "LISTING CODE: 3542    samsoneastside",
      "Call Our Office:",
      "show contact info",
      "S",
      "amsonRealty.com",
      "WALK-INS WELCOME",
      "Samson Realty",
      "346 Wickenden St.",
      "Providence, RI  02903",
      "listing identification 3542279206509233.8490805472343628425373644518855066752896490436634773777168466392062330025684874086759072465350855780721254974943805577358801302550505560906802473312637764691575204752"
    ],
    "duplicates": [
      null,
      null,
      "7037665026",
      "7037651221",
      "6991909840",
      "6633439519",
      "6974753599",
      "6906592161",
      "6952936315",
      "6952931402",
      null,
      null,
      "6727190453",
      null,
      null,
      "7031360615",
      "7011327451",
      "6991023683",
      "6825427871",
      "7009399247",
      "6987664129",
      "7009375272",
      "6703584987",
      "6987660455",
      "6987660455",
      "6987682918",
      "7010033800",
      "7005420946",
      null,
      "7006035774",
      "6984609937",
      "6984652026",
      "6955803657",
      "6981951622",
      "6461604614",
      "7022362893",
      "7022345482",
      "7022992784",
      "7001435833"
    ]
  },
  {
    "price": "$3400",
    "title": "2020-2021/Barnes st/Brown & RISD/JLD",
    "href": "https://providence.craigslist.org/apa/d/providence-barnes-st-brown-risd-jld/7051518894.html",
    "description": [
      "Location- Barnes st",
      "Rent: $3,400 Month",
      "Beds: 4",
      "Bath: 3",
      "Available Date: 06/01/2020",
      "Pet: No Pets",
      "Central Air",
      "Dishwasher",
      "Laundry in Unit",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL"
    ],
    "duplicates": [
      null,
      null
    ]
  },
  {
    "price": "$2700",
    "title": "Updated apartment near Brown University/Jose L Diaz KW",
    "href": "https://providence.craigslist.org/apa/d/providence-updated-apartment-near-brown/7051521162.html",
    "description": [
      "Location- Angell st",
      "Bedrooms: 3",
      "Bathrooms: 2",
      "Rent: $2700",
      "Deposit: $2700",
      "Square Footage: 1200",
      "Pets Allowed: No",
      "Lease Term: 1 year /06/01/2020",
      "Laundry in unit",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL"
    ],
    "duplicates": [
      null,
      null,
      null
    ]
  },
  {
    "price": "$2100",
    "title": "Cozy & Gorgeous New 2Bd, 1-1/2ba Cottage w/ Laundry, Parking, A/C",
    "href": "https://providence.craigslist.org/apa/d/providence-cozy-gorgeous-new-2bd-1-1/7056234608.html",
    "description": [
      "Awesome new single family cottage next to all the great shops and restaurants/",
      "All new everything:",
      "From the foundation to the roof, every wall, ceiling, floor, insulation, electrical, plumbing, super high efficiency heating and A/C....",
      "The Oak floors, a gorgeous new solid wood kitchen with built-in microwave, 5 burner gas stove and 1.5 beautiful new baths, there's a/c, laundry in unit, and a dining area separate from the kitchen.",
      "2nd floor has 2 bedrooms and a full bath, and lots of closet space throughout.",
      "Walk to everything while you live in this beautiful place.",
      "Fabulous walk-able neighborhood with lots to do and easy highway access.",
      "This is a quiet house with no parties, no students, and NO SMOKING.",
      "Professionally managed.",
      "We are pet friendly, as long as you have a quiet, well behaved pet.",
      "We cannot accept aggressive animals or breeds prohibited by the insurance company.",
      "Small fees apply: $150 one time pet fee and $15/month pet rent.",
      "The rent is $2,200/month and the lease has a reward clause for those who pay on time before noon on the 1st of the month, deduct $100 making the rent $2,100/month.",
      "The water, sewer and trash pick up are included in the rent.",
      "The gas and electric are separately metered and your cost is based on your usage.",
      "That should be very modest as everything is new and efficient and insulated.",
      "Applicants should have excellent credit and verifiable rental and employment histories.",
      "1 month deposit is due with the submission of your application to hold the place off the market while we check your references.",
      "Upon approval that will become your security deposit.",
      "If you are not accepted, your check will be voided and a picture of the voided check texted to you.",
      "To set up a time to view this place, please TEXT your Name and apartment code #29D (so we know which place you are inquiring about) to",
      "show contact info",
      "Let us know several days and times that would work for you to meet and see the place.",
      "The house is available starting February 1st as the 1st resident needs to move.",
      "Thanks so much for your interest and we look forward to hearing from you.",
      "Happy House Hunting!"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1150",
    "title": "PRIME EAST SIDE LOCATION: 1 bedroom MASTERPIECE w/ HEAT+HW++ INCLUDED!",
    "href": "https://providence.craigslist.org/apa/d/providence-prime-east-side-location-1/7041739394.html",
    "description": [
      "1 bedroom apartment w/ HEAT, HW & COOKING GAS INCLUDED!",
      "PRIME location! Quick walk to BROWN & RISD!",
      "Perfectly located in the EAST SIDE OF PROVIDENCE off Angell, Waterman & Wickenden. Walking distance to everything on the Brown University campus, RISD & the hospitals!",
      "*** This apartment can come fully furnished with a VERY nice queen-size bed, couch, and kitchen table! *** If you don't want the furniture, that is no problem at all. The furniture is offered to you for free but is completely optional!",
      "Laundry & plenty of safe, off-street parking in the parking lot!",
      "READY FOR YOU TO MOVE IN!!! *** FLEXIBLE lease! *** FLEXIBLE!",
      "Please call me right now at",
      "show contact info",
      "to discuss & to schedule an appointment to view! SHOWING TODAY!",
      "show contact info"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$2385",
    "title": "$2385 / 3br - 1200ft on Arnold/Benefit RISD/Brown",
    "href": "https://providence.craigslist.org/apa/d/providence-br-ft-on-arnold-benefit-risd/7057780808.html",
    "description": [
      "1rd floor 3BR apartment available in house on prime block on College Hill. Location is great for Brown and RISD students, especially RISD ID and Architecture. 5 min walk to Wickenden St and 10 min walk downtown over new bridge. Great restaraunts and coffee just a block or two away by foot.",
      "Currently occupied by Brown Students. Great for 3 people.",
      "Spacious and updated rooms. Updated gourmet kitchen with granite counter island and view of downtown, dishwasher, stove, countertops, sink, etc. Updated tile bath. Monitored alarm and smoke detectors system. Coin laundry (new dryer) and personal private storage lockers in basement.",
      "Private back yard and driveway parking (5 spots shared with other housemates) available.",
      "Plenty of storage room in basement. Each bedroom has their own personal storage locker in basement, Windows have been updated for efficiency and house has recently fully insulated. All 3 apartments are on separate meters and have separate heating systems, allowing each group to individually track expenses. Exterior of house was recently entirely renovated, insulated and painted. The house is professionally landscaped and maintained.",
      "This is our 18th year anniversary in the house and we have had many very happy tenants over the years. Happy to share references.",
      "Available June 1, 2020. Lease term is 1 year June 1 - May 31. We are open to a 2 year lease.",
      "We are not professional landlords. This is our only property, and we will look for students that have good references and that will take good care of the house.",
      "If you are interested, please contact us.",
      "Dimitry Herman"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1675",
    "title": "Furnished 2 bed - East Side",
    "href": "https://providence.craigslist.org/apa/d/providence-furnished-2-bed-east-side/7054813436.html",
    "description": [
      "Completely furnished bright, airy 2 bed, 2nd floor with laundry in unit, dishwasher, beautiful porch, off Street one car parking and Street permit parking. Walk to Brown, bus, Hope Street shops. All utilities included- heat, gas, electric and WiFi.",
      "Photos speak to condition! Available 2/1/20"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1900",
    "title": "READY FOR IMMEDIATE MOVE! EAST SIDE- FREE PARKING",
    "href": "https://providence.craigslist.org/apa/d/ready-for-immediate-move-east-side-free/7051081032.html",
    "description": [
      "New construction at its finest! a young 22-unit luxury apartment building nestled in the desirable Hope section of Providence. This creative area is minutes to universities, hospitals, highways, and shopping!",
      "This building features super-insulated, double stud wall construction for extreme energy efficiency, superb indoor air quality, and elegant studio, one, & two bedroom apartments. All the units feature modern architect designed kitchens and bathrooms, generous living spaces, off-street parking, floor to ceiling windows, and did we mention that it's steps from the East Side?",
      "Well designed kitchen features stainless steel appliance package with granite counter tops, dishwasher, microwave with vented hood for all your cooking needs! Trendy ceramic tile back-splash accents the granite and the stainless steel making this kitchen a true showpiece!!",
      "Open floor plan allows all the comforts to your family and friends. The light from the floor to ceiling windows illuminates the unit with light and sweeps it with warm air! Spacious and cozy bedrooms deliver generous closets; large windows welcoming sunlight an fresh morning breezes!",
      "This unit shines with bamboo flooring throughout, custom lighting, and calming paint colors. Tile bath with tub/stall shower and granite counters.",
      "Building features: Secure entry with intercom and remote entry system, access to fitness room and comfy lobby with FREE WIFI. A dedicated indoor bike room, package room, and elevator access to all 4 floors. Ample exterior parking for additional vehicles and guests. A dedicated laundry area on site.",
      "We welcome your pets in our pet friendly community ( pet rent charges will apply/restricted breed list). High efficiency heat-pump heating and cooling system in each room allows you to control temperatures where needed. Did we already mention the iconic EAST SIDE?",
      "This walkable community offers delicious restaurants, unique shopping, and magnificent entertainment. This thriving community offers all the conveniences locally yet nestled in a warm welcoming neighborhood.",
      "Contact Kate for more information about this incredible opportunity!!",
      "show contact info",
      "from 8AM-8PM View the floor plans and pricing on our website at www.101-Hillside.com."
    ],
    "duplicates": [
      null,
      null
    ]
  },
  {
    "price": "$2400",
    "title": "3 Bedroom apartment located on the first floor in Fox Point",
    "href": "https://providence.craigslist.org/apa/d/providence-3-bedroom-apartment-located/7045190129.html",
    "description": [
      "VIEW MORE PICS AND OVER 100 MORE APARTMENTS ON OUR SITE!",
      "WWW.LENOXPROPERTY.COM",
      "20 Governor 1st floor",
      "Property Details",
      "Description: We currently have a completely remodeled 3 Bedroom apartment which comes furnished and we are leasing unitl June 1. This apartment has a gourmet kitchen, hardwood floors throughout and includes off street parking. The unit is located on the first floor and also includes central AC. For more information contact Gabe at",
      "show contact info",
      "Price: $ 2400",
      "Bedrooms: 3",
      "Address: 20 Governor St",
      "City: Providence",
      "State: Rhode Island",
      "Neighborhood: East Side/Foxpoint",
      "\";",
      "Lenox Realty Group",
      "380 Broadway",
      "Providence RI 02909",
      "WWW.LENOXPROPERTY.COM"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$3600",
    "title": "6 Bedroom 2 full bathroom house with washer/dryer",
    "href": "https://providence.craigslist.org/apa/d/providence-6-bedroom-2-full-bathroom/7045193428.html",
    "description": [
      "VIEW MORE PICS AND OVER 100 MORE APARTMENTS ON OUR SITE!",
      "WWW.LENOXPROPERTY.COM",
      "78 Gano St",
      "Property Details",
      "Description: We have a house with 6 bedrooms and two full bathrooms available for the 2020-2021 season starting June 1. This house has hardwood floors throughout and has a washer and dryer right in the unit. There is a large kitchen and an open floor plan. This house is only a short walk to everything and is only 600 per bedroom. For more information and to set up a showing please contact Gabe at",
      "show contact info",
      "Price: $ 3600",
      "Bedrooms: 6",
      "Address: 78 Gano St",
      "City: Providence",
      "State: Rhode Island",
      "Neighborhood: East Side/Foxpoint",
      "\";",
      "Lenox Realty Group",
      "380 Broadway",
      "Providence RI 02909",
      "WWW.LENOXPROPERTY.COM"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$2800",
    "title": "4 Bedroom 2 Full Bathroom 1st floor apartment on College HIll",
    "href": "https://providence.craigslist.org/apa/d/providence-4-bedroom-2-full-bathroom/7045191087.html",
    "description": [
      "VIEW MORE PICS AND OVER 100 MORE APARTMENTS ON OUR SITE!",
      "WWW.LENOXPROPERTY.COM",
      "29 Creighton 1st floor",
      "Property Details",
      "Description: We currently have a spectacular 4 Bedroom 2 Full Bathroom apartment located on the first floor in one of the nicest neighborhoods on College Hill's East Side. This apartment comes furnished although if someone wanted it unfurnished we could negotiate. The apartment was completely remodeled this year and includes parking for two cars. We are leasing it until June of next year and it is an easy show. The apartment has a gourmet kitchen, central AC and brand new everything. For more information and to set up a showing contact Gabe at",
      "show contact info",
      "Price: $ 2800",
      "Bedrooms: 4",
      "Address: 29 Creighton St",
      "City: Providence",
      "State: Rhode Island",
      "Neighborhood: East Side/College Hill",
      "\";",
      "Lenox Realty Group",
      "380 Broadway",
      "Providence RI 02909",
      "WWW.LENOXPROPERTY.COM"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1800",
    "title": "June 1: Stunning 2bed Condo on Lloyd Ave....Must See!!",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1-stunning-2bed-condo/7036675478.html",
    "description": [
      "Stunning 2 bedroom apartment located on Lloyd Ave. in the heart of College Hill. Hardwood floors, fully furnished, parking included, laundry on-site, ALL utilities included. Good-sized bedrooms, good-sized living rooms, modern kitchen, modern bathroom, plenty of cabinet space. Walk to everything College Hill has to offer! Available for June 1 move-in. For more info or to schedule a showing please call/text Jeff from RentProv Realty at",
      "show contact info",
      "."
    ],
    "duplicates": [
      "6108880303"
    ]
  },
  {
    "price": "$1250",
    "title": "2 Bed right off Hope St...Steps from Thayer...PRIME LOCATION!!!!",
    "href": "https://providence.craigslist.org/apa/d/providence-2-bed-right-off-hope-ststeps/7036671752.html",
    "description": [
      "2 bedroom apartment located right off Hope St. on the East Side of Providence. Perfect location! Walk to Thayer, Brown, RISD, and much more!! Laundry and parking included. This will not last! For more info or to schedule a showing please call/text Jeff from RentProv Realty at",
      "show contact info",
      "."
    ],
    "duplicates": [
      "6758669897"
    ]
  },
  {
    "price": "$1950",
    "title": "Thayer st Location/Main green/Brown/2020",
    "href": "https://providence.craigslist.org/apa/d/providence-thayer-st-location-main/7036455697.html",
    "description": [
      "Location-Thayer st",
      "Rent: $1,950  Month",
      "Beds: 2",
      "Bath: 1",
      "Available Date: 06/01/2020",
      "Pet: Pet-Friendly",
      "Rent Includes: Electricity, Heat, Gas, Hot Water- Cap at $150",
      "Parking:For Rent, Outdoor, $75.00 / Month",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL",
      "**Email for information on 2020-2021 Rentals. **",
      "Please contact us by email or text only"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$530",
    "title": "1 BR in sunny 3 BR apartment",
    "href": "https://providence.craigslist.org/apa/d/providence-1-br-in-sunny-3-br-apartment/7052522328.html",
    "description": [
      "A room is available in the three bedroom apartment from January 1 - August 31st. These dates are very flexible depending on your availability and preference.",
      "Here are some of the details:",
      "- Rent is $530 (utilities not included)",
      "-Two considerate and friendly roommates. One is a graduate student at Brown, the other a young working professional.",
      "-Free off-street parking is included. This lot is also plowed by the property manager in the event of snow.",
      "-Laundry in building",
      "-One block from Whole Foods, McDonald's, Starbucks, Liquor Store, Gym, and Rebelle Bakery",
      "-Close to Brown and RISD (20 minute walk, 5 minute drive)",
      "-Lots of natural lighting",
      "-Gorgeous hardwood floors and spacious apartment",
      "-Shared bathroom with one other person."
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$3150",
    "title": "Euclid st/Brown/furnished & utilities/2020-2021",
    "href": "https://providence.craigslist.org/apa/d/providence-euclid-st-brown-furnished/7032710355.html",
    "description": [
      "Location- Euclid",
      "Rent: $3,150 Month",
      "Beds: 2",
      "Bath: 1",
      "Available Date: 06/01/2020",
      "Pet: Pet-Friendly",
      "Rent Includes: Electricity, Gas, Hot Water- Cap at $200",
      "Parking: For Rent, Outdoor, $75.00 / Month",
      "**Email for information on 2020-2021 Rentals. **",
      "Jose L Diaz",
      "REALTOR",
      "Keller Williams",
      "Cell",
      "show contact info",
      "JOSEDREALTY@GMAIL",
      "Please contact us by email or text only"
    ],
    "duplicates": [
      null
    ]
  }
]