[
  {
    "price": "$750",
    "title": "Bright and Spacious 2 Bedroom Apartment with HEAT INCLUDED",
    "href": "https://providence.craigslist.org/apa/d/providence-bright-and-spacious-2/7058413899.html",
    "description": [
      "Bright and Spacious 2 Bedroom Apartment with HEAT INCLUDED! Great Federal Hill and West Side Location between Westminster and Broadway, Walkable to Downtown and many fantastic restaurants and businesses, 1st Floor, tandem off-street parking. Immediate Availability.",
      "Would love to schedule a time to come view",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$3500",
    "title": "June 1st 2020- 2021 | East Side | Brown University | 5 Bed Townhouse",
    "href": "https://providence.craigslist.org/apa/d/providence-june-1st-east-side-brown/7052742169.html",
    "description": [
      "Newly listed 5 Bedroom townhouse rental in beautiful East Side of Providence. Located on Hidden Street, this 2 floor townhouse will be avaialble for move-in on June 1st, 2020. RARE! Close to Brown University and RISD. Can be rented as 5 or 6 bedrooms. 2 bathrooms. Students welcome.  $3,500 for 5 people or $3,600 for 6 people.  Amazing deal and very spacious.  Hardwoods throughout and laundry in-unit. Off-street parking also available for 2+. Pets negotiable. Showings starting already, please email/call/text Ryan LeMay at RentProv Realty",
      "show contact info",
      "Check out my other June rentals: http://www.ryanlemay.com/students-1.html"
    ],
    "duplicates": []
  },
  {
    "price": "$2300",
    "title": "Downtown/ East Side Garden Apt, incl. utilities, Train, RISD",
    "href": "https://providence.craigslist.org/apa/d/providence-downtown-east-side-garden/7054862104.html",
    "description": [
      "One of a kind Garden Apartment with center fireplace, stone walls, new granite kitchen with dishwasher, 1-2 Bedrooms, 1 bath, laundry, Parking and private courtyard. Walk Downtown, walk to the train, mall, Brown and RISD. Hospitals within 5 min.  $2300 Includes heat, hot water, electric, parking , laundry. Available February 1,",
      "Gower and co Property Management.",
      "show contact info",
      "Other apartments available:",
      "3 bedroom, 2 bath Wayland Sq March 1, $2700+",
      "6 bedroom, 3 bath Town House available Wayland Sq $4500 January 15",
      "5 Bedroom House in Seekonk $5000 January 1, 2020",
      "Vacation rental - Westport MA- weekends, weekly, 6 months"
    ],
    "duplicates": []
  },
  {
    "price": "$1200",
    "title": "Downtown Studio Condo- Granite Kit, C-Air, High Ceilings ~Location",
    "href": "https://providence.craigslist.org/apa/d/providence-downtown-studio-condo/7046109453.html",
    "description": [
      "Luxury Studio Loft Boasts High Ceilings, Granite Kitchen, Large Windows pour in tons of natural light, Secured entry, elevator for convenience. Central Air and Laundry for Convenience. Exceptional Views.  Live in the Heart of Downtown Providence. Amazing Location on Washington Street Steps to theatre, restaurants, shops, Mall and Schools.",
      "Call/text Martha at",
      "show contact info",
      ", Pyramid Realty Inc for more Information or to schedule a showing."
    ],
    "duplicates": []
  },
  {
    "price": "$550",
    "title": "newly remodeled! 2 bedrooms 2 baths home for rent",
    "href": "https://providence.craigslist.org/apa/d/providence-newly-remodeled-2-bedrooms-2/7046676073.html",
    "description": [
      "\n            \n            \nrent to own this 2 bedrooms 2 baths home. hardwoods in the downstairs living areas. kitchen with all appliances including washer and dryer. 2 bedrooms are upstairs each with a private bath room and walk-in closet.",
      "For More Information About This Listing:",
      "w",
      "w",
      "w",
      ".",
      "Rent2finder",
      ".",
      "c",
      "o",
      "m",
      "$$$ OPORTUNIDADES DE EMPLEO $$$\nCompañía establecida en Houston desde el año 2001 y en continua expansión esta Contratando personal INMEDIATAMENTE y ofrece oportunidades de trabajos en estos siguientes departamentos:\n\n1.Departamento de Relaciones Publicas: (El idioma Inglés NO es Requisito)\nSalario Fijo de $3500 a $4500 x Mes.\n\n2.Analista de Agua/Water Analyst (El idioma Inglés NO es Requisito)\nSalario Fijo $4000 x Mes.\n\n3.Departamento de Servicio al Cliente: (Bilingüe)\n$10.00 a $12.50 x Hora + Otros Beneficios.\n\n4.Deptarmatento Administrativo (Bilingüe)\n$10.00 a $12.50 x Hora + Otros Beneficios.\n\n5.Departamento de Ventas (El idioma Inglés NO es Requisito)\n$75,000 a $100,000 x año (El Salario es negociable dependiendo de la Experiencia)\n\n6.Tele-Operadora (El idioma Inglés NO es Requisito)\n$300.00 x Semana / Trabajo desde Casa. \n\n7.Encuestadores (El idioma Inglés NO es Requisito)\n$500.00 x Semana \n\nREQUISITOS PARA TODAS LAS POSICIONES:\n1.Graduado de High School.\n2.Interes sincero en ayudar a otras personas.\n3.Honesto, Muy Buena Actitud , saber Automotivarse y habilidad para trabajar No estando bajo supervisión.\n\nBENEFICIOS:\n*Ingresos Fijos.\n*Vacaciones Pagadas.\n*Programa de Vehículo.\n*Entrenamiento Pagado.\n*Excelente Ambiente de Trabajo.\n*Oportunidad de Ascensos de acuerdo con sus habilidades.\n\nSOLO si califica de acuerdo a los requerimientos mencionados, envíe UN MENSAJE DE TEXTO con su NOMBRE COMPLETO y en respuesta le enviaremos la Dirección donde necesita presentarse para una entrevista y los horarios disponibles.\n\nWould you like to enjoy beautiful sunrises and sunsets. Our very affordable southern new jersey getaway is the right property for you. Our property is located in hideaway beach campground. Our closest shorepoint is the very beautiful town of stone harbor. This is a unique campground in that you own your property and are not subject to constant rent increases. Our property is almost completely maintenance free. You can sleep up to 8 and this community is gated by an electronic gate only accessible to owners. A lot of the existing furniture and appliances will stay. Our yearly costs are approximately $4,000 - $4,500. It is very difficult to afford a week at the shore for the cost of having complete ownership. Asking price is $81,900. Property is in immaculate condition with many upgrades and amenities.  Two bedroom plus den double-wide on quiet cul-de-sac available in port orange, florida - in pickwick village (off clyde morris blvd across from the port orange police station) just 15 minutes from the beach and 6 miles to daytona racetrack. Master bedroom has a 3/4 bath and walk-in closet, and the 2nd bedroom has a walk-in closet too. The open den can used as a tv room or home office or could be converted into a 3rd bedroom with the addition of a door. A dining ell off the living room leads past the side entry to the galley kitchen. The side entry opens to the covered car port (deep enough for 2 cars) with the laundry hook-up in the shed at the back. On the opposite side of the house is the large florida room with front entry. Appliances include ceiling fans in living room and both bedrooms, electric stove, refrigerator, dishwasher, new food disposal and newer central air conditioning. Pickwick village is an adult retirement community with a community swimming pool and community center with exercise equipment, pool table, residents library, coin laundry, kitchen and other amenities. Lot rental is $593/month, not including integrated billing for basic cable tv, water, sewer and trash pick up; lawn maintenance is included.  Situated at the bottom of skyline only past the high school tennis courts, this attractively remodeled city home is only a brief walk from the shore and all of that downtown laguna offers! Luxurious updates include laminate and tile floors throughout, shaker style kitchen cabinets, granite counter tops tops with extended breakfast bar open into the living room, both bedrooms on lower level with private interior laundry. Exterior features large private balcony overlooking community rear yard lined with fruit, cherry and citrus trees, and terrace with bbq and fire pit. Fantastic place for both enjoyable and experience!! Residents at huntington continental embrace the idyllic beach-town life. And only a few minutes away from the pier, main street and meadowlark golf club, huntington continental places you near all the area’s greatest attractions. Make the most of your leisure time by biking along the shore or discovering coveted local food at eateries. At the end of each day, come home to the peaceful and verdant apartment community of huntington continental. Choose your home from roomy, well-designed one and two bedroom apartment floor plans featuring a huge balcony or deck, spacious closets, and ceiling fans. Unwind in our swimming pool and barbecue area, and get to know the residents of this small, tight-knit community. Latitude apartment homes for rent is located in orange county close to main place mall, circle of orange, chapman college, ingram micro, city of tustin and orange.  In the santa ana district the community offers easy freeway access to I-55, 22 and the 5 freeways.  The one, two and three bedroom floor plans feature some of the most peaceful living spaces in north santa ana, california.  Our apartment homes include recently renovated interiors with wood flooring*, stainless steel stoves, stainless steel dishwashers, washer and dryer* and 2 tone paint.  Residents are invited to relax in the pool and enjoy free wi-fi in common areas. ❤️🚚❤️❤️😍rent my truck $60.Cheap moving 24/7  model perfect single level house with no association on the most peaceful private end of cul-de-sac lot in whaler's cove. Little over a mile to the beach, pacific city, downtown. Ocean breezes. Filled with natural light from all its windows, 15 ft vaulted ceiling in living & master. Kitchen with breakfast nook & breakfast bar opens to dining & living room & has been remodeled with led recessed lighting, solid wood cabinetry, roll outs, granite counters & bosch stainless steel appliances. Living room with its voluminous ceiling has a large modern wood burning (or gas) fireplace with tile surround. Living room & master bedroom open to an easy care wrap around yard with patios, grass & beautiful plants. Master suite has vaulted ceiling, two large closets plus linen cabinets, room for king size bed, dresser & reading chair. Master bath has 2 sinks, granite counters & shower. Second bedroom is separate from mater suite & has a large closet, bath with tub/shower and vanity with granite counter. Coat closet plus custom linen cabinet are just off the hall to the secondary bedroom area. Oversize 2 car garage has epoxy floor, built in storage and pull down ladder to an enormous attic that you can stand up in and probably build another room. Long driveway accommodates up to 5 cars.  Ava newport's apartments in costa mesa are a new kind of living space by newport's back bay. Located just off the costa mesa freeway and minutes from newport beach, this is a choice neighborhood where tacos meet sushi, double espressos meet green tea and yoga, and shopping depends on your mood of the moment. From union jack fish & chips and peet's coffee & tea to lions park and triangle square shopping center, there is always something exciting to engage within the community. This gorgeous community of apartments features one, one plus loft, and two bedroom floor plans with gourmet kitchens and a private patio/balcony. Spend a peaceful and relaxing afternoon in the heated swimming pool and spa, entertain guests in the resident clubhouse, and take advantage of the barbecue area for a mid-week celebration. At las palmas, recreation isn’t restricted to the weekend. The community is only minutes away from brea mall, angel stadium, downtown fullerton and some of orange county’s best breweries. With the best in amenities as well as the ideal location, las palmas offers a lifestyle you’ll want to make your own. This gorgeous community of apartments features one, one plus loft, and two bedroom floor plans with gourmet kitchens and a private patio/balcony. Spend a peaceful and relaxing afternoon in the heated swimming pool and spa, entertain guests in the resident clubhouse, and take advantage of the barbecue area for a mid-week celebration. At las palmas, recreation isn’t restricted to the weekend. The community is only minutes away from brea mall, angel stadium, downtown fullerton and some of orange county’s best breweries. With the best in amenities as well as the ideal location, las palmas offers a lifestyle you’ll want to make your own.\nNight and Day watch/ part time work\n\nWe are in need of someone who is very responsible and has their own car and cell phone. We are looking to interview and hire this person ASAP. The position will be temporary for Holiday help.\nCurrently we have several people who work with us that are computer programmers. We are ok with our people working on their own projects on their lap tops while they work for us. These individuals use this gig as part time work that gives them a steady stream of income. \n\nThis is not related to computers at all. We just so happen to have several people who are into programing, coding, ect... that work with us.\n\nGig Details:\nWe operate as construction site managers. We sit in our vehicles during the off hours on construction sites and ensure the site operates correctly during the off hours while no one is there. This is a very low stress environment. \n\nThe position will be for Day/nights and weekends. The position is temporary but can work out to a more permanent position 12/27 - 1/4. The job is located off of League City Parkway in League City. \n\nYou must be available on New Years Eve and New Years Day to work. \n\nIf interested please send me an email with one sentence describing yourself along with your contact information. I will be calling you to do a phone interview ASAP."
    ],
    "duplicates": []
  },
  {
    "price": "$580",
    "title": "Fully remodeled 3 beds 2 baths 1,200 sqft Home",
    "href": "https://providence.craigslist.org/apa/d/providence-fully-remodeled-3-beds-2/7046675781.html",
    "description": [
      "\n            \n            \nrent to own this fully remodeled 3 beds 2 baths 1,200 sqft home. walking distance to elementary school. huge lot. granite countertops. irrigation system. new roof. open floor plan. build your own custom dream pool. eat in kitchen, covered back patio, storage shed, one car garage, and more!!",
      "For More Information About This Listing:",
      "w",
      "w",
      "w",
      ".",
      "Rent2deal",
      ".",
      "c",
      "o",
      "m",
      "$$$ OPORTUNIDADES DE EMPLEO $$$\nCompañía establecida en Houston desde el año 2001 y en continua expansión esta Contratando personal INMEDIATAMENTE y ofrece oportunidades de trabajos en estos siguientes departamentos:\n\n1.Departamento de Relaciones Publicas: (El idioma Inglés NO es Requisito)\nSalario Fijo de $3500 a $4500 x Mes.\n\n2.Analista de Agua/Water Analyst (El idioma Inglés NO es Requisito)\nSalario Fijo $4000 x Mes.\n\n3.Departamento de Servicio al Cliente: (Bilingüe)\n$10.00 a $12.50 x Hora + Otros Beneficios.\n\n4.Deptarmatento Administrativo (Bilingüe)\n$10.00 a $12.50 x Hora + Otros Beneficios.\n\n5.Departamento de Ventas (El idioma Inglés NO es Requisito)\n$75,000 a $100,000 x año (El Salario es negociable dependiendo de la Experiencia)\n\n6.Tele-Operadora (El idioma Inglés NO es Requisito)\n$300.00 x Semana / Trabajo desde Casa. \n\n7.Encuestadores (El idioma Inglés NO es Requisito)\n$500.00 x Semana \n\nREQUISITOS PARA TODAS LAS POSICIONES:\n1.Graduado de High School.\n2.Interes sincero en ayudar a otras personas.\n3.Honesto, Muy Buena Actitud , saber Automotivarse y habilidad para trabajar No estando bajo supervisión.\n\nBENEFICIOS:\n*Ingresos Fijos.\n*Vacaciones Pagadas.\n*Programa de Vehículo.\n*Entrenamiento Pagado.\n*Excelente Ambiente de Trabajo.\n*Oportunidad de Ascensos de acuerdo con sus habilidades.\n\nSOLO si califica de acuerdo a los requerimientos mencionados, envíe UN MENSAJE DE TEXTO con su NOMBRE COMPLETO y en respuesta le enviaremos la Dirección donde necesita presentarse para una entrevista y los horarios disponibles.\n\nWould you like to enjoy beautiful sunrises and sunsets. Our very affordable southern new jersey getaway is the right property for you. Our property is located in hideaway beach campground. Our closest shorepoint is the very beautiful town of stone harbor. This is a unique campground in that you own your property and are not subject to constant rent increases. Our property is almost completely maintenance free. You can sleep up to 8 and this community is gated by an electronic gate only accessible to owners. A lot of the existing furniture and appliances will stay. Our yearly costs are approximately $4,000 - $4,500. It is very difficult to afford a week at the shore for the cost of having complete ownership. Asking price is $81,900. Property is in immaculate condition with many upgrades and amenities.  Two bedroom plus den double-wide on quiet cul-de-sac available in port orange, florida - in pickwick village (off clyde morris blvd across from the port orange police station) just 15 minutes from the beach and 6 miles to daytona racetrack. Master bedroom has a 3/4 bath and walk-in closet, and the 2nd bedroom has a walk-in closet too. The open den can used as a tv room or home office or could be converted into a 3rd bedroom with the addition of a door. A dining ell off the living room leads past the side entry to the galley kitchen. The side entry opens to the covered car port (deep enough for 2 cars) with the laundry hook-up in the shed at the back. On the opposite side of the house is the large florida room with front entry. Appliances include ceiling fans in living room and both bedrooms, electric stove, refrigerator, dishwasher, new food disposal and newer central air conditioning. Pickwick village is an adult retirement community with a community swimming pool and community center with exercise equipment, pool table, residents library, coin laundry, kitchen and other amenities. Lot rental is $593/month, not including integrated billing for basic cable tv, water, sewer and trash pick up; lawn maintenance is included.  Situated at the bottom of skyline only past the high school tennis courts, this attractively remodeled city home is only a brief walk from the shore and all of that downtown laguna offers! Luxurious updates include laminate and tile floors throughout, shaker style kitchen cabinets, granite counter tops tops with extended breakfast bar open into the living room, both bedrooms on lower level with private interior laundry. Exterior features large private balcony overlooking community rear yard lined with fruit, cherry and citrus trees, and terrace with bbq and fire pit. Fantastic place for both enjoyable and experience!! Residents at huntington continental embrace the idyllic beach-town life. And only a few minutes away from the pier, main street and meadowlark golf club, huntington continental places you near all the area’s greatest attractions. Make the most of your leisure time by biking along the shore or discovering coveted local food at eateries. At the end of each day, come home to the peaceful and verdant apartment community of huntington continental. Choose your home from roomy, well-designed one and two bedroom apartment floor plans featuring a huge balcony or deck, spacious closets, and ceiling fans. Unwind in our swimming pool and barbecue area, and get to know the residents of this small, tight-knit community. Latitude apartment homes for rent is located in orange county close to main place mall, circle of orange, chapman college, ingram micro, city of tustin and orange.  In the santa ana district the community offers easy freeway access to I-55, 22 and the 5 freeways.  The one, two and three bedroom floor plans feature some of the most peaceful living spaces in north santa ana, california.  Our apartment homes include recently renovated interiors with wood flooring*, stainless steel stoves, stainless steel dishwashers, washer and dryer* and 2 tone paint.  Residents are invited to relax in the pool and enjoy free wi-fi in common areas. ❤️🚚❤️❤️😍rent my truck $60.Cheap moving 24/7  model perfect single level house with no association on the most peaceful private end of cul-de-sac lot in whaler's cove. Little over a mile to the beach, pacific city, downtown. Ocean breezes. Filled with natural light from all its windows, 15 ft vaulted ceiling in living & master. Kitchen with breakfast nook & breakfast bar opens to dining & living room & has been remodeled with led recessed lighting, solid wood cabinetry, roll outs, granite counters & bosch stainless steel appliances. Living room with its voluminous ceiling has a large modern wood burning (or gas) fireplace with tile surround. Living room & master bedroom open to an easy care wrap around yard with patios, grass & beautiful plants. Master suite has vaulted ceiling, two large closets plus linen cabinets, room for king size bed, dresser & reading chair. Master bath has 2 sinks, granite counters & shower. Second bedroom is separate from mater suite & has a large closet, bath with tub/shower and vanity with granite counter. Coat closet plus custom linen cabinet are just off the hall to the secondary bedroom area. Oversize 2 car garage has epoxy floor, built in storage and pull down ladder to an enormous attic that you can stand up in and probably build another room. Long driveway accommodates up to 5 cars.  Ava newport's apartments in costa mesa are a new kind of living space by newport's back bay. Located just off the costa mesa freeway and minutes from newport beach, this is a choice neighborhood where tacos meet sushi, double espressos meet green tea and yoga, and shopping depends on your mood of the moment. From union jack fish & chips and peet's coffee & tea to lions park and triangle square shopping center, there is always something exciting to engage within the community. This gorgeous community of apartments features one, one plus loft, and two bedroom floor plans with gourmet kitchens and a private patio/balcony. Spend a peaceful and relaxing afternoon in the heated swimming pool and spa, entertain guests in the resident clubhouse, and take advantage of the barbecue area for a mid-week celebration. At las palmas, recreation isn’t restricted to the weekend. The community is only minutes away from brea mall, angel stadium, downtown fullerton and some of orange county’s best breweries. With the best in amenities as well as the ideal location, las palmas offers a lifestyle you’ll want to make your own. This gorgeous community of apartments features one, one plus loft, and two bedroom floor plans with gourmet kitchens and a private patio/balcony. Spend a peaceful and relaxing afternoon in the heated swimming pool and spa, entertain guests in the resident clubhouse, and take advantage of the barbecue area for a mid-week celebration. At las palmas, recreation isn’t restricted to the weekend. The community is only minutes away from brea mall, angel stadium, downtown fullerton and some of orange county’s best breweries. With the best in amenities as well as the ideal location, las palmas offers a lifestyle you’ll want to make your own.\nNight and Day watch/ part time work\n\nWe are in need of someone who is very responsible and has their own car and cell phone. We are looking to interview and hire this person ASAP. The position will be temporary for Holiday help.\nCurrently we have several people who work with us that are computer programmers. We are ok with our people working on their own projects on their lap tops while they work for us. These individuals use this gig as part time work that gives them a steady stream of income. \n\nThis is not related to computers at all. We just so happen to have several people who are into programing, coding, ect... that work with us.\n\nGig Details:\nWe operate as construction site managers. We sit in our vehicles during the off hours on construction sites and ensure the site operates correctly during the off hours while no one is there. This is a very low stress environment. \n\nThe position will be for Day/nights and weekends. The position is temporary but can work out to a more permanent position 12/27 - 1/4. The job is located off of League City Parkway in League City. \n\nYou must be available on New Years Eve and New Years Day to work. \n\nIf interested please send me an email with one sentence describing yourself along with your contact information. I will be calling you to do a phone interview ASAP."
    ],
    "duplicates": []
  },
  {
    "price": "$600",
    "title": "single family home for rent",
    "href": "https://providence.craigslist.org/apa/d/providence-single-family-home-for-rent/7046675510.html",
    "description": [
      "\n            \n            \nthis single family home has 3 bedrooms and 2.5 bathrooms for rent. vaulted living room ceiling, marble fireplace, upstairs room for an office or working out with a view, newer kitchen with granite counters, lovely courtyard, over sized 2 car garage. great built in storage throughout. comes with all furnishings and linens. all new luxury vinyl plank flooring - carpet! kitchen has dishes, pots/pans, silverware, dishwasher, range, microwave and full refrigerator.",
      "For More Information About This Listing:",
      "w",
      "w",
      "w",
      ".",
      "RentOwnFinder",
      ".",
      "c",
      "o",
      "m",
      "$$$ OPORTUNIDADES DE EMPLEO $$$\nCompañía establecida en Houston desde el año 2001 y en continua expansión esta Contratando personal INMEDIATAMENTE y ofrece oportunidades de trabajos en estos siguientes departamentos:\n\n1.Departamento de Relaciones Publicas: (El idioma Inglés NO es Requisito)\nSalario Fijo de $3500 a $4500 x Mes.\n\n2.Analista de Agua/Water Analyst (El idioma Inglés NO es Requisito)\nSalario Fijo $4000 x Mes.\n\n3.Departamento de Servicio al Cliente: (Bilingüe)\n$10.00 a $12.50 x Hora + Otros Beneficios.\n\n4.Deptarmatento Administrativo (Bilingüe)\n$10.00 a $12.50 x Hora + Otros Beneficios.\n\n5.Departamento de Ventas (El idioma Inglés NO es Requisito)\n$75,000 a $100,000 x año (El Salario es negociable dependiendo de la Experiencia)\n\n6.Tele-Operadora (El idioma Inglés NO es Requisito)\n$300.00 x Semana / Trabajo desde Casa. \n\n7.Encuestadores (El idioma Inglés NO es Requisito)\n$500.00 x Semana \n\nREQUISITOS PARA TODAS LAS POSICIONES:\n1.Graduado de High School.\n2.Interes sincero en ayudar a otras personas.\n3.Honesto, Muy Buena Actitud , saber Automotivarse y habilidad para trabajar No estando bajo supervisión.\n\nBENEFICIOS:\n*Ingresos Fijos.\n*Vacaciones Pagadas.\n*Programa de Vehículo.\n*Entrenamiento Pagado.\n*Excelente Ambiente de Trabajo.\n*Oportunidad de Ascensos de acuerdo con sus habilidades.\n\nSOLO si califica de acuerdo a los requerimientos mencionados, envíe UN MENSAJE DE TEXTO con su NOMBRE COMPLETO y en respuesta le enviaremos la Dirección donde necesita presentarse para una entrevista y los horarios disponibles.\n\nWould you like to enjoy beautiful sunrises and sunsets. Our very affordable southern new jersey getaway is the right property for you. Our property is located in hideaway beach campground. Our closest shorepoint is the very beautiful town of stone harbor. This is a unique campground in that you own your property and are not subject to constant rent increases. Our property is almost completely maintenance free. You can sleep up to 8 and this community is gated by an electronic gate only accessible to owners. A lot of the existing furniture and appliances will stay. Our yearly costs are approximately $4,000 - $4,500. It is very difficult to afford a week at the shore for the cost of having complete ownership. Asking price is $81,900. Property is in immaculate condition with many upgrades and amenities.  Two bedroom plus den double-wide on quiet cul-de-sac available in port orange, florida - in pickwick village (off clyde morris blvd across from the port orange police station) just 15 minutes from the beach and 6 miles to daytona racetrack. Master bedroom has a 3/4 bath and walk-in closet, and the 2nd bedroom has a walk-in closet too. The open den can used as a tv room or home office or could be converted into a 3rd bedroom with the addition of a door. A dining ell off the living room leads past the side entry to the galley kitchen. The side entry opens to the covered car port (deep enough for 2 cars) with the laundry hook-up in the shed at the back. On the opposite side of the house is the large florida room with front entry. Appliances include ceiling fans in living room and both bedrooms, electric stove, refrigerator, dishwasher, new food disposal and newer central air conditioning. Pickwick village is an adult retirement community with a community swimming pool and community center with exercise equipment, pool table, residents library, coin laundry, kitchen and other amenities. Lot rental is $593/month, not including integrated billing for basic cable tv, water, sewer and trash pick up; lawn maintenance is included.  Situated at the bottom of skyline only past the high school tennis courts, this attractively remodeled city home is only a brief walk from the shore and all of that downtown laguna offers! Luxurious updates include laminate and tile floors throughout, shaker style kitchen cabinets, granite counter tops tops with extended breakfast bar open into the living room, both bedrooms on lower level with private interior laundry. Exterior features large private balcony overlooking community rear yard lined with fruit, cherry and citrus trees, and terrace with bbq and fire pit. Fantastic place for both enjoyable and experience!! Residents at huntington continental embrace the idyllic beach-town life. And only a few minutes away from the pier, main street and meadowlark golf club, huntington continental places you near all the area’s greatest attractions. Make the most of your leisure time by biking along the shore or discovering coveted local food at eateries. At the end of each day, come home to the peaceful and verdant apartment community of huntington continental. Choose your home from roomy, well-designed one and two bedroom apartment floor plans featuring a huge balcony or deck, spacious closets, and ceiling fans. Unwind in our swimming pool and barbecue area, and get to know the residents of this small, tight-knit community. Latitude apartment homes for rent is located in orange county close to main place mall, circle of orange, chapman college, ingram micro, city of tustin and orange.  In the santa ana district the community offers easy freeway access to I-55, 22 and the 5 freeways.  The one, two and three bedroom floor plans feature some of the most peaceful living spaces in north santa ana, california.  Our apartment homes include recently renovated interiors with wood flooring*, stainless steel stoves, stainless steel dishwashers, washer and dryer* and 2 tone paint.  Residents are invited to relax in the pool and enjoy free wi-fi in common areas. ❤️🚚❤️❤️😍rent my truck $60.Cheap moving 24/7  model perfect single level house with no association on the most peaceful private end of cul-de-sac lot in whaler's cove. Little over a mile to the beach, pacific city, downtown. Ocean breezes. Filled with natural light from all its windows, 15 ft vaulted ceiling in living & master. Kitchen with breakfast nook & breakfast bar opens to dining & living room & has been remodeled with led recessed lighting, solid wood cabinetry, roll outs, granite counters & bosch stainless steel appliances. Living room with its voluminous ceiling has a large modern wood burning (or gas) fireplace with tile surround. Living room & master bedroom open to an easy care wrap around yard with patios, grass & beautiful plants. Master suite has vaulted ceiling, two large closets plus linen cabinets, room for king size bed, dresser & reading chair. Master bath has 2 sinks, granite counters & shower. Second bedroom is separate from mater suite & has a large closet, bath with tub/shower and vanity with granite counter. Coat closet plus custom linen cabinet are just off the hall to the secondary bedroom area. Oversize 2 car garage has epoxy floor, built in storage and pull down ladder to an enormous attic that you can stand up in and probably build another room. Long driveway accommodates up to 5 cars.  Ava newport's apartments in costa mesa are a new kind of living space by newport's back bay. Located just off the costa mesa freeway and minutes from newport beach, this is a choice neighborhood where tacos meet sushi, double espressos meet green tea and yoga, and shopping depends on your mood of the moment. From union jack fish & chips and peet's coffee & tea to lions park and triangle square shopping center, there is always something exciting to engage within the community. This gorgeous community of apartments features one, one plus loft, and two bedroom floor plans with gourmet kitchens and a private patio/balcony. Spend a peaceful and relaxing afternoon in the heated swimming pool and spa, entertain guests in the resident clubhouse, and take advantage of the barbecue area for a mid-week celebration. At las palmas, recreation isn’t restricted to the weekend. The community is only minutes away from brea mall, angel stadium, downtown fullerton and some of orange county’s best breweries. With the best in amenities as well as the ideal location, las palmas offers a lifestyle you’ll want to make your own. This gorgeous community of apartments features one, one plus loft, and two bedroom floor plans with gourmet kitchens and a private patio/balcony. Spend a peaceful and relaxing afternoon in the heated swimming pool and spa, entertain guests in the resident clubhouse, and take advantage of the barbecue area for a mid-week celebration. At las palmas, recreation isn’t restricted to the weekend. The community is only minutes away from brea mall, angel stadium, downtown fullerton and some of orange county’s best breweries. With the best in amenities as well as the ideal location, las palmas offers a lifestyle you’ll want to make your own.\nNight and Day watch/ part time work\n\nWe are in need of someone who is very responsible and has their own car and cell phone. We are looking to interview and hire this person ASAP. The position will be temporary for Holiday help.\nCurrently we have several people who work with us that are computer programmers. We are ok with our people working on their own projects on their lap tops while they work for us. These individuals use this gig as part time work that gives them a steady stream of income. \n\nThis is not related to computers at all. We just so happen to have several people who are into programing, coding, ect... that work with us.\n\nGig Details:\nWe operate as construction site managers. We sit in our vehicles during the off hours on construction sites and ensure the site operates correctly during the off hours while no one is there. This is a very low stress environment. \n\nThe position will be for Day/nights and weekends. The position is temporary but can work out to a more permanent position 12/27 - 1/4. The job is located off of League City Parkway in League City. \n\nYou must be available on New Years Eve and New Years Day to work. \n\nIf interested please send me an email with one sentence describing yourself along with your contact information. I will be calling you to do a phone interview ASAP."
    ],
    "duplicates": []
  },
  {
    "price": "$1650",
    "title": "New 1 Bed Corner Condo Providence Art & Entertainment district",
    "href": "https://providence.craigslist.org/apa/d/providence-new-1-bed-corner-condo/7019409868.html",
    "description": [
      "Top floor corner unit",
      "near laundry, elevator, and stairs.",
      "All brand new appliances, toilet, floor, paint etc.",
      "One bedroom one bathroom unit:",
      "Perfect for Grad students, or anyone who wants to live in the heart of Providence.",
      "Granite countertops",
      "Large windows",
      "Lots of closet space",
      "Walking distance (within 4 blocks) to:",
      "Skating Center",
      "City Hall",
      "Providence Place Mall",
      "URI, JWU, RWU, RISDI Providence campus!",
      "Station Park, the site of Water Fire",
      "The Strand Theatre",
      "The Dunkin Donuts Center",
      "Providence Convention Center",
      "Providence Performing Arts",
      "Trinity Rep",
      "And far too many other great restaurants, bars, and entertainment venues to list.",
      "Located in the heart of Downtown Providence Art & Entertainment district",
      "Located 3 blocks walking distance to the main bus station,",
      "Less than 1/2 mile from the train station (10 min walk)",
      "Condo includes:",
      "Key-less entry to building and unit (never lose your keys again)",
      "Central Heat and A/C",
      "Granite countertops",
      "High ceilings",
      "Huge windows",
      "Elevator",
      "Intercom system",
      "Laundry facilities on each floor",
      "Water / Sewer included",
      "Gas / Electric / TV tenant responsibility",
      "Parking is available off-site. There are several options: Parking garage/surface lots",
      "Both are Additional expense  (Prices for parking can range from 90-200 depending on location)",
      "If interested in this unit please include a phone # when you email.",
      "If the advertisement is view-able unit is still on the market"
    ],
    "duplicates": []
  },
  {
    "price": "$1150",
    "title": "Updated Condo With Amazing Views",
    "href": "https://hartford.craigslist.org/apa/d/updated-condo-with-amazing-views/7031343103.html",
    "description": [
      "Beautifully updated condo with amazing views of the lush green park. The condo has all tile floors with a beautiful medallion in the living room that makes cleaning a breeze, granite counter tops in kitchen and bathrooms for that luxurious look, all appliances included (fridge, washer and dryer), two master bedrooms with their own private bathrooms perfect for an office or two friends leasing together. Cozy covered back patio provides a peaceful view of a large green belt. Easy access to the 51 freeway, Paradise Valley Mall is approximately 1 mile east, plenty of shopping, grocery stores and restaurants located near the condo. Don't miss this amazing opportunity!  If you are interested please text me at :",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1350",
    "title": "Two/2 Beautiful Tile Flooring For Rent",
    "href": "https://hartford.craigslist.org/apa/d/providence-two-2-beautiful-tile/7031342172.html",
    "description": [
      "Incredibly clean 2 bedroom & 2 bathroom condo with attached 1 car garage. Beautiful tile flooring, modern carpet, and pergo floors throughout. Functional kitchen with breakfast bar- includes all matching black appliances in the kitchen and a washer & dryer as well. The ceilings soar in the great room-it's a must see. Master bathroom boasts an oversized tub and dual sinks. 2nd bathroom has a surprising amount of counter space. Great location within the community- near the pool! Complex is located near Cave Creek Rd and Deer Valley Dr! Secure gated community. Conveniently located near Desert Ridge fine shopping and dining. If you are interested please text me at :",
      "show contact info"
    ],
    "duplicates": []
  }
]