[
  {
    "price": "$1270",
    "title": "Desirable selection of newly renovated one and two-bedroom apartment!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-desirable-selection-of-newly/7109702816.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "Special: $250 off 1st & 2nd mo w/12mo",
      "1 Bedrooms starting at $1,105",
      "2 Bedrooms starting at $1,270",
      "3 Bedrooms starting at $",
      "2 Pools, Fitness center, Laundry room, Gated entrance, Private detached garages($100/mo), Free WiFi Areas, School bus stop, Door to door trash pickup, Game/Sport room, Business center, Assigned parking, Club house, Perimeter fence, Picnic area, Outdoor Grills",
      "***Broken Lease***",
      "Accept Eviction  Second Chance We can Help you Our service is Free",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#7959A"
    ],
    "duplicates": []
  },
  {
    "price": "$1",
    "title": "LOOKING FOR A HOUSE FOR RENT ? I CAN HELP",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-looking-for-house-for-rent-can/7121845932.html",
    "description": [
      "My name is Georgette ,",
      "I am an apartment locator/AGENT. My services are FREE FREE, FREE ! You pay me nothing for my services. Whenever you lease at an apartment and put me as your referral source, the apartment complex pays me a commission for bringing them a qualified tenant. I will find all the best deals for you in the area and save you time",
      "I work with***",
      "RENT HOUSE*",
      "CONDO*",
      "DUPLEX",
      "TOWNHOME*",
      "Luxury apartments*",
      "Townhouse*",
      "High Rise*",
      "Penthouse*",
      "Section 8 vouchers*",
      "Eviction 2 YEARS OLD *",
      "Broken Lease 1 YEAR OLD *",
      "Most criminal offenses*",
      "FELONY 5 YEARS OLD*",
      "MISD. 1 YEAR OLD*",
      "We are a full-service real estate company. We also help with buying, selling and leasing homes and property management and all commercial property buying and selling pus management as well. You can call or text me at any time.",
      "If interested, please reply directly to this ad or contact me using the information in the attached business card. To get started, I just need to know what areas you are looking to move to, what your price range is, any pets, move date, and anything specific you want in your new apartment/Home. >>>",
      "Georgette Bon",
      "AGENT | Apartment Locator",
      "Core One Real Estate",
      "The referral of your friends and family is the greatest compliment you can give me.",
      "Thank you for your trust in me."
    ],
    "duplicates": []
  },
  {
    "price": "$1591",
    "title": "Experience beautiful one and two bedroom apartment homes!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-experience-beautiful-one-and-two/7110170199.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "1 Bedrooms starting at $1,088",
      "2 Bedrooms starting at $1,591",
      "3 Bedrooms starting at $",
      "Business center, Fitness center, Door to door trash pickup, Perimeter fence, Gated entrance, Private detached garages($120/mo), Free WiFi Areas, Outdoor Grills, Handicap modified units, Carports, School bus stop, Pool, Dog Park",
      "***Broken Lease***",
      "Accept Eviction  Second Chance We can Help you Our service is Free",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#8322A"
    ],
    "duplicates": []
  },
  {
    "price": "$1480",
    "title": "A PERFECT CHOICE TO CALL HOME",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-perfect-choice-to-call-home/7110174502.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "1 Bedrooms starting at $1,025",
      "2 Bedrooms starting at $1,480",
      "3 Bedrooms starting at $1,805",
      "Hot Tub, Private detached garages($100/mo), Dog Park, Carports, Fitness center, Picnic area, Gated entrance, Bus stop, Free WiFi Areas, Outdoor Grills, Door to door trash pickup, Pool, Business center, School bus stop, Perimeter fence, Club house",
      "***Broken Lease***",
      "Accept Eviction  Second Chance We can Help you Our service is Free",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#6167A"
    ],
    "duplicates": []
  },
  {
    "price": "$1175",
    "title": "New Luxury Apt in West Plano with Elevators**Resort-Style Pool!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-new-luxury-apt-in-west-plano-with/7111635942.html",
    "description": [
      "New Luxury and Chic Apartment in West Plano with Dining, Shopping, and Entertainment at Your Door Step! Enjoy the Luxury of White Granite Countertops and Clean Steel Appliances in the Kitchen. Wood Floors, Walk-In Closet, and Garden Tub in Your Luxury Apartment Home. Amenities Include a Luxe Resort Style Swimming Pool, Cabanas, Health Club, Wellness Studio, and Keyless Controlled Entry. More Amenities Include Walking Paths, Pet Parks, and Pet Spa for Your Dogs, Plus So Much More! Parking Garage and Elevators as Well! Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1199",
    "title": "New Upscale Apartment in West Plano with**Resort-Style Pool!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/new-upscale-apartment-in-west-plano/7109149231.html",
    "description": [
      "New Upscale and Chic Apartment in  West Plano with Dining, Shopping, and Entertainment at Your Door Step! Enjoy the Luxury of White Granite Countertops and Clean Steel Appliances in the Kitchen. Wood Floors, Walk-In Closet, and Garden Tub in Your Upscale Apartment Home. Amenities Include a Luxurious Resort Style Swimming Pool, Cabanas, Health Club, Wellness Studio, and Keyless Controlled Entry. More Perks are Walking Paths, Pet Parks, and Pet Spa for your Dogs, Plus So Much More! Parking Garage and Elevatorsas Well! Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1879",
    "title": "Brand New Chic Apt in West Plano**1 MONTH FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-brand-new-chic-apt-in-west-plano1/7114654224.html",
    "description": [
      "Brand New Luxury and Chic Apartment in West Plano with Dining, Shopping, and Entertainment at Your Door Step! Stunning Kitchens with White Quartz Countertops and Sleek Steel Appliances in the Kitchen. Wood Floors, Walk-In Closets, Stand-Up Shower, Garden Tubs, plus Washer and Dryer Included in Your Chic Apartment Home. Amenities Include a Luxe Resort Style Swimming Pool, Tanning Deck, 24/7 State of the Art Athletic Center with Free Weights, Party Room, Billiards Table, Private Conference Room, Pet Park, Plus So Much More! Parking Garage and Elevators! Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1515",
    "title": "Luxury High-Rise in West Plano**Washer/Dryer Inc**ONE MONTH FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-luxury-high-rise-in-west/7112461179.html",
    "description": [
      "New Luxury and Chic High-Rise in West Plano over Looking the Shops of Legacy! Walking Distance to Shopping, Dining, Night Life, and Entertainment. Enjoy the Luxury of White Quartz Countertops, Wine Refrigerator, Stainless Steel Appliances, and Gas Cook Tops in the Kitchen. Real Wood Floors, Walk-In Closet, Spa Shower with Washer and Dryer Included in Your Luxury Apartment Home. Amenities Include Two Luxe Resort-Style Swimming Pools, Dog Park, State of the Art Fitness Center, Theater Room, Billiards Room, Concierge Service, and So Much More. Parking Garage and Elevators! Great Management and Staff. Please call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1599",
    "title": "Brand New Apt- 6 Pools, Parks, Jogging Trails **ONE MONTH FREE**",
    "href": "https://dallas.craigslist.org/dal/apa/d/brand-new-apt-6-pools-parks-jogging/7115852035.html",
    "description": [
      "Chic and Stylish Apartment Community with Dining, Shopping, and Entertainment at Your Door Step, but Also Offers Many Outdoor Activities. Each Apartment Includes; Granite Countertops, Stainless Steel Appliances, and Wood Flooring!! They Also Include; Garden Tubs and Walk-In Closets!! This Community Offers a Variety of Floorplans, That One Will Easily Fall in Love With. Amenities Include; 6 Luxe Resort-Style Swimming Pools, 24-Hour Fitness Center, Multiple Dog Parks, and Even Easy Access to Many Bike/Hike Trails and The Nature Preserve! This Property Offers a Bundle of Activities, That One Will Love!! Most Importantly, They Have Great Management and Maintenance!! Please Contact Jacquelyn with Dash Realty at",
      "show contact info",
      "For More Information."
    ],
    "duplicates": []
  },
  {
    "price": "$1755",
    "title": "Come visit today and make us your new home!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-come-visit-today-and-make-us-your/7111701769.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "Special: 1mo free w/12+mo",
      "1 Bedrooms starting at $1,378",
      "2 Bedrooms starting at $1,755",
      "3 Bedrooms starting at $",
      "Handicap modified units, Gated entrance, Furnished units, Outdoor Grills, Elevators, Fitness center, Pool, Dog Park, Free WiFi Areas, Bus stop, Assigned parking, Community parking garage, Business center, Laundry room",
      "***Broken Lease***",
      "Accept Eviction  Second Chance We can Help you Our service is Free",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#5362A"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1755",
    "title": "Come visit today and make us your new home!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-come-visit-today-and-make-us-your/7108052329.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "Special: 1mo free w/12+mo",
      "1 Bedrooms starting at $1,378",
      "2 Bedrooms starting at $1,755",
      "3 Bedrooms starting at $",
      "Handicap modified units, Gated entrance, Furnished units, Outdoor Grills, Elevators, Fitness center, Pool, Dog Park, Free WiFi Areas, Bus stop, Assigned parking, Community parking garage, Business center, Laundry room",
      "***Broken Lease***",
      "Accept Eviction  Second Chance We can Help you Our service is Free",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#5362A"
    ],
    "duplicates": []
  },
  {
    "price": "$1550",
    "title": "Perimeter fence, Bus stop, School bus stop, 2 Pools, Door to door tras",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-perimeter-fence-bus-stop-school/7122871520.html",
    "description": [
      "FREE MOVE OR CASH REBATE!!!!!\n\nClub house, Private detached garages($100/mo), Perimeter fence, Bus stop, School bus stop, 2 Pools, Door to door trash pickup, Outdoor Grills, Picnic area, Handicap modified units, Free WiFi Areas, Fitness center, Play ground, Game/Sport room, Dog Park, Gated entrance, Business center\n\nFREE LOCATING SERVICE : You pay me nothing for my services. Whenever you lease at an apartment and put me as your referral source, the property pays me a commission for bringing them a prospect. I find all the best deals for you in all areas and saves you time!\nProperty is on computerized pricing system (e.g. Yieldstar) therefore rents are approximate",
      "*Broken Lease* Eviction**Second Chance** We Can Help you, Our Service is FREE.",
      "For more information on this property and others please\nCall/Text Jodi Killingsworth @",
      "show contact info",
      ", or sign up on my website for more info\n\n1 Source Locators\nTop rated locator service in Dallas with over 500 Five star reviews\n\nRefer to Apt#8318A"
    ],
    "duplicates": []
  },
  {
    "price": "$1299",
    "title": "New Chic Apt in West Plano; Dining at Your Door Step**1 MONTH FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-new-chic-apt-in-west-plano-dining/7115511579.html",
    "description": [
      "New Chic and Stylish Apartment in West Plano with Dining, Shopping, and Entertainment at Your Door Step! Enjoy the Luxury of Quartz Countertops and Clean Steel Appliances in the Kitchen. Wood Floors, Walk-In Closet, and Garden Tub in Your Chic Apartment Home. Amenities Include a Luxurious Resort Style Swimming Pool, Health Club, Pet Park for Your Furry Friend, and So Much More. Parking Garage and Elevators! Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1725",
    "title": "Brand New Apt in the West Plano Area with ONE MONTH FREE!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-brand-new-apt-in-the-west-plano/7115533299.html",
    "description": [
      "Brand New Chic and Stylish Apartment Community in the West Plano Area!! Dining, Shopping, and Entertainment at Your Door Step, but Also Offers Many Outdoor Activities. Each Apartment Includes; Granite Countertops, Stainless Steel Appliances, and Wood Flooring!! They Also Include; Garden Tubs and Walk-In Closets!! This Community Offers a Variety of Floorplans, That One Will Easily Fall in Love With. Amenities Include; 6 Resort-Style Swimming Pools, 24-Hour Fitness Center, Multiple Dog Parks, Even Easy Access to Many Bike/Hike Trails, and the Nature Preserve! This Property Offers a Bundle of Activities, That One Will Love!! Most Importantly, They Have Great Management and Maintenance!! Please Contact Jacquelyn with Dash Realty at",
      "show contact info",
      "For More Information."
    ],
    "duplicates": []
  },
  {
    "price": "$2399",
    "title": "Brand New Chic Apt in West Plano; Elevators**SIX WEEKS FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-brand-new-chic-apt-in-west-plano/7110636465.html",
    "description": [
      "Brand New Chic and Luxury Apartment in West Plano close to Dining, Shopping, and Entertainment.! Enjoy the Luxury of Quartz Countertops, Side by Side Refridgerator, and Stainless Steel Appliances in the Kitchen. Wood Floors, Walk-In Closets, Garden Tubs, Stand Up Shower, with Washer and Dryer Included in Your Luxury Apartment Home. Amenities Include a Luxe Resort Style Swimming Pool, State of the Art Fitness Center, Car Wash Area, Pet Park, and Pet Spa for Your Furry Friends. Parking Garage and Elevators as Well. Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1499",
    "title": "New Apt in Plano; Elevators**2-4 WEEKS FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-new-apt-in-plano-elevators2-4/7115361412.html",
    "description": [
      "New Chic and Stylish Apartment in Plano with Parking Garage and Elevators! The Dart Train, Dining, Shopping, and Entertainment Around the Corner! Enjoy the Luxury of Granite Countertops and Stainless Steel Appliances in the Kitchen. Wood Floors, Walk-In Closets, Garden Tubs, with Washer and Dryer Included in Your Chic Apartment Home. Amenities Include a Luxe Resort Style Swimming Pool, 2 Story Athletic Fitness Center, Pet Park, and Pet Spa for Your Furry Friend. Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$2355",
    "title": "New Apt in West Plano; Elevators + Washer/Dryer Inc**ONE MONTH FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/new-apt-in-west-plano-elevators-washer/7110619726.html",
    "description": [
      "New Chic and Stylish Apartment in West Plano Close to Shopping, Dining, and Entertainment! Enjoy the Luxury of Quartz Countertops, Side by Side Refridgerator, and Stainless Steel Appliances in the Kitchen. Wood Floors, Walk-In Closets, Garden Tubs, with Washer and Dryer Included in Your Chic Apartment Home. Amenities Include a Luxurious Resort Style Swimming Pool, State of the Art Fitness Center, Car Wash Area, Pet Park, and Pet Spa for Your Furry Friends. Parking Garage, Elevators, and So Much More. Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1881",
    "title": "Renovated Townhomes with 2 Car Garages. Distinct Living Experience!",
    "href": "https://dallas.craigslist.org/ndf/apa/d/renovated-townhomes-with-2-car-garages/7108061247.html",
    "description": [
      "Step into a sleek townhome and find yourself surrounded by amenities that inspire tranquility. Sip coffee by the fireplace on a chilly night, or take a dip in the hot tub and let tension melt away. Shoot some hoops at the basketball court, send emails from the business center, then dive into the resort-style pool.  Tucked behind surrounding neighborhoods, the townhome style floor plans are spacious and open. Host visitors in the guest room, take the kids to have fun on the playground, then release stress at the fitness center. Located near parks, schools, and restaurants.",
      "Please Call Desiree at",
      "show contact info",
      "Mention ad 157",
      "Free Apartment Locating Help with a Licensed Agent",
      "DASH Realty"
    ],
    "duplicates": []
  },
  {
    "price": "$1699",
    "title": "Afforable 3 Bedroom In West Plano School Dist., Gated",
    "href": "https://dallas.craigslist.org/ndf/apa/d/afforable-3-bedroom-in-west-plano/7116369835.html",
    "description": [
      "Located between the George Bush Turnpike and North Dallas Tollway, our beautiful apartment community brings you the convenience of many shops, dining and entertainment destinations. Choose from a number of innovatively designed apartment homes. Our one, two and three bedroom floor plans feature all electric kitchens, spacious walk-in closets, washer and dryer connections, central heating and air, wonderful views, private patios and balconies, and so much more! Relax by the refreshing resort style swimming pool or enjoy the convenience of our state of the art fitness facility. Pets are welcome so bring the whole family! Committed to providing an outstanding living experience including our dedication to the highest level of maintenance and service to our residents!",
      "Please Call Desiree",
      "show contact info",
      "Mention Ad 465"
    ],
    "duplicates": [
      "6004497850"
    ]
  },
  {
    "price": "$1659",
    "title": "Afforable 3 Bedroom In West Plano School Dist., Gated",
    "href": "https://dallas.craigslist.org/ndf/apa/d/afforable-3-bedroom-in-west-plano/7106731803.html",
    "description": [
      "Located between the George Bush Turnpike and North Dallas Tollway, our beautiful apartment community brings you the convenience of many shops, dining and entertainment destinations. Choose from a number of innovatively designed apartment homes. Our one, two and three bedroom floor plans feature all electric kitchens, spacious walk-in closets, washer and dryer connections, central heating and air, wonderful views, private patios and balconies, and so much more! Relax by the refreshing resort style swimming pool or enjoy the convenience of our state of the art fitness facility. Pets are welcome so bring the whole family! Committed to providing an outstanding living experience including our dedication to the highest level of maintenance and service to our residents!",
      "Please Call Desiree",
      "show contact info",
      "Mention Ad 465"
    ],
    "duplicates": []
  },
  {
    "price": "$1150",
    "title": "Brand New Apt**6 Pools, Parks and Jogging Trails**ONE MONTH FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/brand-new-apt6-pools-parks-and-jogging/7110628957.html",
    "description": [
      "Chic and Stylish Apartment Community with Dining, Shopping, and Entertainment at Your Doorstep, but Also Offers Many Outdoor Activities. Each Apartment Includes; Granite Countertops, Stainless Steel Appliances, and Wood Flooring!! They Also Include; Garden Tub and Walk-In Closet!! This Community Offers a Variety of Floorplans, That One Will Easily Fall in Love With. Amenities Include; 6 Resort-Style Swimming Pools, 24-Hour Fitness Center, Multiple Dog Parks, and Even Easy Access to Many Bike/Hike Trails and the Nature Preserve! This Property Offers a Bundle of Activities, That One Will Love!! Most Importantly, They Have Great Management and Maintenance!! Please Contact Jacquelyn with Dash Realty at",
      "show contact info",
      "For More Information."
    ],
    "duplicates": []
  },
  {
    "price": "$1045",
    "title": "New Apartment in West Plano Area**SIX WEEKS FREE**",
    "href": "https://dallas.craigslist.org/dal/apa/d/new-apartment-in-west-plano-areasix/7118981432.html",
    "description": [
      "New Chic and StylishApartment Community in the West Plano Area with Nature Views! Easy Access to The Dallas Tollway, 121, and 161. Dining, Shopping, and Entertainment Close By. Enjoy the Luxury of Granite Countertops and Stainless Steel Appliances in the Kitchen. Wood Floors, Walk-In Closet, and Garden Tub in Your Chic Apartment Home. Enjoy the Luxe Resort Style Swimming Pool, State of the Art Fitness Center, Walking and Biking Trails, Pet Park, and a Pet Care Station to Name of Few of Their Great Amenities. Great Management and Staff. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1075",
    "title": "New Apt in the West Plano Area**4-6 WEEKS FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-new-apt-in-the-west-plano-area4-6/7122822134.html",
    "description": [
      "New Chic and Stylish Apartment Community with Easy Access to The Dallas Tollway! Dining, Shopping, Entertainment, and the Nature Preserve Close By. Enjoy the Luxury of Granite Countertops and Stainless Steel Appliances in the Kitchen. Wood Floors, Walk-In Closet, and Garden Tub in Your Chic Apartment Home. Enjoy the Luxe Resort Style Swimming Pool, State of the Art Fitness Center, Walking and Biking Trails, Pet Park, and a Pet Care Station to Name a Few of Their Great Amenities. Great Management and Staff. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "!"
    ],
    "duplicates": []
  },
  {
    "price": "$1280",
    "title": "GORGEOUS HOMES IN A CONVENIENT LOCATION !! COME STOP BY",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-gorgeous-homes-in-convenient/7107825103.html",
    "description": [
      "W Plano Pkwy & Preston Road, Plano, TX",
      "Call us today for more details.",
      "show contact info",
      "Live your best life. Experience apartments in Plano, TX with all of the luxury amenities and finer details you need. Just 20 miles north of downtown Dallas, enjoy countless opportunities for gourmet dining, upscale shopping, and thrilling nightlife. There’s no end to the ways in which our community lifestyle can elevate and inspire you. Make one of our unique and sophisticated apartment homes your own today!",
      "Schedule a tour today!",
      "Tours are by appointment only, please call first.",
      "show contact info",
      "Details",
      "1 Bed / 1 Bath\n",
      "Rent:",
      "$1,310",
      "/month",
      "Pets Allowed: Cats & Dogs",
      "Amenities",
      "Air Conditioning",
      "Balcony",
      "Carpet",
      "Ceiling Fan",
      "Central Heat",
      "Dishwasher",
      "Hardwood Floor",
      "High Ceilings",
      "In Unit Laundry",
      "Walk In Closet",
      "6 Weeks Free on Select Homes!\nCall us today for more details",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1125",
    "title": "Brand New Chic Apt in the West Plano Area**SIX WEEKS FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-brand-new-chic-apt-in-the-west/7122821026.html",
    "description": [
      "Brand New Chic and Stylish Apartment Community with Easy Access to The Dallas Tollway, and near 121, and 161. Dining, Shopping, and Entertainment Close By. Apartment Interiors Include Granite Countertops and Stainless Steel Appliances in the Kitchen. Wood Floors, Walk-In Closet, and Garden Tub in Your Home. Amenities Include a Luxe Resort Style Swimming Pool, State of the Art Fitness Center, Walking and Biking Trails, and Pet Park to Name a Few of Their Great Amenities. Great Management and Staff. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "!"
    ],
    "duplicates": []
  },
  {
    "price": "$1444",
    "title": "WE WOULD BE LUCKY TO HAVE YOU",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-we-would-be-lucky-to-have-you/7111624241.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "1 Bedrooms starting at $1,047",
      "2 Bedrooms starting at $1,444",
      "3 Bedrooms starting at $1,712",
      "Fitness center, Assigned parking, Perimeter fence, School bus stop, Picnic area, Private detached garages($50/mo), Bus stop, Carports, Free WiFi Areas, Business center, Handicap modified units, Gated entrance, Pool, Outdoor Grills, Hot Tub",
      "***Broken Lease***",
      "Accept Eviction  Second Chance We can Help you Our service is Free",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#8802A"
    ],
    "duplicates": []
  },
  {
    "price": "$2299",
    "title": "New Apt in Plano; Elevators**ONE MONTH FREE + Washer/Dryer Inc!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-new-apt-in-plano-elevatorsone/7118981083.html",
    "description": [
      "New Luxury and Upscale Apartment in Plano Close to Highway 75 and George Bush 1-90. Shopping, Dining, and Entertainment Near By! Enjoy the Luxury of Granite Countertops and Stainless Steel Appliances in the Kitchen. Wood Floors, Walk-In Closets, Garden Tubs with Washer and Dryer Include in Your Luxury Apartment Home. Amenities Include a Luxe Resort Style Swimming Pool, Large State of the Art Gym, SkyBridge Terrace, Pet Spa, and So Much More. Parking Garage and Elevators. Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1890",
    "title": "6 weeks free upfront + Cash rebate",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-6-weeks-free-upfront-cash-rebate/7122778550.html",
    "description": [
      "Contact info:",
      "Cole McCullough | Dash Realty |",
      "show contact info",
      "Reference Apartment #292 ; Application FEE $75 ADMIN FEE $175",
      "$1,890/mo",
      "KEY FEATURES",
      "Sq Footage:",
      "1147sqft.",
      "Bedrooms:",
      "2 Bed",
      "Bathrooms:",
      "2 Bath",
      "Parking:",
      "Parking Garage | Guest parking",
      "Lease Duration:",
      "1 Year",
      "Pets Policy:",
      "Cats & Dogs OK",
      "Laundry:",
      "In Unit",
      "Property Type:",
      "Apartment",
      "DESCRIPTION",
      "Where you call home touches every aspect of your life. This community was carefully designed for the person ready for the next chapter in luxury living. A short drive from downtown Dallas and an easy walk to local retailers, up-and-coming restaurants and bars with endless charm, This community is perfectly located for a life well-lived.",
      "Be sure to call/text Cole McCullough with Dash Realty at",
      "show contact info",
      "in order to receive specials, schedule a tour, or for more information. Please remember my services are FREE to you, the apartment complex pays for my referral and that is how I am able to get you certain specials that are not always available to the public!!",
      "RENTAL FEATURES",
      "Living room",
      "Dining room",
      "Walk-in closet",
      "Master bath",
      "Storage space",
      "Pantry",
      "Recreation room",
      "Range / Oven",
      "Refrigerator",
      "Dishwasher",
      "Microwave",
      "Garbage disposal",
      "Stainless steel appliances",
      "Freezer",
      "Balcony, Deck, or Patio",
      "Heat: forced air",
      "Central A/C",
      "Air conditioning",
      "Ceiling fans",
      "Cable-ready",
      "High-speed internet",
      "Wired",
      "Hardwood floor",
      "Granite countertop",
      "High / Vaulted ceiling",
      "COMMUNITY FEATURES",
      "New property",
      "Elevator",
      "Secured entry",
      "Controlled access",
      "Gated entry",
      "Disability access",
      "Shared pool",
      "Fitness center",
      "Near transportation",
      "Clubhouse",
      "Barbecue",
      "Business center",
      "Guest parking",
      "Off-street parking",
      "Covered parking",
      "On-street parking",
      "Garage - Attached",
      "Contact info:",
      "Cole McCullough",
      "Dash Realty",
      "show contact info",
      "*Prices, Specials, and availability are subject to change at anytime without notice.\nTags: Apartments, Downtown Dallas, East Dallas Apartments, Farmers market, deep Ellum, highland park, Park Cities, Kessler Park, Bishop Arts District, Knox/Henderson, Medical District, Design District, Midtown, North Dallas, Northeast Dallas, Northwest Dallas, Old East Dallas, Far North Dallas, South Dallas, Southeast Dallas, Uptown, Uptown Dallas apartments, Uptown Dallas, Addison apartments, Allen apartments, Carrollton apartments, Farmers Branch apartments, Frisco, Frisco apartments, Lake highlands apartments, Mckinney apartments, Mckinney, Richardson Apartments, Rockwall apartments, the colony, Las Colinas apartments, Irving apartments, South Irving apartments, North Irving apartments, Valley Ranch Apartments, Plano apartments, Central Plano apartments, West Plano apartments, East plano apartments, Ft.Worth apartments, Arlington apartments, Mid Cities apartments"
    ],
    "duplicates": [
      "6732345442"
    ]
  },
  {
    "price": "$1890",
    "title": "6 weeks free upfront + Cash rebate",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-6-weeks-free-upfront-cash-rebate/7122778199.html",
    "description": [
      "Contact info:",
      "Cole McCullough | Dash Realty |",
      "show contact info",
      "Reference Apartment #292 ; Application FEE $75 ADMIN FEE $175",
      "$1,890/mo",
      "KEY FEATURES",
      "Sq Footage:",
      "1147sqft.",
      "Bedrooms:",
      "2 Bed",
      "Bathrooms:",
      "2 Bath",
      "Parking:",
      "Parking Garage | Guest parking",
      "Lease Duration:",
      "1 Year",
      "Pets Policy:",
      "Cats & Dogs OK",
      "Laundry:",
      "In Unit",
      "Property Type:",
      "Apartment",
      "DESCRIPTION",
      "Where you call home touches every aspect of your life. This community was carefully designed for the person ready for the next chapter in luxury living. A short drive from downtown Dallas and an easy walk to local retailers, up-and-coming restaurants and bars with endless charm, This community is perfectly located for a life well-lived.",
      "Be sure to call/text Cole McCullough with Dash Realty at",
      "show contact info",
      "in order to receive specials, schedule a tour, or for more information. Please remember my services are FREE to you, the apartment complex pays for my referral and that is how I am able to get you certain specials that are not always available to the public!!",
      "RENTAL FEATURES",
      "Living room",
      "Dining room",
      "Walk-in closet",
      "Master bath",
      "Storage space",
      "Pantry",
      "Recreation room",
      "Range / Oven",
      "Refrigerator",
      "Dishwasher",
      "Microwave",
      "Garbage disposal",
      "Stainless steel appliances",
      "Freezer",
      "Balcony, Deck, or Patio",
      "Heat: forced air",
      "Central A/C",
      "Air conditioning",
      "Ceiling fans",
      "Cable-ready",
      "High-speed internet",
      "Wired",
      "Hardwood floor",
      "Granite countertop",
      "High / Vaulted ceiling",
      "COMMUNITY FEATURES",
      "New property",
      "Elevator",
      "Secured entry",
      "Controlled access",
      "Gated entry",
      "Disability access",
      "Shared pool",
      "Fitness center",
      "Near transportation",
      "Clubhouse",
      "Barbecue",
      "Business center",
      "Guest parking",
      "Off-street parking",
      "Covered parking",
      "On-street parking",
      "Garage - Attached",
      "Contact info:",
      "Cole McCullough",
      "Dash Realty",
      "show contact info",
      "*Prices, Specials, and availability are subject to change at anytime without notice.\nTags: Apartments, Downtown Dallas, East Dallas Apartments, Farmers market, deep Ellum, highland park, Park Cities, Kessler Park, Bishop Arts District, Knox/Henderson, Medical District, Design District, Midtown, North Dallas, Northeast Dallas, Northwest Dallas, Old East Dallas, Far North Dallas, South Dallas, Southeast Dallas, Uptown, Uptown Dallas apartments, Uptown Dallas, Addison apartments, Allen apartments, Carrollton apartments, Farmers Branch apartments, Frisco, Frisco apartments, Lake highlands apartments, Mckinney apartments, Mckinney, Richardson Apartments, Rockwall apartments, the colony, Las Colinas apartments, Irving apartments, South Irving apartments, North Irving apartments, Valley Ranch Apartments, Plano apartments, Central Plano apartments, West Plano apartments, East plano apartments, Ft.Worth apartments, Arlington apartments, Mid Cities apartments"
    ],
    "duplicates": []
  },
  {
    "price": "$1835",
    "title": "6 weeks free upfront + Cash rebate",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-6-weeks-free-upfront-cash-rebate/7122778797.html",
    "description": [
      "Contact info:",
      "Cole McCullough | Dash Realty |",
      "show contact info",
      "Reference Apartment #292 ; Application FEE $75 ADMIN FEE $175",
      "$1,835/mo",
      "KEY FEATURES",
      "Sq Footage:",
      "1116sqft.",
      "Bedrooms:",
      "2 Bed",
      "Bathrooms:",
      "2 Bath",
      "Parking:",
      "Parking Garage | Guest parking",
      "Lease Duration:",
      "1 Year",
      "Pets Policy:",
      "Cats & Dogs OK",
      "Laundry:",
      "In Unit",
      "Property Type:",
      "Apartment",
      "DESCRIPTION",
      "Where you call home touches every aspect of your life. This community was carefully designed for the person ready for the next chapter in luxury living. A short drive from downtown Dallas and an easy walk to local retailers, up-and-coming restaurants and bars with endless charm, This community is perfectly located for a life well-lived.",
      "Be sure to call/text Cole McCullough with Dash Realty at",
      "show contact info",
      "in order to receive specials, schedule a tour, or for more information. Please remember my services are FREE to you, the apartment complex pays for my referral and that is how I am able to get you certain specials that are not always available to the public!!",
      "RENTAL FEATURES",
      "Living room",
      "Dining room",
      "Walk-in closet",
      "Master bath",
      "Storage space",
      "Pantry",
      "Recreation room",
      "Range / Oven",
      "Refrigerator",
      "Dishwasher",
      "Microwave",
      "Garbage disposal",
      "Stainless steel appliances",
      "Freezer",
      "Balcony, Deck, or Patio",
      "Heat: forced air",
      "Central A/C",
      "Air conditioning",
      "Ceiling fans",
      "Cable-ready",
      "High-speed internet",
      "Wired",
      "Hardwood floor",
      "Granite countertop",
      "High / Vaulted ceiling",
      "COMMUNITY FEATURES",
      "New property",
      "Elevator",
      "Secured entry",
      "Controlled access",
      "Gated entry",
      "Disability access",
      "Shared pool",
      "Fitness center",
      "Near transportation",
      "Clubhouse",
      "Barbecue",
      "Business center",
      "Guest parking",
      "Off-street parking",
      "Covered parking",
      "On-street parking",
      "Garage - Attached",
      "Contact info:",
      "Cole McCullough",
      "Dash Realty",
      "show contact info",
      "*Prices, Specials, and availability are subject to change at anytime without notice.\nTags: Apartments, Downtown Dallas, East Dallas Apartments, Farmers market, deep Ellum, highland park, Park Cities, Kessler Park, Bishop Arts District, Knox/Henderson, Medical District, Design District, Midtown, North Dallas, Northeast Dallas, Northwest Dallas, Old East Dallas, Far North Dallas, South Dallas, Southeast Dallas, Uptown, Uptown Dallas apartments, Uptown Dallas, Addison apartments, Allen apartments, Carrollton apartments, Farmers Branch apartments, Frisco, Frisco apartments, Lake highlands apartments, Mckinney apartments, Mckinney, Richardson Apartments, Rockwall apartments, the colony, Las Colinas apartments, Irving apartments, South Irving apartments, North Irving apartments, Valley Ranch Apartments, Plano apartments, Central Plano apartments, West Plano apartments, East plano apartments, Ft.Worth apartments, Arlington apartments, Mid Cities apartments"
    ],
    "duplicates": []
  },
  {
    "price": "$1175",
    "title": "Brand New Chic Apt in West Plano**SIX WEEKS FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-brand-new-chic-apt-in-west/7114864595.html",
    "description": [
      "Brand New Luxury and Chic Apartment in West Plano; Dining, Shopping, and Entertainment at Your Door Step! Stunning Kitchens with White Quartz Countertops and Sleek Steel Appliances in the Kitchen. Wood Floors, Walk-In Closet, Stand-Up Shower, Garden Tub, with Washer and Dryer Included in Your Luxury Apartment Home. Amenities Include a Luxurious Resort Style Swimming Pool, Tanning Deck, 24/7 State of the Art Athletic Center with Free Weights, Cardio Machines, Rope Pull, Tire Flip, and Escape Fitness Plyo Boxes. More Amenities are a Party Room, Billiards Table, Private Conference Room, Pet Park, Plus So Much More! Parking Garage and Elevators! Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1380",
    "title": "6 weeks free upfront + Cash rebate",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-6-weeks-free-upfront-cash-rebate/7122777913.html",
    "description": [
      "Contact info:",
      "Cole McCullough | Dash Realty |",
      "show contact info",
      "Reference Apartment #292 ; Application FEE $75 ADMIN FEE $175",
      "$1,380/mo",
      "KEY FEATURES",
      "Sq Footage:",
      "745sqft.",
      "Bedrooms:",
      "1 Bed",
      "Bathrooms:",
      "1 Bath",
      "Parking:",
      "Parking Garage | Guest parking",
      "Lease Duration:",
      "1 Year",
      "Pets Policy:",
      "Cats & Dogs OK",
      "Laundry:",
      "In Unit",
      "Property Type:",
      "Apartment",
      "DESCRIPTION",
      "Where you call home touches every aspect of your life. This community was carefully designed for the person ready for the next chapter in luxury living. A short drive from downtown Dallas and an easy walk to local retailers, up-and-coming restaurants and bars with endless charm, This community is perfectly located for a life well-lived.",
      "Be sure to call/text Cole McCullough with Dash Realty at",
      "show contact info",
      "in order to receive specials, schedule a tour, or for more information. Please remember my services are FREE to you, the apartment complex pays for my referral and that is how I am able to get you certain specials that are not always available to the public!!",
      "RENTAL FEATURES",
      "Living room",
      "Dining room",
      "Walk-in closet",
      "Master bath",
      "Storage space",
      "Pantry",
      "Recreation room",
      "Range / Oven",
      "Refrigerator",
      "Dishwasher",
      "Microwave",
      "Garbage disposal",
      "Stainless steel appliances",
      "Freezer",
      "Balcony, Deck, or Patio",
      "Heat: forced air",
      "Central A/C",
      "Air conditioning",
      "Ceiling fans",
      "Cable-ready",
      "High-speed internet",
      "Wired",
      "Hardwood floor",
      "Granite countertop",
      "High / Vaulted ceiling",
      "COMMUNITY FEATURES",
      "New property",
      "Elevator",
      "Secured entry",
      "Controlled access",
      "Gated entry",
      "Disability access",
      "Shared pool",
      "Fitness center",
      "Near transportation",
      "Clubhouse",
      "Barbecue",
      "Business center",
      "Guest parking",
      "Off-street parking",
      "Covered parking",
      "On-street parking",
      "Garage - Attached",
      "Contact info:",
      "Cole McCullough",
      "Dash Realty",
      "show contact info",
      "*Prices, Specials, and availability are subject to change at anytime without notice.\nTags: Apartments, Downtown Dallas, East Dallas Apartments, Farmers market, deep Ellum, highland park, Park Cities, Kessler Park, Bishop Arts District, Knox/Henderson, Medical District, Design District, Midtown, North Dallas, Northeast Dallas, Northwest Dallas, Old East Dallas, Far North Dallas, South Dallas, Southeast Dallas, Uptown, Uptown Dallas apartments, Uptown Dallas, Addison apartments, Allen apartments, Carrollton apartments, Farmers Branch apartments, Frisco, Frisco apartments, Lake highlands apartments, Mckinney apartments, Mckinney, Richardson Apartments, Rockwall apartments, the colony, Las Colinas apartments, Irving apartments, South Irving apartments, North Irving apartments, Valley Ranch Apartments, Plano apartments, Central Plano apartments, West Plano apartments, East plano apartments, Ft.Worth apartments, Arlington apartments, Mid Cities apartments"
    ],
    "duplicates": []
  },
  {
    "price": "$1310",
    "title": "6 weeks free upfront + Cash rebate",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-6-weeks-free-upfront-cash-rebate/7122777639.html",
    "description": [
      "Contact info:",
      "Cole McCullough | Dash Realty |",
      "show contact info",
      "Reference Apartment #292 ; Application FEE $75 ADMIN FEE $175",
      "$1,250/mo",
      "KEY FEATURES",
      "Sq Footage:",
      "665sqft.",
      "Bedrooms:",
      "1 Bed",
      "Bathrooms:",
      "1 Bath",
      "Parking:",
      "Parking Garage | Guest parking",
      "Lease Duration:",
      "1 Year",
      "Pets Policy:",
      "Cats & Dogs OK",
      "Laundry:",
      "In Unit",
      "Property Type:",
      "Apartment",
      "DESCRIPTION",
      "Where you call home touches every aspect of your life. This community was carefully designed for the person ready for the next chapter in luxury living. A short drive from downtown Dallas and an easy walk to local retailers, up-and-coming restaurants and bars with endless charm, This community is perfectly located for a life well-lived.",
      "Be sure to call/text Cole McCullough with Dash Realty at",
      "show contact info",
      "in order to receive specials, schedule a tour, or for more information. Please remember my services are FREE to you, the apartment complex pays for my referral and that is how I am able to get you certain specials that are not always available to the public!!",
      "RENTAL FEATURES",
      "Living room",
      "Dining room",
      "Walk-in closet",
      "Master bath",
      "Storage space",
      "Pantry",
      "Recreation room",
      "Range / Oven",
      "Refrigerator",
      "Dishwasher",
      "Microwave",
      "Garbage disposal",
      "Stainless steel appliances",
      "Freezer",
      "Balcony, Deck, or Patio",
      "Heat: forced air",
      "Central A/C",
      "Air conditioning",
      "Ceiling fans",
      "Cable-ready",
      "High-speed internet",
      "Wired",
      "Hardwood floor",
      "Granite countertop",
      "High / Vaulted ceiling",
      "COMMUNITY FEATURES",
      "New property",
      "Elevator",
      "Secured entry",
      "Controlled access",
      "Gated entry",
      "Disability access",
      "Shared pool",
      "Fitness center",
      "Near transportation",
      "Clubhouse",
      "Barbecue",
      "Business center",
      "Guest parking",
      "Off-street parking",
      "Covered parking",
      "On-street parking",
      "Garage - Attached",
      "Contact info:",
      "Cole McCullough",
      "Dash Realty",
      "show contact info",
      "*Prices, Specials, and availability are subject to change at anytime without notice.\nTags: Apartments, Downtown Dallas, East Dallas Apartments, Farmers market, deep Ellum, highland park, Park Cities, Kessler Park, Bishop Arts District, Knox/Henderson, Medical District, Design District, Midtown, North Dallas, Northeast Dallas, Northwest Dallas, Old East Dallas, Far North Dallas, South Dallas, Southeast Dallas, Uptown, Uptown Dallas apartments, Uptown Dallas, Addison apartments, Allen apartments, Carrollton apartments, Farmers Branch apartments, Frisco, Frisco apartments, Lake highlands apartments, Mckinney apartments, Mckinney, Richardson Apartments, Rockwall apartments, the colony, Las Colinas apartments, Irving apartments, South Irving apartments, North Irving apartments, Valley Ranch Apartments, Plano apartments, Central Plano apartments, West Plano apartments, East plano apartments, Ft.Worth apartments, Arlington apartments, Mid Cities apartments"
    ],
    "duplicates": []
  },
  {
    "price": "$1105",
    "title": "Desirable selection of newly renovated one and two-bedroom apartment!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-desirable-selection-of-newly/7122745763.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "Special: $250 off 1st & 2nd mo w/12mo",
      "1 Bedrooms starting at $1,105",
      "2 Bedrooms starting at $1,270",
      "3 Bedrooms starting at $",
      "2 Pools, Fitness center, Laundry room, Gated entrance, Private detached garages($100/mo), Free WiFi Areas, School bus stop, Door to door trash pickup, Game/Sport room, Business center, Assigned parking, Club house, Perimeter fence, Picnic area, Outdoor Grills",
      "Broken Lease",
      "Eviction**Second Chance** We Can Help you, Our Service is FREE",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#7959A"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1270",
    "title": "Desirable selection of newly renovated one and two-bedroom apartment!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-desirable-selection-of-newly/7115838645.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "Special: $250 off 1st & 2nd mo w/12mo",
      "1 Bedrooms starting at $1,105",
      "2 Bedrooms starting at $1,270",
      "3 Bedrooms starting at $",
      "2 Pools, Fitness center, Laundry room, Gated entrance, Private detached garages($100/mo), Free WiFi Areas, School bus stop, Door to door trash pickup, Game/Sport room, Business center, Assigned parking, Club house, Perimeter fence, Picnic area, Outdoor Grills",
      "Broken Lease",
      "Eviction**Second Chance** We Can Help you, Our Service is FREE",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#7959A"
    ],
    "duplicates": []
  },
  {
    "price": "$2025",
    "title": "NEED SPACE?? We Have A Floorplan For That...",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-need-space-we-have-floorplan-for/7109075137.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "1 Bedrooms starting at $1,340",
      "2 Bedrooms starting at $2,025",
      "3 Bedrooms starting at $2,104",
      "Free WiFi Areas, Business center, Outdoor Grills, Door to door trash pickup, Handicap modified units, Perimeter fence, Game/Sport room, School bus stop, Fitness center, Picnic area, Pool, Club house",
      "***Broken Lease***",
      "Accept Eviction  Second Chance We can Help you Our service is Free",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#8673A"
    ],
    "duplicates": []
  },
  {
    "price": "$1755",
    "title": "Come visit today and make us your new home!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-come-visit-today-and-make-us-your/7122737806.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "Special: 1mo free w/12+mo",
      "1 Bedrooms starting at $1,378",
      "2 Bedrooms starting at $1,755",
      "3 Bedrooms starting at $",
      "Handicap modified units, Gated entrance, Furnished units, Outdoor Grills, Elevators, Fitness center, Pool, Dog Park, Free WiFi Areas, Bus stop, Assigned parking, Community parking garage, Business center, Laundry room",
      "Broken Lease",
      "Eviction**Second Chance** We Can Help you, Our Service is FREE",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#5362A"
    ],
    "duplicates": []
  },
  {
    "price": "$1470",
    "title": "☀ Apartment Home in Plano, Elegant Clubhouse, Ample Storage",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-apartment-home-in-plano-elegant/7120383396.html",
    "description": [
      "YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!",
      "Nestled in beautiful Plano, Texas, you'll discover a unique",
      "apartment community at Heritage at Lakeside. Offering one, two,",
      "three and four -bedroom apartment homes with townhome style floor",
      "plans, you will be able to enjoy an open and spacious design. Cozy",
      "up to your wood-burning fireplace, enjoy your designer color scheme",
      "or just relax on your private patio or balcony.",
      "Local Area Amenities",
      "At Heritage at Lakeside apartments, you'll find easy access to the",
      "Dallas North Tollway, 121, and George Bush Turnpike, making any",
      "commute in the Dallas/Fort Worth Metroplex a breeze.",
      "There’s plenty of shopping choices near our Plano Apartments",
      "with The Shops at Legacy less than a mile away.  We are also",
      "conveniently located between Willowbend Mall and Stonebriar",
      "Mall.  For all the health nuts, we are within walking distance",
      "of the Lakeside walking and jogging trails.",
      "Property and Apartment Amenities",
      "Community amenities include a swimming pool, 24-hour fitness",
      "center, elegant clubhouse, complimentary wine room, and large game",
      "room and billiards table.  Our apartments feature gourmet",
      "kitchens with granite countertops, stainless steel appliances,",
      "breakfast nooks, garden tubs, and walk-in closets.",
      "Floorplans",
      "Offering one, two, three and four-bedroom apartment homes with",
      "townhome style floor plans, you will be able to enjoy an open and",
      "spacious design. We have 20 floorplans to choose from ranging in",
      "size from 945 square feet to 2330 square feet.  Every",
      "floorplans comes with an attached garage at no extra charge.",
      "So whether you are looking for apartments in Plano, or nearby in",
      "Hebron or the Colony, Heritage at Lakeside, may be the right fit",
      "for you. Call us today to learn more.",
      "-48-hour Maintenance Commitment",
      "-W/D Connections",
      "-Private Patio and Balcony",
      "-Attached Garages",
      "-Neighborhood Feel",
      "-24-Hour Fitness Center",
      "-Elegant Clubhouse",
      "-Large Game Room with Billiards Table",
      "-Garden Tubs",
      "-Ample Storage",
      "Call:",
      "show contact info",
      "For more information, visit us at: livewithjrk.com/ugp33tjf/HeritageatLakeside"
    ],
    "duplicates": []
  },
  {
    "price": "$1899",
    "title": "New Modern Apt in West Plano; Elevators**SIX WEEKS FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/new-modern-apt-in-west-plano/7115525509.html",
    "description": [
      "New Modern and Stylish Apartment in West Plano close to Dining and Shopping. Enjoy the Luxury of Quartz Countertops, Side by Side Refridgerator, and Stainless Steel Appliances in the Kitchen. Wood Floors, Walk-In Closets, Garden Tubs, with Washer and Dryer Included in Your Modern Apartment Home. Amenities Include a Luxurious Resort Style Swimming Pool, State of the Art Fitness Center, Car Wash Area, Pet Park, Plus So Much More. Parking Garage and Elevators as Well. Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1129",
    "title": "Brand New Apt - 6 Pools, Parks, Jogging Trails ** ONE MONTH FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/brand-new-apt-6-pools-parks-jogging/7109611487.html",
    "description": [
      "Chic and Stylish Apartment Community in the West Plano Area!! Dining, Shopping, and Entertainment, but Also Offers Many Outdoor Activities. Each Apartment Includes; Granite Countertops, Stainless Steel Appliances, and Wood Flooring!! They Also Include; Garden Tub and Walk-In Closet!! This Community Offers a Variety of Floorplans, That One Will Easily Fall in Love With. Amenities Include; 6 Resort-Style Swimming Pools, 24-Hour Fitness Center, Multiple Dog Parks, and Even Easy Access to Many Bike/Hike Trails and the Nature Preserve! This Property Offers a Bundle of Activities, That One Will Love!! Most Importantly, They Have Great Management and Maintenance!! Please Contact Jacquelyn with Dash Realty at",
      "show contact info",
      "For More Information."
    ],
    "duplicates": []
  },
  {
    "price": "$1625",
    "title": "New Apt in West Plano Area; Near Nature Preserve**SIX WEEKS FREE!",
    "href": "https://dallas.craigslist.org/dal/apa/d/new-apt-in-west-plano-area-near-nature/7115306534.html",
    "description": [
      "New Chic and Stylish Apartment Community with Easy Access to The Dallas Tollway, Near 121, and 161. The Nature Preserve, Dining, Shopping, and Entertainment Close By. Enjoy the Luxury of Granite Countertops and Stainless Steel Appliances in the Kitchen. Wood Floors, Walk-In Closets, and Garden Tubs in Your Chic Apartment Home. Amenities Include a Luxurious Resort Style Swimming Pool, Fitness Center, Walking and Biking Trails, and a Pet Park for Your Furry Friends. Great Management and Staff. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1974",
    "title": "♥ Apartments In the middle of Plano, Attached Garages, Standup Showers",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-apartments-in-the-middle-of-plano/7120343736.html",
    "description": [
      "YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!",
      "Nestled in beautiful Plano, Texas, you'll discover a unique",
      "apartment community at Heritage at Lakeside. Offering one, two,",
      "three and four -bedroom apartment homes with townhome style floor",
      "plans, you will be able to enjoy an open and spacious design. Cozy",
      "up to your wood-burning fireplace, enjoy your designer color scheme",
      "or just relax on your private patio or balcony.",
      "Local Area Amenities",
      "At Heritage at Lakeside apartments, you'll find easy access to the",
      "Dallas North Tollway, 121, and George Bush Turnpike, making any",
      "commute in the Dallas/Fort Worth Metroplex a breeze.",
      "There’s plenty of shopping choices near our Plano Apartments",
      "with The Shops at Legacy less than a mile away.  We are also",
      "conveniently located between Willowbend Mall and Stonebriar",
      "Mall.  For all the health nuts, we are within walking distance",
      "of the Lakeside walking and jogging trails.",
      "Property and Apartment Amenities",
      "Community amenities include a swimming pool, 24-hour fitness",
      "center, elegant clubhouse, complimentary wine room, and large game",
      "room and billiards table.  Our apartments feature gourmet",
      "kitchens with granite countertops, stainless steel appliances,",
      "breakfast nooks, garden tubs, and walk-in closets.",
      "Floorplans",
      "Offering one, two, three and four-bedroom apartment homes with",
      "townhome style floor plans, you will be able to enjoy an open and",
      "spacious design. We have 20 floorplans to choose from ranging in",
      "size from 945 square feet to 2330 square feet.  Every",
      "floorplans comes with an attached garage at no extra charge.",
      "So whether you are looking for apartments in Plano, or nearby in",
      "Hebron or the Colony, Heritage at Lakeside, may be the right fit",
      "for you. Call us today to learn more.",
      "-Complimentary Wine Room",
      "-48-hour Maintenance Commitment",
      "-Private Patio and Balcony",
      "-Attached Garages",
      "-Elegant Clubhouse",
      "-Ample Storage",
      "-Standup Showers",
      "-Neighborhood Feel",
      "-Split-Level Townhome Floorplans",
      "-Ceramic Tile Entryways",
      "Call:",
      "show contact info",
      "For more information, visit us at: livewithjrk.com/pfrxjouw/HeritageatLakeside"
    ],
    "duplicates": []
  },
  {
    "price": "$1325",
    "title": "FREE FREE FREE 1 MONTH!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-free-free-free-1-month/7122519687.html",
    "description": [
      "Live Life! Love Life! Certified at LEED Gold and equipped with an array of rooftop solar panels. Access to a resort-style pool lined with cabanas, landscaped courtyards, a 24/7 fitness center and pet amenities.",
      "W/D connections, W/D machines, walk-in closets, large tubs, walk-in showers, private patios/balconies and many more features. A total MUST see!",
      "Call or TEXT for more information or showing! Thank you.",
      "John Wingate/ BROKER",
      "show contact info"
    ],
    "duplicates": []
  },
  {
    "price": "$1042",
    "title": "WALK TO THE THEATER, RESTAURANTS & SHOPPING",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-walk-to-the-theater-restaurants/7122489900.html",
    "description": [
      "This community has direct access to Cinemark Theater, and West Plano Village restaurants. Residents also enjoy convenient access to the Dallas North tollway with both Dallas Love Field and DFW International Airports with in a 20 minute drive. Residents enjoy outstanding amenities including a resort style swimming pool, private poolside cabanas, covered outdoor kitchen with fireplace and televisions, 24 hour state of the art fitness center, resident business center and conference room, and java bar. Our pet friendly community also offers a paw wash and private parking in a gated garage.",
      "For more information call or register online: http://www.dallasapartment.co",
      "show contact info",
      "Refer to Apt#5362A",
      "100% FREE SERVICE WITH A LICENSED AGENT!",
      "Efficiency $962 /mo 632 sf",
      "1 bedroom $1,016-1,551 /mo 715-912 sf",
      "2 bedroom $1,746-2,683 /mo 1,083-1,355 sf",
      "Deposit: 150-250 Pet Policy: Cats:Yes Dogs:Yes",
      "Built: 2015 Location: West Plano/ Frisco",
      "Community Amenities: School bus stop, Business center, Laundry room, BBQ grills, Elevators, Bus stop, Pool, Fitness center, Community parking garage, Furnished units, Gated entrance, Handicap modified units",
      "Unit Amenities: Microwaves, High ceilings, Private patios/balconies, Custom carpet, Hi-speed internet, Garden/large tubs, Miniblinds, Non-carpeted flooring, Ice makers, W/D connections, Ceiling fans, Dishwashers, Self cleaning ovens, Cable ready, Intrusion alarms, Walk-in showers, W/D machines, Walk-in closets, Garbage disposals, Frost free refrigerators",
      "Christa Dugger | Real Estate Agent | 1 Source",
      "Please contact me directly to schedule an appointment.",
      "Prices & Specials change daily, contact me for availability.",
      "All units do not have the advertised features or amenities."
    ],
    "duplicates": []
  },
  {
    "price": "$2098",
    "title": "Beautiful 3bed 2bath Townhouse available in July!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-beautiful-3bed-2bath-townhouse/7122493629.html",
    "description": [
      "To schedule a tour",
      "We now book our tour appointments online! Please call or text us at\n",
      "show contact info",
      "to self-schedule from your phone! Book your appointment online today or anytime 24/7!",
      "Property Description",
      "Not your \"plain-o\" in Plano!  Don't let the traditional exterior fool you...The Livingston is taking luxury living to new heights with hip, contemporary finishes and a thoroughly forward-thinking collection of amenities.",
      "Our gated community features spacious 1-, 2- and 3-bedroom apartments.  Need more room? Stretch out in a two-story townhome.  Attached garages and covered parking are also available.  A few of the design details include stainless appliances, granite countertops, tiled backsplashes in the kitchens, designer lighting, vaulted ceilings, hardwood flooring and fireplaces.",
      "The amenities received the once-over, too.  The legendary pool, which is a big draw for residents, has gotten even more fabulous, with an outdoor kitchen. The clubhouse is the new \"hot-spot\" or social hub for residents with free Wi-Fi, outdoor verandah with sectional sofa seating, and fireplace. Watch the game or grab a cup of java. Make new friends at the grill or make time for yourself in the fitness center- with all new top-of-the-line equipment.",
      "And now the location.  No need to upgrade there, we are already located in one of the best cities in the DFW area.  Plano, TX is known for great shopping, the best schools, fine dining and a great quality of life. We are close to everything including The Shops at Willow Bend, The Shops at Legacy, Stonebriar Centre, Pinstack Plano, Top Golf, Fin Sushi and Sake Bar, Arbor Hills Nature Preserves, Uptown Yoga.",
      "Details",
      "Availability date:",
      "July 8, 2020",
      "Pets:",
      "Allowed",
      "Pet notes:",
      "2 pet limit, some breed restrictions",
      "Deposit:",
      "$350",
      "Leasing options:",
      "Move in special!! Call",
      "show contact info",
      "for more details",
      "Leasing notes:",
      "None",
      "Application fee:",
      "$50 per adult over 18 years of age",
      "Amenities",
      "Included in Utilities Cost:",
      "Utilities Cost:",
      "Laundry:",
      "In Unit Connections",
      "Parking type:",
      "Attached Garage",
      "Parking notes:",
      "Appliances:",
      "Dishwasher, Refrigerator, Garbage disposal, Microwave, Range/Oven",
      "Exterior:",
      "Balcony/patio, Sprinkler system",
      "Heating/cooling:",
      "Central AC, Air conditioning, Ceiling fans",
      "Wiring:",
      "Cable-ready, High-speed internet",
      "Facilities and Recreation:",
      "Shared pool, Fitness center, Clubhouse, Barbecue, Business center, Paw Spa",
      "Security and Access:",
      "Controlled access, Gated entry",
      "Views:",
      "Additional features:",
      "Hardwood floor, Granite countertop, Fireplace, Non-Smoking Property",
      "Offered by:",
      "The Livingston",
      "Equal Housing Opportunity"
    ],
    "duplicates": []
  },
  {
    "price": "$1974",
    "title": "► Apartments in Plano, Garden Tubs, Sparkling Swimming Pool",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-apartments-in-plano-garden-tubs/7121469393.html",
    "description": [
      "YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!",
      "Nestled in beautiful Plano, Texas, you'll discover a unique",
      "apartment community at Heritage at Lakeside. Offering one, two,",
      "three and four -bedroom apartment homes with townhome style floor",
      "plans, you will be able to enjoy an open and spacious design. Cozy",
      "up to your wood-burning fireplace, enjoy your designer color scheme",
      "or just relax on your private patio or balcony.",
      "Local Area Amenities",
      "At Heritage at Lakeside apartments, you'll find easy access to the",
      "Dallas North Tollway, 121, and George Bush Turnpike, making any",
      "commute in the Dallas/Fort Worth Metroplex a breeze.",
      "There’s plenty of shopping choices near our Plano Apartments",
      "with The Shops at Legacy less than a mile away.  We are also",
      "conveniently located between Willowbend Mall and Stonebriar",
      "Mall.  For all the health nuts, we are within walking distance",
      "of the Lakeside walking and jogging trails.",
      "Property and Apartment Amenities",
      "Community amenities include a swimming pool, 24-hour fitness",
      "center, elegant clubhouse, complimentary wine room, and large game",
      "room and billiards table.  Our apartments feature gourmet",
      "kitchens with granite countertops, stainless steel appliances,",
      "breakfast nooks, garden tubs, and walk-in closets.",
      "Floorplans",
      "Offering one, two, three and four-bedroom apartment homes with",
      "townhome style floor plans, you will be able to enjoy an open and",
      "spacious design. We have 20 floorplans to choose from ranging in",
      "size from 945 square feet to 2330 square feet.  Every",
      "floorplans comes with an attached garage at no extra charge.",
      "So whether you are looking for apartments in Plano, or nearby in",
      "Hebron or the Colony, Heritage at Lakeside, may be the right fit",
      "for you. Call us today to learn more.",
      "-Garden Tubs",
      "-Private Patio and Balcony",
      "-Ceramic Tile Entryways",
      "-48-hour Maintenance Commitment",
      "-Neighborhood Feel",
      "-24-Hour Fitness Center",
      "-Friendly Staff",
      "-Large Game Room with Billiards Table",
      "-Split-Level Townhome Floorplans",
      "-Sparkling Swimming Pool",
      "Call:",
      "show contact info",
      "For more information, visit us at: livewithjrk.com/6lon5cyy/HeritageatLakeside"
    ],
    "duplicates": []
  },
  {
    "price": "$1821",
    "title": "Beautiful 2bed 2bath Townhouse available in June!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-beautiful-2bed-2bath-townhouse/7122490762.html",
    "description": [
      "To schedule a tour",
      "We now book our tour appointments online! Please call or text us at\n",
      "show contact info",
      "to self-schedule from your phone! Book your appointment online today or anytime 24/7!",
      "Property Description",
      "Not your \"plain-o\" in Plano!  Don't let the traditional exterior fool you...The Livingston is taking luxury living to new heights with hip, contemporary finishes and a thoroughly forward-thinking collection of amenities.",
      "Our gated community features spacious 1-, 2- and 3-bedroom apartments.  Need more room? Stretch out in a two-story townhome.  Attached garages and covered parking are also available.  A few of the design details include stainless appliances, granite countertops, tiled backsplashes in the kitchens, designer lighting, vaulted ceilings, hardwood flooring and fireplaces.",
      "The amenities received the once-over, too.  The legendary pool, which is a big draw for residents, has gotten even more fabulous, with an outdoor kitchen. The clubhouse is the new \"hot-spot\" or social hub for residents with free Wi-Fi, outdoor verandah with sectional sofa seating, and fireplace. Watch the game or grab a cup of java. Make new friends at the grill or make time for yourself in the fitness center- with all new top-of-the-line equipment.",
      "And now the location.  No need to upgrade there, we are already located in one of the best cities in the DFW area.  Plano, TX is known for great shopping, the best schools, fine dining and a great quality of life. We are close to everything including The Shops at Willow Bend, The Shops at Legacy, Stonebriar Centre, Pinstack Plano, Top Golf, Fin Sushi and Sake Bar, Arbor Hills Nature Preserves, Uptown Yoga.",
      "Details",
      "Availability date:",
      "June 10, 2020",
      "Pets:",
      "Allowed",
      "Pet notes:",
      "2 pet limit, some breed restrictions",
      "Deposit:",
      "$250",
      "Leasing options:",
      "Move in special!! Call",
      "show contact info",
      "for more details",
      "Leasing notes:",
      "None",
      "Application fee:",
      "$50 per adult over 18 years of age",
      "Amenities",
      "Included in Utilities Cost:",
      "Utilities Cost:",
      "Laundry:",
      "In Unit Connections",
      "Parking type:",
      "Attached Garage",
      "Parking notes:",
      "Appliances:",
      "Dishwasher, Refrigerator, Garbage disposal, Microwave, Range/Oven",
      "Exterior:",
      "Balcony/patio, Sprinkler system",
      "Heating/cooling:",
      "Central AC, Air conditioning, Ceiling fans",
      "Wiring:",
      "Cable-ready, High-speed internet",
      "Facilities and Recreation:",
      "Shared pool, Fitness center, Clubhouse, Barbecue, Business center, Paw Spa",
      "Security and Access:",
      "Controlled access, Gated entry",
      "Views:",
      "Additional features:",
      "Hardwood floor, Granite countertop, Fireplace, Non-Smoking Property",
      "Offered by:",
      "The Livingston",
      "Equal Housing Opportunity"
    ],
    "duplicates": []
  },
  {
    "price": "$1320",
    "title": "Beautiful 1bed/1bath apartment available in May!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-beautiful-1bed-1bath-apartment/7122487963.html",
    "description": [
      "To schedule a tour",
      "We now book our tour appointments online! Please call or text us at\n",
      "show contact info",
      "to self-schedule from your phone! Book your appointment online today or anytime 24/7!",
      "Property Description",
      "Not your \"plain-o\" in Plano!  Don't let the traditional exterior fool you...The Livingston is taking luxury living to new heights with hip, contemporary finishes and a thoroughly forward-thinking collection of amenities.",
      "Our gated community features spacious 1-, 2- and 3-bedroom apartments.  Need more room? Stretch out in a two-story townhome.  Attached garages and covered parking are also available.  A few of the design details include stainless appliances, granite countertops, tiled backsplashes in the kitchens, designer lighting, vaulted ceilings, hardwood flooring and fireplaces.",
      "The amenities received the once-over, too.  The legendary pool, which is a big draw for residents, has gotten even more fabulous, with an outdoor kitchen. The clubhouse is the new \"hot-spot\" or social hub for residents with free Wi-Fi, outdoor verandah with sectional sofa seating, and fireplace. Watch the game or grab a cup of java. Make new friends at the grill or make time for yourself in the fitness center- with all new top-of-the-line equipment.",
      "And now the location.  No need to upgrade there, we are already located in one of the best cities in the DFW area.  Plano, TX is known for great shopping, the best schools, fine dining and a great quality of life. We are close to everything including The Shops at Willow Bend, The Shops at Legacy, Stonebriar Centre, Pinstack Plano, Top Golf, Fin Sushi and Sake Bar, Arbor Hills Nature Preserves, Uptown Yoga.",
      "Details",
      "Availability date:",
      "May 16, 2020",
      "Pets:",
      "allowed",
      "Pet notes:",
      "2 pet limit, some breed restrictions",
      "Deposit:",
      "$150",
      "Leasing options:",
      "Move in specials!! Call",
      "show contact info",
      "for more details",
      "Leasing notes:",
      "Application fee:",
      "$50 per adult over 18 years of age",
      "Amenities",
      "Included in Utilities Cost:",
      "Utilities Cost:",
      "Laundry:",
      "In Unit Connections",
      "Parking type:",
      "Open",
      "Parking notes:",
      "Appliances:",
      "Dishwasher, Refrigerator, Garbage disposal, Microwave, Range/Oven",
      "Exterior:",
      "Balcony/patio, Sprinkler system",
      "Heating/cooling:",
      "Central AC, Air conditioning, Ceiling fans",
      "Wiring:",
      "Cable-ready, High-speed internet",
      "Facilities and Recreation:",
      "Shared pool, Fitness center, Clubhouse, Barbecue, Business center, Paw Spa",
      "Security and Access:",
      "Controlled access, Gated entry",
      "Views:",
      "Additional features:",
      "Hardwood floor, Granite countertop, Fireplace, Non-Smoking Property",
      "Offered by:",
      "The Livingston",
      "Equal Housing Opportunity"
    ],
    "duplicates": []
  },
  {
    "price": "$2339",
    "title": "Walk to New Local Restaurants and Bars",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-walk-to-new-local-restaurants-and/7109435434.html",
    "description": [
      "Where you call home touches every aspect of your life. Broadstone Evoke was carefully designed for the person ready for the next chapter in luxury living.",
      "Community Amenities: State-of-the-art gym featuring Technogym equipment along with weight training equipment, Private Spin Studio with Fitness on Demand, Full-service Technology Lounge: Copier, fax & printer, Private conference room, WiFi in all common areas, Car wash stations, Fido Friendly: Paw Park, Paw Spa, Grand social room with catering kitchen, Indoor/outdoor lounge with televisions, Courtyard features: Grand fireside retreat, Bocce ball court, Cornhole, Outdoor ping pong and foosball table, Multiple entertaining areas, Outdoor BBQ kitchens, Serene hammock courtyard, Resort-inspired swimming pool with Rain Curtain water feature, 24-hour emergency maintenance, Professionally landscaped grounds, Conveniently located trash chutes, Controlled access gates & buildings, Climate-controlled corridors, Elevator access, Parking Garage, Package Concierge System.",
      "Interior Amenities: Plush carpeting in bedrooms, Ceiling fans in living & bedrooms, Full-size washer/dryers included, Recessed lighting, Quartz countertops, Modern fixtures, Stainless steel appliances, Self-cleaning ovens, Side-by-side refrigerators with ice makers, Built-in microwaves, Multi-cycle dishwashers, Built-in wine racks, Under-counter lighting, Expansive closets with custom shelving, Open concept living spaces, Sizeable linen closets, Spacious pantries, Nest thermostats, USB outlets, Electronic unit entry, High-speed Internet access, Digital cable TV available, Sonos sound systems.",
      "Please Call or Text Manny at ---",
      "show contact info",
      "for more info or to make an appointment!!"
    ],
    "duplicates": []
  },
  {
    "price": "$1156",
    "title": "New Luxury Plano Apartments",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-new-luxury-plano-apartments/7109434104.html",
    "description": [
      "Brand new luxury Plano apartments ideally located in the heart of West Plano Village. With direct access to Cinemark Theater, EatZi’s and West Plano Village restaurants. Residents of our mid-rise West Plano apartments also enjoy convenient access to the Dallas North Tollway with both Dallas Love Field and DFW International Airports within a 20-minute drive.",
      "Community Amenities:  LEED Gold Certified community, Adjacent to eatZi’s, West Plano Village restaurants and Cinemark Theater, Located in exemplary Plano school district, Resort-style swimming pool with beach entry, Covered outdoor kitchen with fireplace and televisions, Private poolside cabanas, Two landscaped courtyards, Private resident parking in gated garage, 24-hour state-of-the-art fitness center, Resident business center and conference room, Java bar featuring Starbucks coffee, Pet-friendly community with paw wash, Storage units available, Trash and recycling center, Clothes care facility.",
      "Interior Amenities:  Fully-equipped kitchens with stainless steel appliances, Side-by-side refrigerators with ice/water dispensers, Elegant slab granite countertops in kitchens and bathrooms, Espresso kitchen cabinets with satin nickel hardware, Undermount extra deep stainless sink in kitchens, MasterWood plank flooring in living/dining areas, kitchens and entries, Designer lighting package with pendant lights in kitchens, Ceiling fans in living rooms and bedrooms, Oversized garden tubs with tile surround, Five-panel interior doors, USB outlet in master bedrooms for charging electronics, Spacious patios and balconies.",
      "Contact Today: Manny Vasquez -----",
      "show contact info",
      "by phone or Text"
    ],
    "duplicates": []
  },
  {
    "price": "$935",
    "title": "Plano 1/1 $935- 2 Pools, Free WiFi Areas, Perimeter fence, Coit Rd",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-plano-pools-free-wifi-areas/7122468688.html",
    "description": [
      "Plano 1/1 $935-1195/ 677-827 sq ft",
      "Exterior Amenities: 2 Pools, Free WiFi Areas, Perimeter fence, Assigned parking, Door to door trash pickup, Club house, Hot Tub, Tennis court, Picnic area, Outdoor Grills, Laundry room, School bus stop, Play ground, W/D rental($40/mo), Carports, Bus stop",
      "Interior Amenities: W/D connections, Walk-in closets, Private patios/balconies, Cable ready, Hi-speed internet, High ceilings, Custom carpet, Non-carpeted flooring, Premium Appliances, Dishwashers, Garbage disposals, Fire places, Ceiling fans, Miniblinds, Wet bars, Microwaves, Frost free refrigerators",
      "Call/Text",
      "show contact info",
      "ask for Bryan- Free apartment locator, all areas, all situations, all credit.",
      "Reference Ad# 677",
      "*pics are of model apartments at this location*",
      "**All information is deemed accurate but not guaranteed, pricing and policies are subject to change without notice.",
      "Spirit Real Estate Group"
    ],
    "duplicates": []
  },
  {
    "price": "$1470",
    "title": "☆ Great apartments located in Plano, Friendly Staff, Breakfast Nooks",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-great-apartments-located-in-plano/7120298023.html",
    "description": [
      "YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!",
      "Nestled in beautiful Plano, Texas, you'll discover a unique",
      "apartment community at Heritage at Lakeside. Offering one, two,",
      "three and four -bedroom apartment homes with townhome style floor",
      "plans, you will be able to enjoy an open and spacious design. Cozy",
      "up to your wood-burning fireplace, enjoy your designer color scheme",
      "or just relax on your private patio or balcony.",
      "Local Area Amenities",
      "At Heritage at Lakeside apartments, you'll find easy access to the",
      "Dallas North Tollway, 121, and George Bush Turnpike, making any",
      "commute in the Dallas/Fort Worth Metroplex a breeze.",
      "There’s plenty of shopping choices near our Plano Apartments",
      "with The Shops at Legacy less than a mile away.  We are also",
      "conveniently located between Willowbend Mall and Stonebriar",
      "Mall.  For all the health nuts, we are within walking distance",
      "of the Lakeside walking and jogging trails.",
      "Property and Apartment Amenities",
      "Community amenities include a swimming pool, 24-hour fitness",
      "center, elegant clubhouse, complimentary wine room, and large game",
      "room and billiards table.  Our apartments feature gourmet",
      "kitchens with granite countertops, stainless steel appliances,",
      "breakfast nooks, garden tubs, and walk-in closets.",
      "Floorplans",
      "Offering one, two, three and four-bedroom apartment homes with",
      "townhome style floor plans, you will be able to enjoy an open and",
      "spacious design. We have 20 floorplans to choose from ranging in",
      "size from 945 square feet to 2330 square feet.  Every",
      "floorplans comes with an attached garage at no extra charge.",
      "So whether you are looking for apartments in Plano, or nearby in",
      "Hebron or the Colony, Heritage at Lakeside, may be the right fit",
      "for you. Call us today to learn more.",
      "-Ceiling Fans in Bedrooms and Living Rooms",
      "-Sparkling Swimming Pool",
      "-Walk-in Closet",
      "-Built-in Computer Desks",
      "-Complimentary Wine Room",
      "-Private Patio and Balcony",
      "-Split-Level Townhome Floorplans",
      "-Friendly Staff",
      "-Stainless Steel Appliances",
      "-Breakfast Nooks",
      "Call:",
      "show contact info",
      "For more information, visit us at: livewithjrk.com/ajebijpn/HeritageatLakeside"
    ],
    "duplicates": []
  },
  {
    "price": "$1140",
    "title": "West Plano 1/1 $1140-$1585/ Fitness center, 2 Pools, Windcrest Dr",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-west-plano-fitness-center-2-pools/7122410125.html",
    "description": [
      "West Plano 1/1 $1140-1585 / 723-898 sq ft",
      "Exterior Amenities: Fitness center, 2 Pools, Business center, Gated entrance, Perimeter fence, Private detached garages($150/mo), Door to door trash pickup, Club house, Picnic area, Outdoor Grills, Game/Sport room, School bus stop, Handicap modified units, Bus stop",
      "Interior Amenities: W/D connections, Walk-in closets, Garden/large tubs, Walk-in showers, Private patios/balconies, Attached garages, Cable ready, Hi-speed internet, High ceilings, Storage closet outside, Custom built-ins, Ice makers, Premium Countertops, Premium Appliances, Self cleaning ovens",
      "Call/Text",
      "show contact info",
      "ask for Bryan- Free apartment locator, all areas, all situations, all credit.",
      "Reference ad 195",
      "*pics are of model apartments at this location*",
      "**All information is deemed accurate but not guaranteed, pricing and policies are subject to change without notice.",
      "Spirit Real Estate Group"
    ],
    "duplicates": []
  },
  {
    "price": "$1757",
    "title": "Both Dallas Airports Within 20 Minutes!",
    "href": "https://dallas.craigslist.org/dal/apa/d/both-dallas-airports-within-20-minutes/7107411549.html",
    "description": [
      "Brand new luxury Plano apartments ideally located in the heart of West Plano Village. With direct access to Cinemark Theater, EatZi's and West Plano Village restaurants. Residents of our mid-rise West Plano apartments also enjoy convenient access to the Dallas North Tollway with both Dallas Love Field and DFW International Airports within a 20-minute drive.",
      "Community Amenities:  LEED Gold Certified community, Adjacent to eatZi's, West Plano Village restaurants and Cinemark Theater, Located in exemplary Plano school district, Resort-style swimming pool with beach entry, Covered outdoor kitchen with fireplace and televisions, Private poolside cabanas, Two landscaped courtyards, Private resident parking in gated garage, 24-hour state-of-the-art fitness center, Resident business center and conference room, Java bar featuring Starbucks coffee, Pet-friendly community with paw wash, Storage units available, Trash and recycling center, Clothes care facility.",
      "Interior Amenities:  Fully-equipped kitchens with stainless steel appliances, Side-by-side refrigerators with ice/water dispensers, Elegant slab granite countertops in kitchens and bathrooms, Espresso kitchen cabinets with satin nickel hardware, Undermount extra deep stainless sink in kitchens, MasterWood plank flooring in living/dining areas, kitchens and entries, Designer lighting package with pendant lights in kitchens, Ceiling fans in living rooms and bedrooms, Oversized garden tubs with tile surround, Five-panel interior doors, USB outlet in master bedrooms for charging electronics, Spacious patios and balconies.",
      "Call or Text Manny to Make an Appointment at...  9.7.2..6.8.9..6.3.3.3"
    ],
    "duplicates": []
  },
  {
    "price": "$2844",
    "title": "☀ Beautiful Plano apartments, Wood-Burning Fireplaces, Ample Storage",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-beautiful-plano-apartments-wood/7121384560.html",
    "description": [
      "YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!",
      "Nestled in beautiful Plano, Texas, you'll discover a unique",
      "apartment community at Heritage at Lakeside. Offering one, two,",
      "three and four -bedroom apartment homes with townhome style floor",
      "plans, you will be able to enjoy an open and spacious design. Cozy",
      "up to your wood-burning fireplace, enjoy your designer color scheme",
      "or just relax on your private patio or balcony.",
      "Local Area Amenities",
      "At Heritage at Lakeside apartments, you'll find easy access to the",
      "Dallas North Tollway, 121, and George Bush Turnpike, making any",
      "commute in the Dallas/Fort Worth Metroplex a breeze.",
      "There’s plenty of shopping choices near our Plano Apartments",
      "with The Shops at Legacy less than a mile away.  We are also",
      "conveniently located between Willowbend Mall and Stonebriar",
      "Mall.  For all the health nuts, we are within walking distance",
      "of the Lakeside walking and jogging trails.",
      "Property and Apartment Amenities",
      "Community amenities include a swimming pool, 24-hour fitness",
      "center, elegant clubhouse, complimentary wine room, and large game",
      "room and billiards table.  Our apartments feature gourmet",
      "kitchens with granite countertops, stainless steel appliances,",
      "breakfast nooks, garden tubs, and walk-in closets.",
      "Floorplans",
      "Offering one, two, three and four-bedroom apartment homes with",
      "townhome style floor plans, you will be able to enjoy an open and",
      "spacious design. We have 20 floorplans to choose from ranging in",
      "size from 945 square feet to 2330 square feet.  Every",
      "floorplans comes with an attached garage at no extra charge.",
      "So whether you are looking for apartments in Plano, or nearby in",
      "Hebron or the Colony, Heritage at Lakeside, may be the right fit",
      "for you. Call us today to learn more.",
      "-Standup Showers",
      "-Wood-Burning Fireplaces",
      "-Complimentary Wine Room",
      "-Digital Cable & Satellite TV",
      "-Online Payments Available",
      "-Neighborhood Feel",
      "-24-Hour Fitness Center",
      "-Sparkling Swimming Pool",
      "-Ample Storage",
      "-48-hour Maintenance Commitment",
      "Call:",
      "show contact info",
      "For more information, visit us at: livewithjrk.com/bluyy5uo/HeritageatLakeside"
    ],
    "duplicates": []
  },
  {
    "price": "$1",
    "title": "EVICTION * FELONY * BROKEN LEASE * MISDEMEANOR",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-eviction-felony-broken-lease/7115294341.html",
    "description": [
      "Hello, my name is Laura and I am a licensed Texas Real Estate Agent / Apartment Locator. I have a love for helping people locate apartments and find their forever home. I take pride in providing my clients with the best customer service and helping them select the best apartment. I specialize in LuxuryApartments, Second Chance, Mid Rise, High Rise, and Penthouse.",
      "Laura Bavec",
      "AGENT | Apartment Locator",
      "Core One Real Estate",
      "100% Free Service",
      "Start your search: https://laura.coreonerealestate.com",
      "Or Call/ Text",
      "show contact info",
      "Please include the following upon request:",
      "1. First and Last Name",
      "2. E-mail",
      "3. Preferred Move Date",
      "4. Desired Location",
      "5. Price Range",
      "Tags: Uptown, Dallas, Downtown, Design District, Medical District, Farmers Market, Deep Ellum, Knox/Henderson, Midtown, Far North Dallas, Addison, Richardson, Plano, McKinney, Allen, Frisco, Las Colinas, Grapevine, Lewisville"
    ],
    "duplicates": []
  },
  {
    "price": "$2025",
    "title": "NEED SPACE?? We Have A Floorplan For That...",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-need-space-we-have-floorplan-for/7115383998.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "1 Bedrooms starting at $1,340",
      "2 Bedrooms starting at $2,025",
      "3 Bedrooms starting at $2,104",
      "Free WiFi Areas, Business center, Outdoor Grills, Door to door trash pickup, Handicap modified units, Perimeter fence, Game/Sport room, School bus stop, Fitness center, Picnic area, Pool, Club house",
      "Broken Lease",
      "Eviction**Second Chance** We Can Help you, Our Service is FREE",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#8673A"
    ],
    "duplicates": []
  },
  {
    "price": "$1470",
    "title": "☀ Plano Apartment Homes, Ample Storage, Garden Tubs",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-plano-apartment-homes-ample/7122325818.html",
    "description": [
      "YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!",
      "Nestled in beautiful Plano, Texas, you'll discover a unique",
      "apartment community at Heritage at Lakeside. Offering one, two,",
      "three and four -bedroom apartment homes with townhome style floor",
      "plans, you will be able to enjoy an open and spacious design. Cozy",
      "up to your wood-burning fireplace, enjoy your designer color scheme",
      "or just relax on your private patio or balcony.",
      "Local Area Amenities",
      "At Heritage at Lakeside apartments, you'll find easy access to the",
      "Dallas North Tollway, 121, and George Bush Turnpike, making any",
      "commute in the Dallas/Fort Worth Metroplex a breeze.",
      "There’s plenty of shopping choices near our Plano Apartments",
      "with The Shops at Legacy less than a mile away.  We are also",
      "conveniently located between Willowbend Mall and Stonebriar",
      "Mall.  For all the health nuts, we are within walking distance",
      "of the Lakeside walking and jogging trails.",
      "Property and Apartment Amenities",
      "Community amenities include a swimming pool, 24-hour fitness",
      "center, elegant clubhouse, complimentary wine room, and large game",
      "room and billiards table.  Our apartments feature gourmet",
      "kitchens with granite countertops, stainless steel appliances,",
      "breakfast nooks, garden tubs, and walk-in closets.",
      "Floorplans",
      "Offering one, two, three and four-bedroom apartment homes with",
      "townhome style floor plans, you will be able to enjoy an open and",
      "spacious design. We have 20 floorplans to choose from ranging in",
      "size from 945 square feet to 2330 square feet.  Every",
      "floorplans comes with an attached garage at no extra charge.",
      "So whether you are looking for apartments in Plano, or nearby in",
      "Hebron or the Colony, Heritage at Lakeside, may be the right fit",
      "for you. Call us today to learn more.",
      "-Breakfast Nooks",
      "-Garden Tubs",
      "-Complimentary Wine Room",
      "-Elegant Clubhouse",
      "-Neighborhood Feel",
      "-Gourmet Kitchens with Granite Countertops",
      "-Ample Storage",
      "-Private Patio and Balcony",
      "-Friendly Staff",
      "-Online Payments Available",
      "Call:",
      "show contact info",
      "For more information, visit us at: livewithjrk.com/7ct2fzj5/HeritageatLakeside"
    ],
    "duplicates": []
  },
  {
    "price": "$1799",
    "title": "New Apartment in West Plano with Elevators**Resort-Style Pool!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/new-apartment-in-west-plano-with/7111686225.html",
    "description": [
      "New Luxury and Chic Apartment in West Plano with Dining, Shopping, and Entertainment at Your Door Step! Enjoy the Luxury of White Granite Countertops and Clean Steel Appliances in the Kitchen. Wood Floors, Walk-In Closets, and Garden Tubs in Your Luxury Apartment Home. Amenities Include a Luxe Resort Style Swimming Pool, Cabanas, Health Club, Wellness Studio, Keyless Controlled Entry, Walking Paths, Pet Parks, and Pet Spa for your Dogs, Plus So Much More! Parking Garage and Elevators! Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$3044",
    "title": "☆ Apartment Home in Plano, Built-in Computer Desks, Ample Storage",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-apartment-home-in-plano-built-in/7121331924.html",
    "description": [
      "YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!",
      "Nestled in beautiful Plano, Texas, you'll discover a unique",
      "apartment community at Heritage at Lakeside. Offering one, two,",
      "three and four -bedroom apartment homes with townhome style floor",
      "plans, you will be able to enjoy an open and spacious design. Cozy",
      "up to your wood-burning fireplace, enjoy your designer color scheme",
      "or just relax on your private patio or balcony.",
      "Local Area Amenities",
      "At Heritage at Lakeside apartments, you'll find easy access to the",
      "Dallas North Tollway, 121, and George Bush Turnpike, making any",
      "commute in the Dallas/Fort Worth Metroplex a breeze.",
      "There’s plenty of shopping choices near our Plano Apartments",
      "with The Shops at Legacy less than a mile away.  We are also",
      "conveniently located between Willowbend Mall and Stonebriar",
      "Mall.  For all the health nuts, we are within walking distance",
      "of the Lakeside walking and jogging trails.",
      "Property and Apartment Amenities",
      "Community amenities include a swimming pool, 24-hour fitness",
      "center, elegant clubhouse, complimentary wine room, and large game",
      "room and billiards table.  Our apartments feature gourmet",
      "kitchens with granite countertops, stainless steel appliances,",
      "breakfast nooks, garden tubs, and walk-in closets.",
      "Floorplans",
      "Offering one, two, three and four-bedroom apartment homes with",
      "townhome style floor plans, you will be able to enjoy an open and",
      "spacious design. We have 20 floorplans to choose from ranging in",
      "size from 945 square feet to 2330 square feet.  Every",
      "floorplans comes with an attached garage at no extra charge.",
      "So whether you are looking for apartments in Plano, or nearby in",
      "Hebron or the Colony, Heritage at Lakeside, may be the right fit",
      "for you. Call us today to learn more.",
      "-48-hour Maintenance Commitment",
      "-Friendly Staff",
      "-Standup Showers",
      "-24-Hour Fitness Center",
      "-Gourmet Kitchens with Granite Countertops",
      "-Built-in Computer Desks",
      "-Neighborhood Feel",
      "-Ample Storage",
      "-Breakfast Nooks",
      "-Large Game Room with Billiards Table",
      "Call:",
      "show contact info",
      "For more information, visit us at: livewithjrk.com/cpqkqh2q/HeritageatLakeside"
    ],
    "duplicates": []
  },
  {
    "price": "$1725",
    "title": "New Luxury Apt in West Plano**Resort-Style Swimming Pool**Elevators!",
    "href": "https://dallas.craigslist.org/dal/apa/d/new-luxury-apt-in-west-planoresort/7109835769.html",
    "description": [
      "New Luxury and Chic Apartment in West Plano with Dining, Shopping, and Entertainment at Your Door Step! Enjoy the Luxury of White Granite Countertops and Clean Steel Appliances in the Kitchen. Wood Floors, Walk-In Closets, and Garden Tubs in Your Chic Apartment Homes. Amenities Include a Luxurious Resort Style Swimming Pool, Cabanas, Health Club, Wellness Studio, and Keyless Controlled Entry. Some More Amenities Include Walking Paths, Pet Parks, and Pet Spa for your Dogs, and So Much More! Parking Garage and Elevators! Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1115",
    "title": "Brand New Chic Apt in the West Plano Area**4-6 WEEKS FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-brand-new-chic-apt-in-the-west/7111077277.html",
    "description": [
      "Brand New Chic and Stylish Apartment Community with Easy Access to The Dallas Tollway. Dining, Shopping, and Entertainment Close By. Apartment Interiors Include Granite Countertops, Stainless Steel Appliances in the Kitchen, Wood Floors, Walk-In Closet, and Garden Tub. Amenities Include a Luxe Resort Style Swimming Pool, State of the Art Fitness Center, Walking and Biking Trails, Pet Park, and a Pet Care Station to Name a Few of Their Great Amenities. Great Management and Staff. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "!"
    ],
    "duplicates": []
  },
  {
    "price": "$1187",
    "title": "Plano Studio Apartments. All bills paid!!!",
    "href": "https://dallas.craigslist.org/ndf/apa/d/dallas-plano-studio-apartments-all/7122299300.html",
    "description": [
      "Furnished Studio - Only 2 Month Minimum!",
      "Take advantage of our special discounted rate! All utilities are included!",
      "show contact info",
      "www.esa.com/craigslist",
      "Looking for a place to call home for a couple months or longer? We have everything you need without the hassles of traditional apartments, all at a great rate. Each room comes with a fully equipped kitchen and plenty of workspace. And unlike apartments, cable and Wi-Fi are already hooked up and free! With no leases and no credit checks, we are move-in ready. So just bring yourself – and your furry family member – and feel right at home.",
      "Property Amenities",
      "All Rooms Non-Smoking",
      "Pet-Friendly Rooms Available",
      "Weekly Housekeeping Included",
      "Free Grab-and-Go Breakfast",
      "On-Site Guest Laundry",
      "Swimming Pool (Outdoor)",
      "Free Off-Street Parking",
      "In-Room Amenities",
      "Fully Equipped Kitchens",
      "Full-Size Refrigerator",
      "Electric Range",
      "Oven",
      "Microwave",
      "Dishwasher",
      "Free In-Room Wi-Fi",
      "Flat Screen TVs",
      "Free Cable with Premium Channels",
      "Iron & Ironing Board",
      "Staying less than 2 months?  We also have great nightly, weekly, and 30-night rates.  Call for details.",
      "Minimum 60-night length of stay required. Booking conditions apply, including a nonrefundable deposit. Rates and availability subject to change. Rate will vary by room type and stay dates. Rate not inclusive of taxes and fees. Actual room may vary from those shown.",
      "Pet Policy: A $25 (+ tax) per day, per pet non-refundable cleaning fee for the first month (not to exceed $150 + tax per pet), payable the first night of your stay. Each month thereafter is a $10 non-refundable fee (+tax) per day for the first 5 days of each month (not to exceed $50 + tax per month, per pet). Weight, size, and breed restrictions may apply.",
      "This site may contain errors, inaccuracies, omissions or incomplete data (including without limitation mistaken hotel rates or availability). Extended Stay America reserves the right to rescind any stated offer and to correct any errors, inaccuracies or omissions including after a reservation order has been submitted and whether or not the order has been confirmed and your credit card charged.",
      "Extended Stay America - 4636 W. Plano Pkwy., Plano, TX 75093\n"
    ],
    "duplicates": []
  },
  {
    "price": "$1535",
    "title": "YOUR NEXT HOME IS READY",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-your-next-home-is-ready/7112582466.html",
    "description": [
      "1 Bedrooms starting at $1,280",
      "2 Bedrooms starting at  $1,535",
      "3 Bedrooms starting at $",
      "$150 off rent for 1 month(s) on a 12 mo lease Other Concessions: - Special is for 1st month's rent, upfront. - Admin fee is credited back",
      "HIGH-VALUE amenities\n\nBlack/Stainless Appliances\n\nWood Floors\n\nGranite Countertops\n\nFitness Center\n\nVallet Trash",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators\nTop rated locator service in Dallas with over 500 Five star review",
      "Do You Need Electricity With No Deposit No Credit",
      "https://docs.google.com/forms/d/e/1FAIpQLSfl9MwZnWOmdR0IJKbZZkW00LmuTgcIzOaxFTDtM10LV6O-pg/viewform"
    ],
    "duplicates": []
  },
  {
    "price": "$1520",
    "title": "Updated Luxury! Award Winning West Plano Schools! One Month Free!",
    "href": "https://dallas.craigslist.org/ndf/apa/d/updated-luxury-award-winning-west-plano/7119258288.html",
    "description": [
      "Located in West Plano. Ideal Location is Minutes Away From Shopping Malls, Entertainment, Delicious Restaurants and is Located in the National Blue Ribbon award winning Plano Independent School District. Easy Access to George Bush Turnpike, Hwy 121 and the North Dallas Tollway. Relaxation and Enjoyment are Encouraged by Providing Two Lakeside Swimming Pools, 24-hr. Fitness Center and WiFi internet Access. Lay Out on the Beach Front, Play Sand Volleyball or Just Watch the Ducks Glide Across the Lake! Glen Eagles Country Club is Nearby. Convenience is at Your Fingertips With an On-Site Car Wash and Valet Trash Pick up. Come See for Yourself How Lakeside Living Enhances Your Lifestyle!",
      "Please Call Desiree",
      "show contact info",
      "Mention Ad 464"
    ],
    "duplicates": []
  },
  {
    "price": "$1",
    "title": "FREE LOCATOR SERVICE-SECOND CHANCE IN DFW",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-free-locator-service-second/7122276185.html",
    "description": [
      "I am an apartment locator/AGENT. My services are FREE FREE, FREE ! You pay me nothing for my services. Whenever you lease at an apartment and put me as your referral source, the apartment complex pays me a commission for bringing them a qualified tenant. I will find all the best deals for you in the area and save you time",
      "I work with***",
      "RENTAL HOMES ( you must qualify)**",
      "Luxury apartments* CLICK HERE TO START: LEIGH.COREONEREALESTATE.COM",
      "Townhouse*",
      "High Rise*",
      "Penthouse*",
      "Section 8 vouchers*",
      "Eviction 2 YEARS OLD *",
      "Broken Lease 1 YEAR OLD *",
      "Most criminal offenses*",
      "FELONY 5 YEARS OLD*",
      "MISD. 1 YEAR OLD*",
      "We are a full-service real estate company. We also help with buying, selling and leasing homes and property management and all commercial property buying and selling pus management as well.",
      "If interested, please reply directly to this ad or contact me using the information in the attached business card. To get started, I just need to know what areas you are looking to move to, what your price range is, any pets, move date, and anything specific you want in your new apartment.",
      "tags: second chance, real estate, property manager, realtor, criminal background, broken leases, evictions, apartments, apartment locating, assistance, free, locator, homes, houses, rent, bad credit, Collin County, Dallas County, Tarrant County, Denton County, Hunt County, specials"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1",
    "title": "FREE LOCATOR SERVICE-SECOND CHANCE IN DFW",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-free-locator-service-second/7120074793.html",
    "description": [
      "I am an apartment locator/AGENT. My services are FREE FREE, FREE ! You pay me nothing for my services. Whenever you lease at an apartment and put me as your referral source, the apartment complex pays me a commission for bringing them a qualified tenant. I will find all the best deals for you in the area and save you time",
      "I work with***",
      "RENTAL HOMES ( you must qualify)**",
      "Luxury apartments*                       CLICK HERE TO START: LEIGH.COREONEREALESTATE.COM",
      "Townhouse*",
      "High Rise*",
      "Penthouse*",
      "Section 8 vouchers*",
      "Eviction 2 YEARS OLD *",
      "Broken Lease 1 YEAR OLD *",
      "Most criminal offenses*",
      "FELONY 5 YEARS OLD*",
      "MISD. 1 YEAR OLD*",
      "We are a full-service real estate company. We also help with buying, selling and leasing homes and property management and all commercial property buying and selling pus management as well.",
      "If interested, please reply directly to this ad or contact me using the information in the attached business card. To get started, I just need to know what areas you are looking to move to, what your price range is, any pets, move date, and anything specific you want in your new apartment.",
      "tags: second chance, real estate, property manager, realtor, criminal background, broken leases, evictions, apartments, apartment locating, assistance, free, locator, homes, houses, rent, bad credit, Collin County, Dallas County, Tarrant County, Denton County, Hunt County, specials"
    ],
    "duplicates": []
  },
  {
    "price": "$1047",
    "title": "WE WOULD BE LUCKY TO HAVE YOU",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-we-would-be-lucky-to-have-you/7122264261.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "1 Bedrooms starting at $1,047",
      "2 Bedrooms starting at $1,444",
      "3 Bedrooms starting at $1,712",
      "Fitness center, Assigned parking, Perimeter fence, School bus stop, Picnic area, Private detached garages($50/mo), Bus stop, Carports, Free WiFi Areas, Business center, Handicap modified units, Gated entrance, Pool, Outdoor Grills, Hot Tub",
      "Broken Lease",
      "Eviction**Second Chance** We Can Help you, Our Service is FREE",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#8802A"
    ],
    "duplicates": []
  },
  {
    "price": "$1711",
    "title": "Luxury Townhomes, Basketball court, Attached garage",
    "href": "https://dallas.craigslist.org/ndf/apa/d/luxury-townhomes-basketball-court/7107766415.html",
    "description": [
      "Step into a sleek townhome and find yourself surrounded by amenities that inspire tranquility. Sip coffee by the fireplace on a chilly night, or take a dip in the hot tub and let tension melt away. Shoot some hoops at the basketball court, send emails from the business center, then dive into the resort-style pool. When you choose to live here, you choose luxury and convenience. Tucked behind surrounding neighborhoods, the townhome style floor plans are spacious and open. Host visitors in the guest room, take the kids to have fun on the playground, then release stress at the fitness center. Located near parks, schools, and restaurants.",
      "Please call Desiree with Dash Apartment Locators for more information",
      "show contact info",
      "Ad D116"
    ],
    "duplicates": []
  },
  {
    "price": "$1974",
    "title": "☆ Heritage at Lakeside in Plano, Wood-Burning Fireplaces, Garden Tubs",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-heritage-at-lakeside-in-plano/7122223404.html",
    "description": [
      "YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!",
      "Nestled in beautiful Plano, Texas, you'll discover a unique",
      "apartment community at Heritage at Lakeside. Offering one, two,",
      "three and four -bedroom apartment homes with townhome style floor",
      "plans, you will be able to enjoy an open and spacious design. Cozy",
      "up to your wood-burning fireplace, enjoy your designer color scheme",
      "or just relax on your private patio or balcony.",
      "Local Area Amenities",
      "At Heritage at Lakeside apartments, you'll find easy access to the",
      "Dallas North Tollway, 121, and George Bush Turnpike, making any",
      "commute in the Dallas/Fort Worth Metroplex a breeze.",
      "There’s plenty of shopping choices near our Plano Apartments",
      "with The Shops at Legacy less than a mile away.  We are also",
      "conveniently located between Willowbend Mall and Stonebriar",
      "Mall.  For all the health nuts, we are within walking distance",
      "of the Lakeside walking and jogging trails.",
      "Property and Apartment Amenities",
      "Community amenities include a swimming pool, 24-hour fitness",
      "center, elegant clubhouse, complimentary wine room, and large game",
      "room and billiards table.  Our apartments feature gourmet",
      "kitchens with granite countertops, stainless steel appliances,",
      "breakfast nooks, garden tubs, and walk-in closets.",
      "Floorplans",
      "Offering one, two, three and four-bedroom apartment homes with",
      "townhome style floor plans, you will be able to enjoy an open and",
      "spacious design. We have 20 floorplans to choose from ranging in",
      "size from 945 square feet to 2330 square feet.  Every",
      "floorplans comes with an attached garage at no extra charge.",
      "So whether you are looking for apartments in Plano, or nearby in",
      "Hebron or the Colony, Heritage at Lakeside, may be the right fit",
      "for you. Call us today to learn more.",
      "-Gourmet Kitchens with Granite Countertops",
      "-Complimentary Wine Room",
      "-Neighborhood Feel",
      "-Ceramic Tile Entryways",
      "-48-hour Maintenance Commitment",
      "-Wood-Burning Fireplaces",
      "-Online Payments Available",
      "-Digital Cable & Satellite TV",
      "-Garden Tubs",
      "-Split-Level Townhome Floorplans",
      "Call:",
      "show contact info",
      "For more information, visit us at: livewithjrk.com/qyc7zwrf/HeritageatLakeside"
    ],
    "duplicates": []
  },
  {
    "price": "$1703",
    "title": "Updated Townhomes with 2 Car Garages. $100 Visa Gift Card!",
    "href": "https://dallas.craigslist.org/ndf/apa/d/updated-townhomes-with-2-car-garages/7109220809.html",
    "description": [
      "Step into a sleek townhome and find yourself surrounded by amenities that inspire tranquility. Sip coffee by the fireplace on a chilly night, or take a dip in the hot tub and let tension melt away. Shoot some hoops at the basketball court, send emails from the business center, then dive into the resort-style pool.  Tucked behind surrounding neighborhoods, the townhome style floor plans are spacious and open. Host visitors in the guest room, take the kids to have fun on the playground, then release stress at the fitness center. Located near parks, schools, and restaurants.",
      "Please Call Desiree at",
      "show contact info",
      "Mention ad 157",
      "Free Apartment Locating Help with a Licensed Agent",
      "DASH Realty"
    ],
    "duplicates": []
  },
  {
    "price": "$1402",
    "title": "Premier Living. Premier Community.",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-premier-living-premier-community/7116019161.html",
    "description": [
      "Spirit Real Estate Group",
      "show contact info",
      "// Property Code WP-AWP-1",
      "Apartment Features...",
      "Fully-Equipped Kitchen with Stainless Steel Appliances, Side-by-Side Refrigerator with Ice/Water Dispensers, Slab Granite Countertops, Plank Flooring, Designer Lighting Package, Ceiling Fans, Spacious Patio or Balcony, Built-In Computer Desk*, Private Patio with Gated Front Stoop Access*, Full-Size Washer and Dryer*, * In Select Units",
      "Community Amenities...",
      "Resort-Style Swimming Pool with Beach Entry, Covered Outdoor Kitchen with Fireplace and Televisions, Private Poolside Cabanas, Landscaped Courtyards, 24-Hour State-of-the-Art Fitness Center, Java Bar, Paw Wash and Off-Leash Dog Park, Clothes Care Facility, Gated Garage, Trash and Recycling Center, Storage Units Available, Rooftop Solar Panels and Renewable Energy Power Shared Spaces, Short-Term Furnished Apartments Available",
      "Please call or text Spirit Real Estate Group at",
      "show contact info",
      "and refer to property code WP-AWP-1 for more information.",
      "We are one of the premier locating services in Dallas. Let us help you find your dream apartment!",
      "ApartmentLocatingServiceDallas.com",
      "Facebook: Dallas Upscale Apartment Locators",
      "Price and availability subject to change without prior notification.",
      "*West Plano*\n"
    ],
    "duplicates": []
  },
  {
    "price": "$1091",
    "title": "Premier Amenities At This Premier Community",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-premier-amenities-at-this-premier/7108361930.html",
    "description": [
      "Apartment Features...",
      "Fully-Equipped Kitchen with Stainless Steel Appliances, Side-by-Side Refrigerator with Ice/Water Dispensers, Slab Granite Countertops, Plank Flooring, Designer Lighting Package, Ceiling Fans, Spacious Patio or Balcony, Built-In Computer Desk*, Private Patio with Gated Front Stoop Access*, Full-Size Washer and Dryer*, * In Select Units",
      "Community Amenities....",
      "Resort-Style Swimming Pool with Beach Entry, Covered Outdoor Kitchen with Fireplace and Televisions, Private Poolside Cabanas, Landscaped Courtyards, 24-Hour State-of-the-Art Fitness Center, Java Bar, Paw Wash and Off-Leash Dog Park, Clothes Care Facility, Gated Garage, Trash and Recycling Center, Storage Units Available, Rooftop Solar Panels and Renewable Energy Power Shared Spaces, Short-Term Furnished Apartments Available",
      "Please call or text Spirit Real Estate Group at",
      "show contact info",
      "and refer to WP-AWP-0 for more information.",
      "We are one of the premier locating services in Dallas. Let us help you find your dream apartment!",
      "ApartmentLocatingServiceDallas.com",
      "Facebook: Dallas Upscale Apartment Locators",
      "Price and availability subject to change without prior notification.",
      "*West Plano*\n"
    ],
    "duplicates": []
  },
  {
    "price": "$1310",
    "title": "A Short Drive to Downtown Dallas and an Easy Walk to Local Retailers",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-short-drive-to-downtown-dallas/7109721521.html",
    "description": [
      "West Plano",
      "Please call or text Lori with Spirit Real Estate Group at",
      "show contact info",
      "and refer to property code WP-BE-1 for more information.",
      "Price and availability subject to change without prior notification.",
      "Plush carpeting in bedrooms / Ceiling fans in living & bedrooms / Full-size washer/dryers included / Recessed lighting / Private patios & balconies* / Expansive closets with custom shelving / Open concept living spaces / Sizeable linen closets / Expansive 9-12 foot ceilings* / Spacious pantries / Nest thermostats / USB outlets /Electronic unit entry / Front loading washer/dryer with steam option* / High-speed Internet access / Digital cable TV available *Select Units",
      "*West Plano*",
      "We service Downtown Dallas, Uptown Dallas, Richardson, Highland Village, Old East Dallas, East Dallas, Frisco, Plano, North Dallas, Carrollton, Farmers Branch, Lewisville, Grapevine, Las Colinas, and all of the DFW Metroplex.",
      "Serviced Zip Codes:",
      "75070, 75069, 75287, 75024, 75023, 75081, 75214, 75034, 75081, 75204, 75034, 75081, 75204, 75034, 75231, 75071, 75001, 75231, 75001, 75240, 75023, 75006, 75254, 75002, 75218\n75006, 75013, 75254, 75025, 75056, 75010, 75093, 75081, 75082, 75240, 76051, 75208, 75093, 75033, 75051, 75251, 75010, 75006, 75235, 75063, 75078",
      "**Ask us how to receive a cash rebate**"
    ],
    "duplicates": []
  },
  {
    "price": "$1650",
    "title": "Updated Luxury! Award Winning West Plano Schools, Onsite Car Wash!",
    "href": "https://dallas.craigslist.org/ndf/apa/d/updated-luxury-award-winning-west-plano/7107682049.html",
    "description": [
      "Located in West Plano. Ideal Location is Minutes Away From Shopping Malls, Entertainment, Delicious Restaurants and is Located in the National Blue Ribbon award winning Plano Independent School District. Easy Access to George Bush Turnpike, Hwy 121 and the North Dallas Tollway.  Relaxation and Enjoyment are Encouraged by Providing Two Lakeside Swimming Pools, 24-hr. Fitness Center and WiFi internet Access. Lay Out on the Beach Front, Play Sand Volleyball or Just Watch the Ducks Glide Across the Lake! Glen Eagles Country Club is Nearby. Convenience is at Your Fingertips With an On-Site Car Wash and Valet Trash Pick up.  Come See for Yourself How Lakeside Living Enhances Your Lifestyle!",
      "Please Call Desiree",
      "show contact info",
      "Mention Ad 464"
    ],
    "duplicates": []
  },
  {
    "price": "$1515",
    "title": "New Luxury High-Rise in West Plano**Washer/Dryer Inc**1 MONTH FREE",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-new-luxury-high-rise-in-west/7111699092.html",
    "description": [
      "New Luxury and Chic High-Rise in West Plano Over Looking the Shops of Legacy! Walking Distance to Shopping, Dining, and Entertainment. Enjoy the Luxury of White Quartz Countertops, Wine Refrigerator, Stainless Steel Appliances, and Gas Cook Tops in the  Kitchen. Real Wood Floors, Walk-In Closet, Spa Bathroom, with Washer and Dryer Included in Your Luxury Apartment Home! Amenities Include Two Resort-Style Swimming Pools, Dog Park, State of the Art Fitness Center, Theater Room, Billiards Room, Concierge Service, and So Much More! Parking Garage and Elevators as Well! Great Management and Staff. Please call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1175",
    "title": "New Apartment in West Plano with Elevators**Resort Style Pool!*",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-new-apartment-in-west-plano-with/7106777171.html",
    "description": [
      "New Luxury and Chic Apartment in  West Plano with Dining, Shopping, and Entertainment at Your Door Step! Enjoy the Luxury of White Granite Countertops and Clean Steel Appliances in the Kitchen. Wood Floors, Walk-In Closet, and Garden Tub in Your Luxury Apartment Home. Amenities Include a Luxurious Resort Style Swimming Pool, Cabanas, Health Club, Wellness Studio, Keyless Controlled Entry, Walking Paths, Pet Parks, Pet Spa for your Furry Friends, Plus So Much More! Parking Garage and Elevators as Well! Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1825",
    "title": "New Chic Apt in West Plano**6 WEEKS FREE + $99 TO APPLY!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-new-chic-apt-in-west-plano6-weeks/7119085663.html",
    "description": [
      "New Upscale and Chic Apartment in West Plano with Dining, Shopping, and Entertainment Around the Corner! Enjoy the Luxury of Quartz Countertops, with Side by Side Refridgerator, and Stainless Steel Appliances in the Kitchen. Wood Floors, Walk-In Closets, Garden Tubs, with Washer and Dryer Included in Your Upscale Apartment Home. Amenities Include a Luxurious Resort Style Swimming Pool, State of the Art Fitness Center, Car Wash Area, Pet Park, Plus So Much More. Parking Garage and Elevators as Well! Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1199",
    "title": "Brand New Chic Apt in West Plano**ONE MONTH FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-brand-new-chic-apt-in-west/7114397540.html",
    "description": [
      "Brand New Luxury and Chic Apartment in West Plano with Dining, Shopping, and Entertainment at Your Door Step! Stunning Kitchens with White Quartz Countertops and Sleek Steel Appliances in the Kitchen. Wood Floors, Walk-In Closet, Stand-Up Shower, Garden Tub, plus Washer and Dryer Included in Your Apartment Home. Amenities Include a Luxurious Resort Style Swimming Pool, Tanning Deck, 24/7 State of the Art Athletic Center with Free Weights, Party Room, Billiards Table, Private Conference Room, Pet Park, Plus So Much More! Parking Garage and Elevators as Well! Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1105",
    "title": "BEAUTIFUL 1 BEDROOM 1 BATHROOM READY TO MOVE IN!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-beautiful-1-bedroom-1-bathroom/7107605902.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "$250 OFF 1ST & 2ND MO W/12 MO",
      "1 Bedrooms starting at $1,105",
      "2 Bedrooms starting at $1,270",
      "3 Bedrooms starting at $",
      "Perimeter fence, 2 Pools, Business center, Picnic area, School bus stop, Free WiFi Areas, Outdoor Grills, Fitness center, Game/Sport room, Door to door trash pickup, Club house, Private detached garages($100/mo), Gated entrance, Laundry room, Assigned parking",
      "***Broken Lease***",
      "Accept Eviction  Second Chance We can Help you Our service is Free",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#7959A"
    ],
    "duplicates": []
  },
  {
    "price": "$1557",
    "title": "2-Bedroom Townhome -- 3 stories w/ Garage!!",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-2-bedroom-townhome-3-stories/7116503882.html",
    "description": [
      "Amazing value in West Plano, offering convenient access to The Dallas North Tollway, Highway 121, I-635, and I-75 -- get around the entire metroplex with ease!",
      "*** Part of a townhome/apartment complex -- Not a privately owned unit ***",
      "3-Story Townhome",
      "2-Car Garage",
      "2 Bedrooms",
      "2 Bathrooms",
      "Private Balcony",
      "Recent upgrades include:",
      "** Stainless steel appliances",
      "** Designer cabinets with built-in wine racks",
      "** Subway tile backsplash",
      "** Wood flooring",
      "** Granite counters",
      "** Upgraded lighting package",
      "** Custom 2-tone paint",
      "Get more info TODAY! Reply to this ad to contact Kara with The Locators Dallas. Please include:",
      "- Your full name",
      "- Phone number",
      "- Email",
      "- Ideal move date(s). FREE Apartment Locating Services with access to over THOUSANDS of apartments in DFW",
      "All units do not have the advertised features or amenities, Broker No FEE. Pricing and availability are subject to change daily and the rent is $ or more, depending on the features of the unit. TX Broker #0575602",
      "Apartment,townhome,condo,house,loft,studio,efficiency,uptown,the village,downtown, oaklawn,smu,lower Greenville,highland park,park cities,deep ellum,design district,lease,buy,sell,rent,knox,Henderson,bishop arts,oak cliff,medical district,walkability,pet-friendly,katy trail,locator,real estate,plano,Richardson"
    ],
    "duplicates": []
  },
  {
    "price": "$1762",
    "title": "DEALS in West Plano!  **1 MONTH FREE**",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-deals-in-west-plano-1-month-free/7119582365.html",
    "description": [
      "Enviable West Plano location, just minutes from both the Dallas North Tollway and PGBT. Access the entire metroplex with ease!",
      "ONLY $100 TO APPLY!!!",
      "This charming apartment home community brings you the convenience of shops, fine dining, and exciting entertainment destinations nearby. Whether you choose a 1 bedroom, 2 bedroom, or 3 bedroom, your new home",
      "will feature electric kitchens, spacious walk-in closets, washer and dryer connections, central heating and air, wonderful views, private patios, and more!",
      "Amenities throughout the property:",
      "- Community swimming pool",
      "- Tanning deck and firepit",
      "- Poolside grills",
      "- Nearby trails",
      "- State-of-the-art fitness center",
      "- Children's play area",
      "- Community greenspace",
      "Like what you see? Interested in working with a FREE Apartment Locator who has 5-star client reviews and will do ALL the work for you? If YES then reach out to Kara with The Locators with:",
      "- Your full name",
      "- Email",
      "- Phone number",
      "- Ideal move date(s)",
      "If this one doesn't work out, we'll get you into a spot that does!",
      "***FREE Apartment Locating Services with access to over THOUSANDS of badass properties in DFW",
      "All units do not have the advertised features or amenities, Broker No FEE. Pricing and availability are subject to change daily and the rent is $ or more, depending on the features of the unit. TX Broker #0575602",
      "Apartment,townhome,condo,house,loft,studio,efficiency,uptown,the village,downtown, oaklawn,smu,lower Greenville,highland park,park cities,deep ellum,design district,lease,buy,sell,rent,knox,Henderson,bishop arts,oak cliff,medical district,walkability,pet-friendly,katy trail,locator,real estate,plano,Richardson"
    ],
    "duplicates": []
  },
  {
    "price": "$2052",
    "title": "2-Story TH with Backyard & Garage",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-2-story-th-with-backyard-garage/7116473979.html",
    "description": [
      "Amazing value in West Plano, offering convenient access to The Dallas North Tollway, Highway 121, I-635, and I-75 -- get around the entire metroplex with ease!",
      "*** Part of a townhome/apartment complex -- Not a privately owned unit ***",
      "2-Story Townhome",
      "2-Car Garage",
      "3 Bedrooms",
      "2.5 Bathrooms",
      "PRIVATE YARD!",
      "Recent upgrades include:",
      "** Stainless steel appliances",
      "** Designer cabinets with built-in wine racks",
      "** Subway tile backsplash",
      "** Wood flooring",
      "** Granite counters",
      "** Upgraded lighting package",
      "** Custom 2-tone paint",
      "Set up your tour to see this unit in person today! Reply to this ad to contact Kara with The Locators Dallas. Please include your full name, phone number, and ideal move date(s). FREE Apartment Locating Services with access to over THOUSANDS of apartments in DFW",
      "All units do not have the advertised features or amenities, Broker No FEE. Pricing and availability are subject to change daily and the rent is $ or more, depending on the features of the unit. TX Broker #0575602",
      "Apartment,townhome,condo,house,loft,studio,efficiency,uptown,the village,downtown, oaklawn,smu,lower Greenville,highland park,park cities,deep ellum,design district,lease,buy,sell,rent,knox,Henderson,bishop arts,oak cliff,medical district,walkability,pet-friendly,katy trail,locator,real estate,plano,Richardson"
    ],
    "duplicates": []
  },
  {
    "price": "$1470",
    "title": "❄ Apartments available in Plano,",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-apartments-available-in-plano/7120991153.html",
    "description": [
      "YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!",
      "Nestled in beautiful Plano, Texas, you'll discover a unique",
      "apartment community at Heritage at Lakeside. Offering one, two,",
      "three and four -bedroom apartment homes with townhome style floor",
      "plans, you will be able to enjoy an open and spacious design. Cozy",
      "up to your wood-burning fireplace, enjoy your designer color scheme",
      "or just relax on your private patio or balcony.",
      "Local Area Amenities",
      "At Heritage at Lakeside apartments, you'll find easy access to the",
      "Dallas North Tollway, 121, and George Bush Turnpike, making any",
      "commute in the Dallas/Fort Worth Metroplex a breeze.",
      "There’s plenty of shopping choices near our Plano Apartments",
      "with The Shops at Legacy less than a mile away.  We are also",
      "conveniently located between Willowbend Mall and Stonebriar",
      "Mall.  For all the health nuts, we are within walking distance",
      "of the Lakeside walking and jogging trails.",
      "Property and Apartment Amenities",
      "Community amenities include a swimming pool, 24-hour fitness",
      "center, elegant clubhouse, complimentary wine room, and large game",
      "room and billiards table.  Our apartments feature gourmet",
      "kitchens with granite countertops, stainless steel appliances,",
      "breakfast nooks, garden tubs, and walk-in closets.",
      "Floorplans",
      "Offering one, two, three and four-bedroom apartment homes with",
      "townhome style floor plans, you will be able to enjoy an open and",
      "spacious design. We have 20 floorplans to choose from ranging in",
      "size from 945 square feet to 2330 square feet.  Every",
      "floorplans comes with an attached garage at no extra charge.",
      "So whether you are looking for apartments in Plano, or nearby in",
      "Hebron or the Colony, Heritage at Lakeside, may be the right fit",
      "for you. Call us today to learn more.",
      "Call:",
      "show contact info",
      "For more information, visit us at: livewithjrk.com/flguku77/HeritageatLakeside"
    ],
    "duplicates": []
  },
  {
    "price": "$1470",
    "title": "☀ Plano Apartment Homes, Attached Garages, Standup Showers",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-plano-apartment-homes-attached/7120926659.html",
    "description": [
      "YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!",
      "Nestled in beautiful Plano, Texas, you'll discover a unique",
      "apartment community at Heritage at Lakeside. Offering one, two,",
      "three and four -bedroom apartment homes with townhome style floor",
      "plans, you will be able to enjoy an open and spacious design. Cozy",
      "up to your wood-burning fireplace, enjoy your designer color scheme",
      "or just relax on your private patio or balcony.",
      "Local Area Amenities",
      "At Heritage at Lakeside apartments, you'll find easy access to the",
      "Dallas North Tollway, 121, and George Bush Turnpike, making any",
      "commute in the Dallas/Fort Worth Metroplex a breeze.",
      "There’s plenty of shopping choices near our Plano Apartments",
      "with The Shops at Legacy less than a mile away.  We are also",
      "conveniently located between Willowbend Mall and Stonebriar",
      "Mall.  For all the health nuts, we are within walking distance",
      "of the Lakeside walking and jogging trails.",
      "Property and Apartment Amenities",
      "Community amenities include a swimming pool, 24-hour fitness",
      "center, elegant clubhouse, complimentary wine room, and large game",
      "room and billiards table.  Our apartments feature gourmet",
      "kitchens with granite countertops, stainless steel appliances,",
      "breakfast nooks, garden tubs, and walk-in closets.",
      "Floorplans",
      "Offering one, two, three and four-bedroom apartment homes with",
      "townhome style floor plans, you will be able to enjoy an open and",
      "spacious design. We have 20 floorplans to choose from ranging in",
      "size from 945 square feet to 2330 square feet.  Every",
      "floorplans comes with an attached garage at no extra charge.",
      "So whether you are looking for apartments in Plano, or nearby in",
      "Hebron or the Colony, Heritage at Lakeside, may be the right fit",
      "for you. Call us today to learn more.",
      "-Neighborhood Feel",
      "-Split-Level Townhome Floorplans",
      "-Built-in Computer Desks",
      "-Ceiling Fans in Bedrooms and Living Rooms",
      "-Standup Showers",
      "-24-Hour Fitness Center",
      "-Friendly Staff",
      "-Attached Garages",
      "-Private Patio and Balcony",
      "-Large Game Room with Billiards Table",
      "Call:",
      "show contact info",
      "For more information, visit us at: livewithjrk.com/zpfblc7l/HeritageatLakeside"
    ],
    "duplicates": []
  },
  {
    "price": "$1470",
    "title": "♥ Apartment Home in Plano, Neighborhood Feel, Elegant Clubhouse",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-apartment-home-in-plano/7120875485.html",
    "description": [
      "YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!",
      "Nestled in beautiful Plano, Texas, you'll discover a unique",
      "apartment community at Heritage at Lakeside. Offering one, two,",
      "three and four -bedroom apartment homes with townhome style floor",
      "plans, you will be able to enjoy an open and spacious design. Cozy",
      "up to your wood-burning fireplace, enjoy your designer color scheme",
      "or just relax on your private patio or balcony.",
      "Local Area Amenities",
      "At Heritage at Lakeside apartments, you'll find easy access to the",
      "Dallas North Tollway, 121, and George Bush Turnpike, making any",
      "commute in the Dallas/Fort Worth Metroplex a breeze.",
      "There’s plenty of shopping choices near our Plano Apartments",
      "with The Shops at Legacy less than a mile away.  We are also",
      "conveniently located between Willowbend Mall and Stonebriar",
      "Mall.  For all the health nuts, we are within walking distance",
      "of the Lakeside walking and jogging trails.",
      "Property and Apartment Amenities",
      "Community amenities include a swimming pool, 24-hour fitness",
      "center, elegant clubhouse, complimentary wine room, and large game",
      "room and billiards table.  Our apartments feature gourmet",
      "kitchens with granite countertops, stainless steel appliances,",
      "breakfast nooks, garden tubs, and walk-in closets.",
      "Floorplans",
      "Offering one, two, three and four-bedroom apartment homes with",
      "townhome style floor plans, you will be able to enjoy an open and",
      "spacious design. We have 20 floorplans to choose from ranging in",
      "size from 945 square feet to 2330 square feet.  Every",
      "floorplans comes with an attached garage at no extra charge.",
      "So whether you are looking for apartments in Plano, or nearby in",
      "Hebron or the Colony, Heritage at Lakeside, may be the right fit",
      "for you. Call us today to learn more.",
      "-48-hour Maintenance Commitment",
      "-24-Hour Fitness Center",
      "-Online Payments Available",
      "-Stainless Steel Appliances",
      "-Elegant Clubhouse",
      "-Gourmet Kitchens with Granite Countertops",
      "-W/D Connections",
      "-Sparkling Swimming Pool",
      "-Split-Level Townhome Floorplans",
      "-Neighborhood Feel",
      "Call:",
      "show contact info",
      "For more information, visit us at: livewithjrk.com/2yqr7men/HeritageatLakeside"
    ],
    "duplicates": []
  },
  {
    "price": "$1245",
    "title": "Located Within The Plano Independent School District",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-located-within-the-plano/7121846199.html",
    "description": [
      "Come home today! Our pet friendly community is tucked away in the prestigious Willow Bend neighborhood. Offering the comfort of an established community with the convenience of the North Dallas Tollway, the George Bush Turnpike, Willow Bend Mall, and is located within the distinguished Plano Independent School District.",
      "Community Amenities: 24-Hour Fitness and Cardio Center, 5 Day/Week Valet Trash Service, Beautifully Landscaped Surroundings, Clubhouse with Shuffleboard, Conference/Study Area, Controlled-Access Gates, Dependable 24-Hour Maintenance, Detached Garage Available, Dog Park, Free Wi-Fi In Clubhouse and Pool Area, Lighted Sports Court, Nature and Golf Course Views, Picnic Areas, Recycle Program, Reserved Covered Parking, Resident Business Center with Internet Access, Resort Style Pool and Spa.",
      "Interior Amenities: Air Conditioning, Alarm, Cable Ready, Ceramic Tile Foyers, Custom Ceiling Fans, Elegant Crown Moulding, Energy Efficient Dishwashers, Full Sized Washer/Dryer Connections, Garden Oval Tubs, New/Renovated Interior, Oversized Closets, Private Patio/Balcony, Space Saver Microwaves, Vaulted Ceilings, View.",
      "Call or Text Now! Manny Vasquez ..... 9* 7* 2* - 6* 8* 9* - 6* 3* 3* 3*"
    ],
    "duplicates": []
  },
  {
    "price": "$1470",
    "title": "☆ Plano Apartment Homes, Breakfast Nooks, Ample Storage",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-plano-apartment-homes-breakfast/7120811535.html",
    "description": [
      "YES, WE ARE OPEN! CALL NOW TO SCHEDULE AN IN-PERSON TOUR! OR LET US SHOW YOU THROUGH FACETIME!",
      "Nestled in beautiful Plano, Texas, you'll discover a unique",
      "apartment community at Heritage at Lakeside. Offering one, two,",
      "three and four -bedroom apartment homes with townhome style floor",
      "plans, you will be able to enjoy an open and spacious design. Cozy",
      "up to your wood-burning fireplace, enjoy your designer color scheme",
      "or just relax on your private patio or balcony.",
      "Local Area Amenities",
      "At Heritage at Lakeside apartments, you'll find easy access to the",
      "Dallas North Tollway, 121, and George Bush Turnpike, making any",
      "commute in the Dallas/Fort Worth Metroplex a breeze.",
      "There’s plenty of shopping choices near our Plano Apartments",
      "with The Shops at Legacy less than a mile away.  We are also",
      "conveniently located between Willowbend Mall and Stonebriar",
      "Mall.  For all the health nuts, we are within walking distance",
      "of the Lakeside walking and jogging trails.",
      "Property and Apartment Amenities",
      "Community amenities include a swimming pool, 24-hour fitness",
      "center, elegant clubhouse, complimentary wine room, and large game",
      "room and billiards table.  Our apartments feature gourmet",
      "kitchens with granite countertops, stainless steel appliances,",
      "breakfast nooks, garden tubs, and walk-in closets.",
      "Floorplans",
      "Offering one, two, three and four-bedroom apartment homes with",
      "townhome style floor plans, you will be able to enjoy an open and",
      "spacious design. We have 20 floorplans to choose from ranging in",
      "size from 945 square feet to 2330 square feet.  Every",
      "floorplans comes with an attached garage at no extra charge.",
      "So whether you are looking for apartments in Plano, or nearby in",
      "Hebron or the Colony, Heritage at Lakeside, may be the right fit",
      "for you. Call us today to learn more.",
      "-Large Game Room with Billiards Table",
      "-Stainless Steel Appliances",
      "-Breakfast Nooks",
      "-Sparkling Swimming Pool",
      "-24-Hour Fitness Center",
      "-Split-Level Townhome Floorplans",
      "-Ample Storage",
      "-Neighborhood Feel",
      "-Friendly Staff",
      "-Complimentary Wine Room",
      "Call:",
      "show contact info",
      "For more information, visit us at: livewithjrk.com/w7ntj24r/HeritageatLakeside"
    ],
    "duplicates": []
  },
  {
    "price": "$1299",
    "title": "New Chic Apt in West Plano**Washer/Dryer Inc**ONE MONTH FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-new-chic-apt-in-west-planowasher/7108045975.html",
    "description": [
      "New Chic and Luxury Apartment in West Plano close to Shopping and Dining! Enjoy the Luxury of Quartz Countertops, with Side by Side Refridgerator, and Stainless Steel Appliances in Kitchen. Wood Floors, Walk-In Closet, Garden Tub, with Washer and Dryer Included in Your Apartment Chic Home. Amenities Include a Luxurious Resort Style Swimming Pool, State of the Art Fitness Center, Car Wash Area, Pet Park, and Pet Spa for Your Furry Friend. Parking Garage and Elevators! Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1499",
    "title": "Luxury Apt in West Plano**Attached Garage**Washer/Dryer Included!",
    "href": "https://dallas.craigslist.org/dal/apa/d/luxury-apt-in-west-planoattached/7114293357.html",
    "description": [
      "Luxury Townhouse Apartment Community in West Plano with an Attached Garage. Dining, Shopping, and Entertainment at Your Door Step. Enjoy the Luxury of Quartz Countertops and Stainless Steel Appliances in the Kitchen. Wood Floors, Walk-In Closet, Garden Tub, and Washer and Dryer Included in Your Apartment Home! Amenities Include a State of the Art Fitness Center, Yoga Studio, Sparkling Swimming Pool, Access Gates, and So Much More! Great Maintenance and Staff. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1950",
    "title": "New Chic & Stylish Apt in West Plano**1 MONTH FREE !**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-new-chic-stylish-apt-in-west/7114212968.html",
    "description": [
      "New Chic and Stylish Apartment in West Plano with Dining, Shopping, Night Life, and Entertainment at Your Door Step! Enjoy the Luxury of Quartz Countertops and Clean Steel Appliances in the Kitchen. Wood Floors, Walk-In Closets, Garden Tub, Stand-Up Shower in Your Apartment Home. Amenities Include a Lavish Resort Style Swimming Pool, Health Club, State of the Art Fitness Center, Pet Park, and So Much More. Parking Garage and Elevators! Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1313",
    "title": "1/1 Ready for the next chapter (6 Weeks Free)",
    "href": "https://dallas.craigslist.org/dal/apa/d/dallas-1-1-ready-for-the-next-chapter-6/7108138376.html",
    "description": [
      "Special - 6 Weeks Free, move in by 5/20/20 (13 month lease)",
      "4 Weeks Free, move in after 5/20/20",
      "Look and Lease ($99 App and Admin Fees)",
      "Market rate is $1470/mo, Net effective after 6 week special is $1313/mo",
      "Urban living at its finest! This beautiful community comes with a resort pool, state of the art fitness center, BBQ areas, lounge, car wash station, and a fully equipped business center with free wifi. Conveniently located near George Bush Toll Road and DNT, you have quick and easy access to get to where you're going. Inside the property, you'll find luxury features such as stainless-steel appliances, beautiful quartz or granite counter tops and wood style flooring.",
      "Please hit REPLY and leave your email or cell number for info/availability or to tour. Don't love this property? Send me your email for a complete list of properties with your criteria. I look forward to working with you!",
      "*Pricing and specials are subject to change",
      "**Pics are models",
      "***I am Yolanda, contact me at",
      "show contact info",
      ". My Services are COMPLETELY FREE!!***",
      "Urban Leasing and Realty DAL102"
    ],
    "duplicates": []
  },
  {
    "price": "$2250",
    "title": "3/2 Beautiful Apartment and Property Amenities (6 Weeks Free)",
    "href": "https://dallas.craigslist.org/dal/apa/d/dallas-3-2-beautiful-apartment-and/7108169088.html",
    "description": [
      "Special - 6 Weeks Free, move in by 5/20/20 (13 month lease)",
      "4 Weeks Free, move in after 5/20/20",
      "Look and Lease ($99 App and Admin Fees)",
      "Market rate is $2520/mo, Net effective after 6 week special is $2250/mo",
      "Urban living at its finest! This beautiful community comes with a resort pool, state of the art fitness center, BBQ areas, lounge, car wash station, and a fully equipped business center with free wifi. Conveniently located near George Bush Toll Road and DNT, you have quick and easy access to get to where you're going. Inside the property, you'll find luxury features such as stainless-steel appliances, beautiful quartz or granite counter tops and wood style flooring.",
      "Please hit REPLY and leave your email or cell number for info/availability or to tour. Don't love this property? Send me your email for a complete list of properties with your criteria. I look forward to working with you!",
      "*Pricing and specials are subject to change",
      "**Pics are models",
      "***I am Yolanda, contact me at",
      "show contact info",
      ". My Services are COMPLETELY FREE!!***",
      "Urban Leasing and Realty DAL102"
    ],
    "duplicates": []
  },
  {
    "price": "$1670",
    "title": "2/2 Elegant Traditional Apartment (6 Weeks Free)",
    "href": "https://dallas.craigslist.org/dal/apa/d/dallas-2-2-elegant-traditional/7108159081.html",
    "description": [
      "Special - 6 Weeks Free, move in by 5/20/20 (13 month lease)",
      "4 Weeks Free, move in after 5/20/20",
      "Look and Lease ($99 App and Admin Fees)",
      "Market rate is $1870/mo, Net effective after 6 week special is $1670/mo",
      "Urban living at its finest! This beautiful community comes with a resort pool, state of the art fitness center, BBQ areas, lounge, car wash station, and a fully equipped business center with free wifi. Conveniently located near George Bush Toll Road and DNT, you have quick and easy access to get to where you're going. Inside the property, you'll find luxury features such as stainless-steel appliances, beautiful quartz or granite counter tops and wood style flooring.",
      "Please hit REPLY and leave your email or cell number for info/availability or to tour. Don't love this property? Send me your email for a complete list of properties with your criteria. I look forward to working with you!",
      "*Pricing and specials are subject to change",
      "**Pics are models",
      "***I am Yolanda, contact me at",
      "show contact info",
      ". My Services are COMPLETELY FREE!!***",
      "Urban Leasing and Realty DAL102"
    ],
    "duplicates": []
  },
  {
    "price": "$1741",
    "title": "2/2 (Handicap)Upscale Luxury Apartment (6 Weeks Free)",
    "href": "https://dallas.craigslist.org/dal/apa/d/dallas-2-2-handicapupscale-luxury/7108161727.html",
    "description": [
      "Special - 6 Weeks Free, move in by 5/20/20 (13 month lease)",
      "4 Weeks Free, move in after 5/20/20",
      "Look and Lease ($99 App and Admin Fees)",
      "Market rate is $1950/mo, Net effective after 6 week special is $1741/mo",
      "Urban living at its finest! This beautiful community comes with a resort pool, state of the art fitness center, BBQ areas, lounge, car wash station, and a fully equipped business center with free wifi. Conveniently located near George Bush Toll Road and DNT, you have quick and easy access to get to where you're going. Inside the property, you'll find luxury features such as stainless-steel appliances, beautiful quartz or granite counter tops and wood style flooring.",
      "Please hit REPLY and leave your email or cell number for info/availability or to tour. Don't love this property? Send me your email for a complete list of properties with your criteria. I look forward to working with you!",
      "*Pricing and specials are subject to change",
      "**Pics are models",
      "***I am Yolanda, contact me at",
      "show contact info",
      ". My Services are COMPLETELY FREE!!***",
      "Urban Leasing and Realty DAL102"
    ],
    "duplicates": []
  },
  {
    "price": "$1688",
    "title": "2/2 Large Luxury Apartment (6 Weeks Free)",
    "href": "https://dallas.craigslist.org/dal/apa/d/dallas-2-2-large-luxury-apartment-6/7108166633.html",
    "description": [
      "Special - 6 Weeks Free, move in by 5/20/20 (13 month lease)",
      "4 Weeks Free, move in after 5/20/20",
      "Look and Lease ($99 App and Admin Fees)",
      "Market rate is $1890/mo, Net effective after 6 week special is $1688/mo",
      "Urban living at its finest! This beautiful community comes with a resort pool, state of the art fitness center, BBQ areas, lounge, car wash station, and a fully equipped business center with free wifi. Conveniently located near George Bush Toll Road and DNT, you have quick and easy access to get to where you're going. Inside the property, you'll find luxury features such as stainless-steel appliances, beautiful quartz or granite counter tops and wood style flooring.",
      "Please hit REPLY and leave your email or cell number for info/availability or to tour. Don't love this property? Send me your email for a complete list of properties with your criteria. I look forward to working with you!",
      "*Pricing and specials are subject to change",
      "**Pics are models",
      "***I am Yolanda, contact me at",
      "show contact info",
      ". My Services are COMPLETELY FREE!!***",
      "Urban Leasing and Realty DAL102"
    ],
    "duplicates": []
  },
  {
    "price": "$1749",
    "title": "2/2 Very Nice Luxury Apartment (6 Weeks Free)",
    "href": "https://dallas.craigslist.org/dal/apa/d/dallas-2-2-very-nice-luxury-apartment-6/7108164165.html",
    "description": [
      "Special - 6 Weeks Free, move in by 5/20/20 (13 month lease)",
      "4 Weeks Free, move in after 5/20/20",
      "Look and Lease ($99 App and Admin Fees)",
      "Market rate is $1970/mo, Net effective after 6 week special is $1759/mo",
      "Urban living at its finest! This beautiful community comes with a resort pool, state of the art fitness center, BBQ areas, lounge, car wash station, and a fully equipped business center with free wifi. Conveniently located near George Bush Toll Road and DNT, you have quick and easy access to get to where you're going. Inside the property, you'll find luxury features such as stainless-steel appliances, beautiful quartz or granite counter tops and wood style flooring.",
      "Please hit REPLY and leave your email or cell number for info/availability or to tour. Don't love this property? Send me your email for a complete list of properties with your criteria. I look forward to working with you!",
      "*Pricing and specials are subject to change",
      "**Pics are models",
      "***I am Yolanda, contact me at",
      "show contact info",
      ". My Services are COMPLETELY FREE!!***",
      "Urban Leasing and Realty DAL102"
    ],
    "duplicates": []
  },
  {
    "price": "$1241",
    "title": "1/1 Impressive Amenities and Finishes (6 Weeks Free)",
    "href": "https://dallas.craigslist.org/dal/apa/d/dallas-1-1-impressive-amenities-and/7108143376.html",
    "description": [
      "Special - 6 Weeks Free, move in by 5/20/20 (13 month lease)",
      "4 Weeks Free, move in after 5/20/20",
      "Look and Lease ($99 App and Admin Fees)",
      "Market rate is $1390/mo, Net effective after 6 week special is $1241/mo",
      "Urban living at its finest! This beautiful community comes with a resort pool, state of the art fitness center, BBQ areas, lounge, car wash station, and a fully equipped business center with free wifi. Conveniently located near George Bush Toll Road and DNT, you have quick and easy access to get to where you're going. Inside the property, you'll find luxury features such as stainless-steel appliances, beautiful quartz or granite counter tops and wood style flooring.",
      "Please hit REPLY and leave your email or cell number for info/availability or to tour. Don't love this property? Send me your email for a complete list of properties with your criteria. I look forward to working with you!",
      "*Pricing and specials are subject to change",
      "**Pics are models",
      "***I am Yolanda, contact me at",
      "show contact info",
      ". My Services are COMPLETELY FREE!!***",
      "Urban Leasing and Realty DAL102"
    ],
    "duplicates": []
  },
  {
    "price": "$1254",
    "title": "1/1 Very Nice Studio Apartment (6 Weeks Free )",
    "href": "https://dallas.craigslist.org/dal/apa/d/dallas-1-1-very-nice-studio-apartment-6/7108135493.html",
    "description": [
      "Special - 6 Weeks Free, move in by 5/20/20 (13 month lease)",
      "4 Weeks Free, move in after 5/20/20",
      "Look and Lease ($99 App and Admin Fees)",
      "Market rate is $1405/mo, Net effective after 6 week special is $1254/mo",
      "Urban living at its finest! This beautiful community comes with a resort pool, state of the art fitness center, BBQ areas, lounge, car wash station, and a fully equipped business center with free wifi. Conveniently located near George Bush Toll Road and DNT, you have quick and easy access to get to where you're going. Inside the property, you'll find luxury features such as stainless-steel appliances, beautiful quartz or granite counter tops and wood style flooring.",
      "Please hit REPLY and leave your email or cell number for info/availability or to tour. Don't love this property? Send me your email for a complete list of properties with your criteria. I look forward to working with you!",
      "*Pricing and specials are subject to change",
      "**Pics are models",
      "***I am Yolanda, contact me at",
      "show contact info",
      ". My Services are COMPLETELY FREE!!***",
      "Urban Leasing and Realty DAL102"
    ],
    "duplicates": []
  },
  {
    "price": "$1326",
    "title": "1/1 Fantastic Location with (6 Weeks Free)",
    "href": "https://dallas.craigslist.org/dal/apa/d/dallas-1-1-fantastic-location-with-6/7108151016.html",
    "description": [
      "Special - 6 Weeks Free, move in by 5/20/20 (13 month lease)",
      "4 Weeks Free, move in after 5/20/20",
      "Look and Lease ($99 App and Admin Fees)",
      "Market rate is $1485/mo, Net effective after 6 week special is $1326/mo",
      "Urban living at its finest! This beautiful community comes with a resort pool, state of the art fitness center, BBQ areas, lounge, car wash station, and a fully equipped business center with free wifi. Conveniently located near George Bush Toll Road and DNT, you have quick and easy access to get to where you're going. Inside the property, you'll find luxury features such as stainless-steel appliances, beautiful quartz or granite counter tops and wood style flooring.",
      "Please hit REPLY and leave your email or cell number for info/availability or to tour. Don't love this property? Send me your email for a complete list of properties with your criteria. I look forward to working with you!",
      "*Pricing and specials are subject to change",
      "**Pics are models",
      "***I am Yolanda, contact me at",
      "show contact info",
      ". My Services are COMPLETELY FREE!!***",
      "Urban Leasing and Realty DAL102"
    ],
    "duplicates": []
  },
  {
    "price": "$1250",
    "title": "1/1 Great New Luxury Community (6 Weeks Free)",
    "href": "https://dallas.craigslist.org/dal/apa/d/dallas-1-1-great-new-luxury-community-6/7108155794.html",
    "description": [
      "Special - 6 Weeks Free, move in by 5/20/20 (13 month lease)",
      "4 Weeks Free, move in after 5/20/20",
      "Look and Lease ($99 App and Admin Fees)",
      "Market rate is $1400/mo, Net effective after 6 week special is $1250/mo",
      "Urban living at its finest! This beautiful community comes with a resort pool, state of the art fitness center, BBQ areas, lounge, car wash station, and a fully equipped business center with free wifi. Conveniently located near George Bush Toll Road and DNT, you have quick and easy access to get to where you're going. Inside the property, you'll find luxury features such as stainless-steel appliances, beautiful quartz or granite counter tops and wood style flooring.",
      "Please hit REPLY and leave your email or cell number for info/availability or to tour. Don't love this property? Send me your email for a complete list of properties with your criteria. I look forward to working with you!",
      "*Pricing and specials are subject to change",
      "**Pics are models",
      "***I am Yolanda, contact me at",
      "show contact info",
      ". My Services are COMPLETELY FREE!!***",
      "Urban Leasing and Realty DAL102"
    ],
    "duplicates": []
  },
  {
    "price": "$1170",
    "title": "1/1/H Tucked away vibrant community (6 Weeks Free )",
    "href": "https://dallas.craigslist.org/dal/apa/d/dallas-1-1-tucked-away-vibrant/7108147419.html",
    "description": [
      "Special - 6 Weeks Free, move in by 5/20/20 (13 month lease) Handicap Unit",
      "4 Weeks Free, move in after 5/20/20",
      "Look and Lease ($99 App and Admin Fees)",
      "Market rate is $1310/mo, Net effective after 6 week special is $1170/mo",
      "Urban living at its finest! This beautiful community comes with a resort pool, state of the art fitness center, BBQ areas, lounge, car wash station, and a fully equipped business center with free wifi. Conveniently located near George Bush Toll Road and DNT, you have quick and easy access to get to where you're going. Inside the property, you'll find luxury features such as stainless-steel appliances, beautiful quartz or granite counter tops and wood style flooring.",
      "Please hit REPLY and leave your email or cell number for info/availability or to tour. Don't love this property? Send me your email for a complete list of properties with your criteria. I look forward to working with you!",
      "*Pricing and specials are subject to change",
      "**Pics are models",
      "***I am Yolanda, contact me at",
      "show contact info",
      ". My Services are COMPLETELY FREE!!***",
      "Urban Leasing and Realty DAL102"
    ],
    "duplicates": []
  },
  {
    "price": "$1272",
    "title": "1/1 Beautiful designer style and elegance! (6 Weeks Free)",
    "href": "https://dallas.craigslist.org/dal/apa/d/dallas-1-1-beautiful-designer-style-and/7108140516.html",
    "description": [
      "Special - 6 Weeks Free, move in by 5/20/20 (13 month lease)",
      "4 Weeks Free, move in after 5/20/20",
      "Look and Lease ($99 App and Admin Fees)",
      "Market rate is $1425/mo, Net effective after 6 week special is $1272/mo",
      "Urban living at its finest! This beautiful community comes with a resort pool, state of the art fitness center, BBQ areas, lounge, car wash station, and a fully equipped business center with free wifi. Conveniently located near George Bush Toll Road and DNT, you have quick and easy access to get to where you're going. Inside the property, you'll find luxury features such as stainless-steel appliances, beautiful quartz or granite counter tops and wood style flooring.",
      "Please hit REPLY and leave your email or cell number for info/availability or to tour. Don't love this property? Send me your email for a complete list of properties with your criteria. I look forward to working with you!",
      "*Pricing and specials are subject to change",
      "**Pics are models",
      "***I am Yolanda, contact me at",
      "show contact info",
      ". My Services are COMPLETELY FREE!!***",
      "Urban Leasing and Realty DAL102"
    ],
    "duplicates": []
  },
  {
    "price": "$1677",
    "title": "DECKED OUT MID RISE, WALKABLE, ELEVATORS",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-decked-out-mid-rise-walkable/7107326660.html",
    "description": [
      "This community has direct access to Cinemark Theater, and West Plano Village restaurants. Residents also enjoy convenient access to the Dallas North tollway with both Dallas Love Field and DFW International Airports with in a 20 minute drive. Residents enjoy outstanding amenities including a resort style swimming pool, private poolside cabanas, covered outdoor kitchen with fireplace and televisions, 24 hour state of the art fitness center, resident business center and conference room, and java bar. Our pet friendly community also offers a paw wash and private parking in a gated garage.",
      "For more information call or register online: http://www.dallasapartment.co",
      "show contact info",
      "Refer to Apt#5362A",
      "100% FREE SERVICE WITH A LICENSED AGENT!",
      "Efficiency $962 /mo 632 sf",
      "1 bedroom $1,016-1,551 /mo 715-912 sf",
      "2 bedroom $1,746-2,683 /mo 1,083-1,355 sf",
      "Deposit: 150-250 Pet Policy: Cats:Yes Dogs:Yes",
      "Built: 2015 Location: West Plano/ Frisco",
      "Community Amenities: School bus stop, Business center, Laundry room, BBQ grills, Elevators, Bus stop, Pool, Fitness center, Community parking garage, Furnished units, Gated entrance, Handicap modified units",
      "Unit Amenities: Microwaves, High ceilings, Private patios/balconies, Custom carpet, Hi-speed internet, Garden/large tubs, Miniblinds, Non-carpeted flooring, Ice makers, W/D connections, Ceiling fans, Dishwashers, Self cleaning ovens, Cable ready, Intrusion alarms, Walk-in showers, W/D machines, Walk-in closets, Garbage disposals, Frost free refrigerators",
      "Christa Dugger | Real Estate Agent | 1 Source",
      "Please contact me directly to schedule an appointment.",
      "Prices & Specials change daily, contact me for availability.",
      "All units do not have the advertised features or amenities."
    ],
    "duplicates": []
  },
  {
    "price": "$1",
    "title": "2ND CHANCE * EVICTION * BROKEN LEASE * FELONY * MISDEMEANOR",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-2nd-chance-eviction-broken-lease/7120774809.html",
    "description": [
      "My name is Chris,",
      "I am a licensed professional real estate agent and I am here to help you navigate the housing market. As a Realtor® I subscribe to a strict code of ethics and integrity set forth by the National Association of Realtors. Whether you are looking to lease, buy, or sell, your best interest is my priority. Please call/text and let me know how I may help you. Again, my services are FREE, FREE, FREE!",
      "Not ready to buy, I can help you find all the best deals for your area and save you time when renting.",
      "Rental House",
      "Apartments",
      "Townhomes",
      "Luxury Apartments",
      "Mid Rise",
      "High Rise",
      "Penthouse",
      "Section 8 Vouchers",
      "Rental History Concerns, depends on date, amount owed, etc.",
      "Eviction - 2 years or older",
      "Broken Lease - 1 year or older",
      "Criminal History Concerns, depends on the type of criminal offense, date, probation, etc.",
      "Felony 5 years old or older",
      "Misdemeanor 1 Yr. old or older",
      "You pay me nothing for my services. Whenever you lease at an apartment and list me as your referral source, the apartment complex pays me a commission for bringing them a qualified tenant. However, I need some information to better help you....",
      "Please include the following upon request:",
      "1. First and Last Name",
      "2. E-mail",
      "3. Preferred Move Date",
      "4. Desired Location",
      "5. Price Range",
      "Christopher Burns MBA",
      "AGENT | Apartment Locator",
      "Core One Real Estate",
      "100% Free Service",
      "Start your search:",
      "Or Call/ Text",
      "show contact info",
      "The referral of your friends and family is the greatest compliment you can give me.",
      "Thank you for your trust in me."
    ],
    "duplicates": []
  },
  {
    "price": "$1139",
    "title": "Luxury Plano Mid-Rise *Special* 1 Mo FREE-Misdemeanor,1st time renter",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-luxury-plano-mid-rise-special-1/7119561145.html",
    "description": [
      "Brand new luxury Plano apartments are ideally located in the heart of West Plano Village.  This community has direct access to Cinemark Theater, and West Plano Village restaurants.",
      "1 Bedrooms available for immediate Move-in!!!",
      "*Specials can change daily.  For more info contact:",
      "Janelle Cline - Agent",
      "Text",
      "show contact info",
      "APARTMENT GORILLA",
      "A USMC Veteran Owned Company",
      "Features:",
      "One bedroom and two bedroom floor plans",
      "Fully equipped kitchens with stainless steel appliances and espresso cabinetry, elegant granite countertops",
      "Master wood plank flooring living and dining areas",
      "Designer lighting",
      "Ceiling fans",
      "Oversized garden tubs",
      "Spacious patios and balconies",
      "Resort style swimming pool",
      "Private poolside cabanas",
      "Covered outdoor kitchen with fireplace and televisions",
      "24 hour state of the art fitness center",
      "Resident business center and conference room",
      "Java bar",
      "Pet friendly community also offers a paw wash",
      "Private parking in a gated garage",
      "Exterior Amenities: Fitness center, Pool, Business center, Free WiFi Areas, Gated entrance, Assigned parking, Outdoor Grills, Laundry room, Elevators, Dog Park, Community parking garage, Furnished units, Handicap modified units, Bus stop",
      "Interior Amenities: W/D connections, W/D machines, Walk-in closets, Garden/large tubs, Walk-in showers, Private patios/balconies, Cable ready, Hi-speed internet, High ceilings, Custom carpet, Non-carpeted flooring, Ice makers, Premium Countertops, Premium Appliances, Self cleaning ovens",
      "Our Service is FREE ~ The Apartments Pay us",
      "Contact Janelle @",
      "show contact info",
      "APARTMENT GORILLA",
      "We also have communities that work with Second Chance Issues - 2nd Chance Apartments",
      "Felony - Misdemeanors - Bad Credit - Broken Lease - Evictions",
      "Conditions apply",
      "75093"
    ],
    "duplicates": []
  },
  {
    "price": "$1480",
    "title": "2nd chance - broken lease -$750-1mo free",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-2nd-chance-broken-lease-mo-free/7109568837.html",
    "description": [
      "FREE MOVE OR CASH REBATE!!!!!\n\nFitness center, Private detached garages($100/mo), Business center, Outdoor Grills, Picnic area, Perimeter fence, Assigned parking, Free WiFi Areas, Game/Sport room, Club house, Gated entrance, Laundry room, Door to door trash pickup, School bus stop, 2 Pools\n\nFREE LOCATING SERVICE : You pay me nothing for my services. Whenever you lease at an apartment and put me as your referral source, the property pays me a commission for bringing them a prospect. I find all the best deals for you in all areas and saves you time!\nProperty is on computerized pricing system (e.g. Yieldstar) therefore rents are approximate",
      "***Broken Lease***",
      "Accept Eviction  Second Chance We can Help you Our service is Free",
      "For more information on this property and others please\nCall/Text Jodi Killingsworth @",
      "show contact info",
      ", or sign up on my website for more info\n\n1 Source Locators\nTop rated locator service in Dallas with over 500 Five star reviews",
      "Special: $750-1mo free w/12mo on sel 1&2BR",
      "Refer to Apt#7959A\n"
    ],
    "duplicates": []
  },
  {
    "price": "$1480",
    "title": "REALLY COOL PLACE MUST SEE !!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-really-cool-place-must-see/7109095433.html",
    "description": [
      "FREE MOVE OR CASH REBATE!!!!!\n\nFitness center, Private detached garages($100/mo), Business center, Outdoor Grills, Picnic area, Perimeter fence, Assigned parking, Free WiFi Areas, Game/Sport room, Club house, Gated entrance, Laundry room, Door to door trash pickup, School bus stop, 2 Pools\n\nFREE LOCATING SERVICE : You pay me nothing for my services. Whenever you lease at an apartment and put me as your referral source, the property pays me a commission for bringing them a prospect. I find all the best deals for you in all areas and saves you time!\nProperty is on computerized pricing system (e.g. Yieldstar) therefore rents are approximate",
      "***Broken Lease***",
      "Accept Eviction  Second Chance We can Help you Our service is Free",
      "For more information on this property and others please\nCall/Text Jodi Killingsworth @",
      "show contact info",
      ", or sign up on my website for more info\n\n1 Source Locators\nTop rated locator service in Dallas with over 500 Five star reviews",
      "Special: $750-1mo free w/12mo on sel 1&2BR",
      "Refer to Apt#7959A\n"
    ],
    "duplicates": []
  },
  {
    "price": "$1340",
    "title": "NEED SPACE?? We Have A Floorplan For That...",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-need-space-we-have-floorplan-for/7121183726.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "1 Bedrooms starting at $1,340",
      "2 Bedrooms starting at $2,025",
      "3 Bedrooms starting at $2,104",
      "Free WiFi Areas, Business center, Outdoor Grills, Door to door trash pickup, Handicap modified units, Perimeter fence, Game/Sport room, School bus stop, Fitness center, Picnic area, Pool, Club house",
      "Broken Lease",
      "Eviction**Second Chance** We Can Help you, Our Service is FREE",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#8673A"
    ],
    "duplicates": []
  },
  {
    "price": "$1092",
    "title": "GORGEOUS ARCHITECTURE",
    "href": "https://dallas.craigslist.org/ndf/apa/d/gorgeous-architecture/7119933376.html",
    "description": [
      "This exquisite colonial inspired community is ideally located for your convenience. Experience beautiful one and two bedroom apartment homes equipped with practical amenities like spacious closets, vaulted ceilings and modern kitchens. For more information call",
      "show contact info",
      "or register online: http://www.dallasapartment.co Refer to Apt#8322A - Plano, TX, 75093",
      "100% FREE SERVICE WITH A LICENSED AGENT!",
      "1 bedroom $1,065-1,535 /mo 795-1,035 sf",
      "2 bedroom $1,417-1,884 /mo 1,110-1,725 sf",
      "Deposit: 0 Pet Policy: Cats:Yes Dogs:Yes",
      "Built: 1996 Location: West Plano/ Frisco/ East Lewisville",
      "Community Amenities: Carports, School bus stop, Free WiFi Areas, Assigned parking, Business center, Handicap modified units, Outdoor Grills, Fitness center, Perimeter fence, Door to door trash pickup, Pool, Private detached garages($95/mo), Gated entrance",
      "Unit Amenities: Garden/large tubs, High ceilings, Walk-in showers, Premium Countertops, Dishwashers, Storage closet outside, Microwaves, Premium Appliances, Ice makers, Custom carpet, Miniblinds, Hi-speed internet, Garbage disposals, Crown molding, Frost free refrigerators, Walk-in closets, Cable ready, Custom built-ins, Attached garages, W/D connections, Self cleaning ovens, Fire places, Private patios/balconies, Ceiling fans",
      "Christa Dugger | Real Estate Agent | 1 Source",
      "Please contact me directly to schedule an appointment.",
      "Prices and specials change daily, contact me for availability.",
      "All units do not have the advertised features or amenities."
    ],
    "duplicates": []
  },
  {
    "price": "$1",
    "title": "EVICTION 2 YEARS OLD ? CALL ME",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-eviction-2-years-old-call-me/7106673854.html",
    "description": [
      "I am an apartment locator, leasing agent and my service is free to you. I just wanted to take a minute to introduce myself and tell you a little about myself. I work with corporate leasing, short term, fully furnished units, ALL second chance, Section 8, and most criminal offenses. We are a full-service real estate company.",
      "WHY RENT IF YOU CAN BUY!!",
      "We also help with buying, selling and leasing homes and property management as well. I have been helping others with their real estate needs for 20 years in the DFW area. I would love to help you in any way I can for your real estate needs. You can call or text me at any time at",
      "show contact info",
      ". TEXT is better. Thanks : )",
      "tags: second chance, real estate, property manager, realtor, criminal background, broken leases, evictions, apartments, apartment locating, assistance, free, locator, homes, houses, rent, bad credit, Collin County, Dallas County, Tarrant County, Denton County, Hunt County"
    ],
    "duplicates": []
  },
  {
    "price": "$1204",
    "title": "Great Location and Very Spacious Plano Apartment",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-great-location-and-very-spacious/7108267892.html",
    "description": [
      "This apartment is just a short drive from downtown Dallas and an easy walk to local retailers, up-and-coming restaurants and bars with lots of style.  This apartment  is perfectly located for a comfortable life well-lived, and carefully designed for luxury living.",
      "Amenities readily available include:",
      "Bike Racks",
      "Car Wash Stations",
      "Ceramic tile backsplash",
      "Climate controlled corridors",
      "Controlled access gates and buildings",
      "Business Center",
      "Courtyard",
      "Custom ceramic tile flooring and backsplashes",
      "Custom solar shades",
      "Digital cable TV available",
      "Electronic Unit entry",
      "Elevator access",
      "Expansive closets with custom shelving",
      "Pet Park and Paw Spa Available",
      "Full size washer/dryers included",
      "Full-service Technology Lounge",
      "Grand Social Room with Catering Kitchen",
      "Indoor/Outdoor Lounge with Televisions",
      "Open concept living spaces",
      "Outdoor BBQ kitchens",
      "Package Concierge System",
      "Parking Garage",
      "Plush carpeting in bedrooms",
      "Private Conference Room",
      "Private Spin Studio with Fitness on Demand",
      "Recessed lighting",
      "Self-cleaning ovens",
      "Serene Hammock Courtyard",
      "Side-by-side refrigerators with ice makers",
      "Fully equipped and modern fitness center",
      "Call or text anytime at",
      "show contact info",
      "for more information.",
      "When reaching out, please provide:",
      "1.  Name",
      "2.  Email",
      "3.  Phone",
      "4.  Desired Move in Date",
      "Availability and pricing subject to change at any time. We promote equal house opportunity."
    ],
    "duplicates": []
  },
  {
    "price": "$1899",
    "title": "Brand New Apt- 6 Pools, Parks, Jogging Trails**1 MONTH FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/brand-new-apt-6-pools-parks-jogging/7114209631.html",
    "description": [
      "Chic and Stylish Apartment Community with Dining, Shopping, and Entertainment Close By, but Also Offers Many Outdoor Activities. Each Apartment Includes; Granite Countertops, Stainless Steel Appliances, and Wood Flooring!! They Also Include; Garden Tubs and Walk-In Closets!! This Community Offers a Variety of Floorplans, That One Will Easily Fall in Love With. Amenities Include; 6 Resort-Style Swimming Pools, 24-Hour Fitness Center, Multiple Dog Parks, and Even Easy Access to Many Bike/Hike Trails and the Nature Preserve! This Property Offers a Bundle of Activities, That One Will Love!! Most Importantly, They Have Great Management and Maintenance!! Please Contact Jacquelyn with Dash Realty at",
      "show contact info",
      "For More Information."
    ],
    "duplicates": []
  },
  {
    "price": "$900",
    "title": "Nicely remodeled 3 bedroom 2 bathrooms Rowlett Richardson contemporary",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-nicely-remodeled-3-bedroom-2/7120783548.html",
    "description": [
      "Gorgeous 2.1 ac tract in the brand new subdivision of Womack Ranch. Very back of property is located in the floodplain. This tract also has an entrance gate & drive installed..100sqft.. Granbury Lewisville Red Oak Grand Prairie Arlington Rio Vista Alvarado Naval Air Station / JRB"
    ],
    "duplicates": []
  },
  {
    "price": "$1209",
    "title": "Open Concept Floorplan - Gorgeous & Affordable 2 Story",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-open-concept-floorplan-gorgeous/7120832576.html",
    "description": [
      "This",
      "brand new 5 bedroom / 2.5 bathroom",
      "home is ready for move-in with no application fees or security deposits - just $1,000 gets you the keys!",
      "Stop looking and call today, or it will be gone tomorrow!",
      "Call today! We're open daily until 8pm",
      "show contact info",
      "ext. 300"
    ],
    "duplicates": []
  },
  {
    "price": "$1155",
    "title": "Modern & Upscale Apartment with a Great Location in Plano",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-modern-upscale-apartment-with/7111979670.html",
    "description": [
      "This apartment is just a short drive from downtown Dallas and an easy walk to local retailers, up-and-coming restaurants and bars with lots of style.  This apartment  is perfectly located for a comfortable life well-lived, and carefully designed for luxury living.",
      "Amenities readily available include:",
      "Bike Racks",
      "Car Wash Stations",
      "Ceramic tile backsplash",
      "Climate controlled corridors",
      "Controlled access gates and buildings",
      "Business Center",
      "Courtyard",
      "Custom ceramic tile flooring and backsplashes",
      "Custom solar shades",
      "Digital cable TV available",
      "Electronic Unit entry",
      "Elevator access",
      "Expansive closets with custom shelving",
      "Pet Park and Paw Spa Available",
      "Full size washer/dryers included",
      "Full-service Technology Lounge",
      "Grand Social Room with Catering Kitchen",
      "Indoor/Outdoor Lounge with Televisions",
      "Open concept living spaces",
      "Outdoor BBQ kitchens",
      "Package Concierge System",
      "Parking Garage",
      "Plush carpeting in bedrooms",
      "Private Conference Room",
      "Private Spin Studio with Fitness on Demand",
      "Recessed lighting",
      "Self-cleaning ovens",
      "Serene Hammock Courtyard",
      "Side-by-side refrigerators with ice makers",
      "Fully equipped and modern fitness center",
      "Call or text anytime at",
      "show contact info",
      "for more information.",
      "When reaching out, please provide:",
      "1.  Name",
      "2.  Email",
      "3.  Phone",
      "4.  Desired Move in Date",
      "Availability and pricing subject to change at any time. We promote equal house opportunity."
    ],
    "duplicates": []
  },
  {
    "price": "$1635",
    "title": "6 WEEKS FREE! $0 Deposit! West Plano Luxury Apartment!",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-6-weeks-free-0-deposit-west-plano/7112716514.html",
    "description": [
      "Contact info:",
      "Matt |Text",
      "show contact info",
      "Reference Apartment #289;  1-2 MONTHS FREE! $0 Deposit! West Plano Luxury Apartment!",
      "$1,869/mo ($1,635/mo if you prorate 6 weeks free, you can also take your first 6 weeks free upfront)",
      "KEY FEATURES",
      "Built:",
      "2017",
      "Sq Footage:",
      "1117 sqft.",
      "Bedrooms:",
      "2 Bed",
      "Bathrooms:",
      "2 Bath",
      "Parking:",
      "open | Guest parking",
      "Lease Duration:",
      "1 Year",
      "Pets Policy:",
      "Cats & Dogs OK",
      "Laundry:",
      "Fullsize provided",
      "Floor:",
      "1",
      "Property Type:",
      "Apartment",
      "** TEXT",
      "show contact info",
      "AND REFERENCE APARTMENT #289",
      "**Reference Apartment #289",
      "RENTAL FEATURES",
      "Living room",
      "Dining room",
      "Walk-in closet",
      "Master bath",
      "Pantry",
      "Range / Oven",
      "Refrigerator",
      "Dishwasher",
      "Microwave",
      "Garbage disposal",
      "Stainless steel appliances",
      "Freezer",
      "Balcony, Deck, or Patio",
      "Heat: forced air",
      "Central A/C",
      "Air conditioning",
      "Ceiling fans",
      "Double pane / Storm windows",
      "Cable-ready",
      "High-speed internet",
      "Wired",
      "Hardwood floor",
      "Tile floor",
      "Granite countertop",
      "High / Vaulted ceiling",
      "COMMUNITY FEATURES",
      "New property",
      "Elevator",
      "Secured entry",
      "Controlled access",
      "Gated entry",
      "Shared pool",
      "Fitness center",
      "Near transportation",
      "Clubhouse",
      "Barbecue",
      "Business center",
      "Guest parking",
      "Off-street parking",
      "Covered parking",
      "On-street parking",
      "Open Parking",
      "Contact info:",
      "Matt Goodman",
      "Dash Realty",
      "show contact info",
      "Tags: Apartments, Downtown Dallas, East Dallas Apartments, Farmers market, deep ellum, highland park, Park Cities, Kessler Park, Bishop Arts District, Knox/Henderson, Medical District, Design District, Midtown, North Dallas, Northeast Dallas, Northwest Dallas, Old East Dallas, Far North Dallas, South Dallas, Southeast Dallas, Uptown, Uptown Dallas apartments, Uptown Dallas, Addison apartments, Allen apartments, Carrollton apartments, Farmers Branch apartments, Firsco, Frisco apartments, Lakehighlands apartments, Mckinney apartments, Mckinney, Richardson Apartments, Rockwall apartments, the colony, Las Colinas apartments, Irving apartments, South Irving apartments, North Irving apartments, Valley Ranch Apartments, Plano apartments, Central Plano apartments, West Plano apartments, East plano apartments, Ft.Worth apartments, Arlington apartments, Mid Cities apartments"
    ],
    "duplicates": []
  },
  {
    "price": "$1636",
    "title": "6 WEEKS FREE! $0 Deposit! West Plano Luxury Apartment!",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-6-weeks-free-0-deposit-west-plano/7112716191.html",
    "description": [
      "Contact info:",
      "Matt |Text",
      "show contact info",
      "Reference Apartment #289; 6 WEEKS FREE! $0 Deposit! West Plano Luxury Apartment!",
      "$1,870/mo ($1,636/mo if you prorate 6 weeks free, you can also take the 6 weeks free upfront)",
      "KEY FEATURES",
      "Built:",
      "2017",
      "Sq Footage:",
      "1116 sqft.",
      "Bedrooms:",
      "2 Bed",
      "Bathrooms:",
      "2 Bath",
      "Parking:",
      "open | Guest parking",
      "Lease Duration:",
      "1 Year",
      "Pets Policy:",
      "Cats & Dogs OK",
      "Laundry:",
      "Fullsize supplied",
      "Floor:",
      "1",
      "Property Type:",
      "Apartment",
      "** TEXT",
      "show contact info",
      "AND REFERENCE APARTMENT #289.  Just for using our FREE service you will also receive up to $200 Cash Rebate.",
      "**Reference Apartment #289! 1 MONTH FREE! WEST PLANO LUXURY APARTMENT!",
      "RENTAL FEATURES",
      "Living room",
      "Dining room",
      "Walk-in closet",
      "Master bath",
      "Pantry",
      "Range / Oven",
      "Refrigerator",
      "Dishwasher",
      "Microwave",
      "Garbage disposal",
      "Stainless steel appliances",
      "Freezer",
      "Balcony, Deck, or Patio",
      "Heat: forced air",
      "Central A/C",
      "Air conditioning",
      "Ceiling fans",
      "Double pane / Storm windows",
      "Cable-ready",
      "High-speed internet",
      "Wired",
      "Hardwood floor",
      "Tile floor",
      "Granite countertop",
      "High / Vaulted ceiling",
      "COMMUNITY FEATURES",
      "New property",
      "Elevator",
      "Secured entry",
      "Controlled access",
      "Gated entry",
      "Shared pool",
      "Fitness center",
      "Near transportation",
      "Clubhouse",
      "Barbecue",
      "Business center",
      "Guest parking",
      "Off-street parking",
      "Covered parking",
      "On-street parking",
      "Open Parking",
      "Contact info:",
      "Matt Goodman",
      "Dash Realty",
      "show contact info",
      "Tags: Apartments, Downtown Dallas, East Dallas Apartments, Farmers market, deep ellum, highland park, Park Cities, Kessler Park, Bishop Arts District, Knox/Henderson, Medical District, Design District, Midtown, North Dallas, Northeast Dallas, Northwest Dallas, Old East Dallas, Far North Dallas, South Dallas, Southeast Dallas, Uptown, Uptown Dallas apartments, Uptown Dallas, Addison apartments, Allen apartments, Carrollton apartments, Farmers Branch apartments, Firsco, Frisco apartments, Lakehighlands apartments, Mckinney apartments, Mckinney, Richardson Apartments, Rockwall apartments, the colony, Las Colinas apartments, Irving apartments, South Irving apartments, North Irving apartments, Valley Ranch Apartments, Plano apartments, Central Plano apartments, West Plano apartments, East plano apartments, Ft.Worth apartments, Arlington apartments, Mid Cities apartments"
    ],
    "duplicates": []
  },
  {
    "price": "$1517",
    "title": "Incredibly Priced One Bedroom Apartment in the Desired Plano Area",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-incredibly-priced-one-bedroom/7115060076.html",
    "description": [
      "Convenient location and easy access to major freeways, parks, dining, and entertainment and more.  Amenities available will include:",
      "-LEED Gold Certified community",
      "-Located in exemplary Plano school district",
      "-Resort-style swimming pool with beach entry",
      "-Covered outdoor kitchen with fireplace and televisions",
      "-Private poolside cabanas",
      "-Two landscaped courtyards",
      "-Private resident parking in gated garage",
      "-24-hour state-of-the-art fitness center",
      "-Resident business center and conference room",
      "-Java bar featuring Starbucks coffee",
      "-Pet-friendly community with paw wash",
      "-Storage units available",
      "-Trash and recycling center",
      "-Clothes care facility",
      "-Fully-equipped kitchens with stainless steel appliances",
      "-Side-by-side refrigerators with ice/water dispensers",
      "-Elegant slab granite counter",
      "tops in kitchens and bathrooms",
      "-Espresso kitchen cabinets with satin nickel hardware",
      "-Under mount extra deep stainless sink in kitchens",
      "-Master Wood plank flooring in living/dining areas, kitchens and entries",
      "-Designer lighting package with pendant lights in kitchens",
      "-Ceiling fans in living rooms and bedrooms",
      "-Oversized garden tubs with tile surround",
      "-Five-panel interior doors",
      "-USB outlet in master bedrooms for charging electronics",
      "-Spacious patios and balconies",
      "-Built-in computer desks",
      "-Private patios with gated front stoop access",
      "Call or text anytime at",
      "show contact info",
      "to find out more about this apartment.  Apartment tours are made by appointment only.",
      "To better assist you please provide us with the following:",
      "First and Last Name, phone number, email and desired move in date or range of dates.",
      "Availability and pricing subject to change at any time. We promote equal house opportunity."
    ],
    "duplicates": []
  },
  {
    "price": "$1649",
    "title": "Hot Location Close to Major Attractions and Great Amenities in Plano",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-hot-location-close-to-major/7108351437.html",
    "description": [
      "This apartment is just a short drive from downtown Dallas and an easy walk to local retailers, up-and-coming restaurants and bars with lots of style.  This apartment  is perfectly located for a comfortable life well-lived, and carefully designed for luxury living.",
      "Amenities readily available include:",
      "Bike Racks",
      "Car Wash Stations",
      "Ceramic tile backsplash",
      "Climate controlled corridors",
      "Controlled access gates and buildings",
      "Business Center",
      "Courtyard",
      "Custom ceramic tile flooring and backsplashes",
      "Custom solar shades",
      "Digital cable TV available",
      "Electronic Unit entry",
      "Elevator access",
      "Expansive closets with custom shelving",
      "Pet Park and Paw Spa Available",
      "Full size washer/dryers included",
      "Full-service Technology Lounge",
      "Grand Social Room with Catering Kitchen",
      "Indoor/Outdoor Lounge with Televisions",
      "Open concept living spaces",
      "Outdoor BBQ kitchens",
      "Package Concierge System",
      "Parking Garage",
      "Plush carpeting in bedrooms",
      "Private Conference Room",
      "Private Spin Studio with Fitness on Demand",
      "Recessed lighting",
      "Self-cleaning ovens",
      "Serene Hammock Courtyard",
      "Side-by-side refrigerators with ice makers",
      "Fully equipped and modern fitness center",
      "Call or text anytime at",
      "show contact info",
      "for more information.",
      "When reaching out, please provide:",
      "Name",
      "Email",
      "Phone",
      "Desired Move in Date",
      "Availability and pricing subject to change at any time. We promote equal house opportunity."
    ],
    "duplicates": []
  },
  {
    "price": "$1732",
    "title": "Great and Luxurious Apartment in the Plano Area",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-great-and-luxurious-apartment-in/7108761883.html",
    "description": [
      "Plano Apartment",
      "Beautiful Luxurious apartment in the Dallas-Plano area, offering many amenities such as:",
      "-LEED Gold Certified community",
      "-Resort-style swimming pool with beach entry",
      "-Covered outdoor kitchen with fireplace and televisions",
      "-Private poolside cabanas, two landscaped courtyards, private resident parking in gated garage",
      "-24-hour state-of-the-art fitness center",
      "-Resident business center and conference room , java bar featuring Starbucks coffee",
      "-Pet-friendly community with paw wash",
      "-Storage units available, trash and recycling center",
      "-Clothes care facility",
      "-Fully-equipped kitchens with stainless steel appliances",
      "-Side-by-side refrigerators with ice/water dispensers",
      "-Elegant slab granite counter tops in kitchens and bathrooms",
      "-Espresso kitchen cabinets with satin nickel hardware",
      "-Under mount extra deep stainless sink in kitchens",
      "Master Wood plank flooring in living/dining areas, kitchens and entries",
      "-Designer lighting package with pendant lights in kitchens",
      "-Ceiling fans in living rooms and bedrooms",
      "-Oversized garden tubs with tile surround",
      "-Five-panel interior doors",
      "-USB outlet in master bedrooms for charging electronics",
      "-Spacious patios and balconies",
      "-Built-in computer desks",
      "-Private patios with gated front stoop access",
      "All of these amenities plus convenience to great location, access to great dinning, lakes, bike and running trails, major high ways, and the life style that living in the Dallas-Plano area can offer.",
      "Call or text anytime at",
      "show contact info",
      "for more information.  Apartment tours are made by appointment only.",
      "To better assist you please provide us with the following:",
      "First and Last Name, phone number, email, defined move in date.",
      "Availability and pricing subject to change at any time. We promote equal house opportunity."
    ],
    "duplicates": []
  },
  {
    "price": "$1340",
    "title": ">>> Super Sleek and Modern in West Plano >> On Site Pet Park and Spa >",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-super-sleek-and-modern-in-west/7120701467.html",
    "description": [
      ">>> Super Gorgeous and Modern Apartments available for Rent in West Plano.  Currently offering up to 6 weeks free on select units. >>>",
      "These apartment spaces feature hardwood floors, expansive kitchens with an island, quartz counters, stainless steel appliances, custom cabinets, sleek subway tile backsplash.  The master ensuite is spa inspired, huge closets with custom shelving, 10ft ceilings, and an outdoor space.  Tons of amenities to choose from including a state of the art fitness center with a private spin room, resort pool with a rain curtain water feature, car wash station, pet park and pet wash, and courtyards featuring ping pong and corn hole.",
      "To view this property or others similar to it, please contact me by replying directly to this ad or using the information in the attached business card.  My services are completely free to you and I look forward to helping you find a new place to live. #BroadstoneEvoke"
    ],
    "duplicates": []
  },
  {
    "price": "$1",
    "title": "LOOKING FOR A HOUSE FOR RENT ? I CAN HELP !",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-looking-for-house-for-rent-can/7105445226.html",
    "description": [
      "My name is Georgette ,",
      "I am an apartment locator/AGENT. My services are FREE FREE, FREE ! You pay me nothing for my services. Whenever you lease at an apartment and put me as your referral source, the apartment complex pays me a commission for bringing them a qualified tenant. I will find all the best deals for you in the area and save you time",
      "I work with***",
      "RENT HOUSE*",
      "Luxury apartments*",
      "Townhouse*",
      "High Rise*",
      "Penthouse*",
      "Section 8 vouchers*",
      "Eviction 2 YEARS OLD *",
      "Broken Lease 1 YEAR OLD *",
      "Most criminal offenses*",
      "FELONY 5 YEARS OLD*",
      "MISD. 1 YEAR OLD*",
      "We are a full-service real estate company. We also help with buying, selling and leasing homes and property management and all commercial property buying and selling pus management as well. You can call or text me at any time.",
      "If interested, please reply directly to this ad or contact me using the information in the attached business card. To get started, I just need to know what areas you are looking to move to, what your price range is, any pets, move date, and anything specific you want in your new apartment/Home. >>>",
      "Georgette Bon",
      "AGENT | Apartment Locator",
      "Core One Real Estate",
      "The referral of your friends and family is the greatest compliment you can give me.",
      "Thank you for your trust in me."
    ],
    "duplicates": []
  },
  {
    "price": "$1879",
    "title": "Brand New Chic Apt in West Plano**ONE MONTH FREE!**",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-brand-new-chic-apt-in-west/7114220954.html",
    "description": [
      "Brand New Luxury and Chic Apartment in West Plano with Dining, Shopping, and Entertainment at Your Door Step! Stunning Kitchens with White Quartz Countertops and Sleek Steel Appliances in the Kitchen. Wood Floors, Walk-In Closets, Stand-Up Showers, Garden Tubs, plus Washer and Dryer Included in Your Chic Apartment Home. Amenities Include a Luxe Resort Style Swimming Pool, Tanning Deck, 24/7 State of the Art Athletic Center,  a Party Room, Billiards Table, Private Conference Room, Pet Park, Plus So Much More! Parking Garage and Elevators as Well! Great Staff and Maintenance. Please Call Jacquelyn with Dash Realty for More Information at",
      "show contact info",
      "."
    ],
    "duplicates": []
  },
  {
    "price": "$1088",
    "title": "Experience beautiful one and two bedroom apartment homes!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-experience-beautiful-one-and-two/7120616325.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "1 Bedrooms starting at $1,088",
      "2 Bedrooms starting at $1,591",
      "3 Bedrooms starting at $",
      "Business center, Fitness center, Door to door trash pickup, Perimeter fence, Gated entrance, Private detached garages($120/mo), Free WiFi Areas, Outdoor Grills, Handicap modified units, Carports, School bus stop, Pool, Dog Park",
      "***Broken Lease***",
      "Eviction**Second Chance** We Can Help you, Our Service is FREE",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#8322A"
    ],
    "duplicates": []
  },
  {
    "price": "$1755",
    "title": "Come visit today and make us your new home!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-come-visit-today-and-make-us-your/7111701769.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "Special: 1mo free w/12+mo",
      "1 Bedrooms starting at $1,378",
      "2 Bedrooms starting at $1,755",
      "3 Bedrooms starting at $",
      "Handicap modified units, Gated entrance, Furnished units, Outdoor Grills, Elevators, Fitness center, Pool, Dog Park, Free WiFi Areas, Bus stop, Assigned parking, Community parking garage, Business center, Laundry room",
      "***Broken Lease***",
      "Accept Eviction  Second Chance We can Help you Our service is Free",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#5362A"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1699",
    "title": "Afforable 3 Bedroom In West Plano School Dist., Gated",
    "href": "https://dallas.craigslist.org/ndf/apa/d/afforable-3-bedroom-in-west-plano/7116369835.html",
    "description": [
      "Located between the George Bush Turnpike and North Dallas Tollway, our beautiful apartment community brings you the convenience of many shops, dining and entertainment destinations. Choose from a number of innovatively designed apartment homes. Our one, two and three bedroom floor plans feature all electric kitchens, spacious walk-in closets, washer and dryer connections, central heating and air, wonderful views, private patios and balconies, and so much more! Relax by the refreshing resort style swimming pool or enjoy the convenience of our state of the art fitness facility. Pets are welcome so bring the whole family! Committed to providing an outstanding living experience including our dedication to the highest level of maintenance and service to our residents!",
      "Please Call Desiree",
      "show contact info",
      "Mention Ad 465"
    ],
    "duplicates": [
      "6004497850"
    ]
  },
  {
    "price": "$1890",
    "title": "6 weeks free upfront + Cash rebate",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-6-weeks-free-upfront-cash-rebate/7122778550.html",
    "description": [
      "Contact info:",
      "Cole McCullough | Dash Realty |",
      "show contact info",
      "Reference Apartment #292 ; Application FEE $75 ADMIN FEE $175",
      "$1,890/mo",
      "KEY FEATURES",
      "Sq Footage:",
      "1147sqft.",
      "Bedrooms:",
      "2 Bed",
      "Bathrooms:",
      "2 Bath",
      "Parking:",
      "Parking Garage | Guest parking",
      "Lease Duration:",
      "1 Year",
      "Pets Policy:",
      "Cats & Dogs OK",
      "Laundry:",
      "In Unit",
      "Property Type:",
      "Apartment",
      "DESCRIPTION",
      "Where you call home touches every aspect of your life. This community was carefully designed for the person ready for the next chapter in luxury living. A short drive from downtown Dallas and an easy walk to local retailers, up-and-coming restaurants and bars with endless charm, This community is perfectly located for a life well-lived.",
      "Be sure to call/text Cole McCullough with Dash Realty at",
      "show contact info",
      "in order to receive specials, schedule a tour, or for more information. Please remember my services are FREE to you, the apartment complex pays for my referral and that is how I am able to get you certain specials that are not always available to the public!!",
      "RENTAL FEATURES",
      "Living room",
      "Dining room",
      "Walk-in closet",
      "Master bath",
      "Storage space",
      "Pantry",
      "Recreation room",
      "Range / Oven",
      "Refrigerator",
      "Dishwasher",
      "Microwave",
      "Garbage disposal",
      "Stainless steel appliances",
      "Freezer",
      "Balcony, Deck, or Patio",
      "Heat: forced air",
      "Central A/C",
      "Air conditioning",
      "Ceiling fans",
      "Cable-ready",
      "High-speed internet",
      "Wired",
      "Hardwood floor",
      "Granite countertop",
      "High / Vaulted ceiling",
      "COMMUNITY FEATURES",
      "New property",
      "Elevator",
      "Secured entry",
      "Controlled access",
      "Gated entry",
      "Disability access",
      "Shared pool",
      "Fitness center",
      "Near transportation",
      "Clubhouse",
      "Barbecue",
      "Business center",
      "Guest parking",
      "Off-street parking",
      "Covered parking",
      "On-street parking",
      "Garage - Attached",
      "Contact info:",
      "Cole McCullough",
      "Dash Realty",
      "show contact info",
      "*Prices, Specials, and availability are subject to change at anytime without notice.\nTags: Apartments, Downtown Dallas, East Dallas Apartments, Farmers market, deep Ellum, highland park, Park Cities, Kessler Park, Bishop Arts District, Knox/Henderson, Medical District, Design District, Midtown, North Dallas, Northeast Dallas, Northwest Dallas, Old East Dallas, Far North Dallas, South Dallas, Southeast Dallas, Uptown, Uptown Dallas apartments, Uptown Dallas, Addison apartments, Allen apartments, Carrollton apartments, Farmers Branch apartments, Frisco, Frisco apartments, Lake highlands apartments, Mckinney apartments, Mckinney, Richardson Apartments, Rockwall apartments, the colony, Las Colinas apartments, Irving apartments, South Irving apartments, North Irving apartments, Valley Ranch Apartments, Plano apartments, Central Plano apartments, West Plano apartments, East plano apartments, Ft.Worth apartments, Arlington apartments, Mid Cities apartments"
    ],
    "duplicates": [
      "6732345442"
    ]
  },
  {
    "price": "$1105",
    "title": "Desirable selection of newly renovated one and two-bedroom apartment!",
    "href": "https://dallas.craigslist.org/dal/apa/d/plano-desirable-selection-of-newly/7122745763.html",
    "description": [
      "Contact by phone 1 Source Apartment Locators",
      "show contact info",
      "or text me",
      "show contact info",
      "Special: $250 off 1st & 2nd mo w/12mo",
      "1 Bedrooms starting at $1,105",
      "2 Bedrooms starting at $1,270",
      "3 Bedrooms starting at $",
      "2 Pools, Fitness center, Laundry room, Gated entrance, Private detached garages($100/mo), Free WiFi Areas, School bus stop, Door to door trash pickup, Game/Sport room, Business center, Assigned parking, Club house, Perimeter fence, Picnic area, Outdoor Grills",
      "Broken Lease",
      "Eviction**Second Chance** We Can Help you, Our Service is FREE",
      "MY SERVICE IS 100% FREE",
      "1 Source Locators",
      "Top rated locator service in Dallas with over 500 Five star review",
      "Refer to Apt#7959A"
    ],
    "duplicates": [
      null
    ]
  },
  {
    "price": "$1",
    "title": "FREE LOCATOR SERVICE-SECOND CHANCE IN DFW",
    "href": "https://dallas.craigslist.org/ndf/apa/d/plano-free-locator-service-second/7122276185.html",
    "description": [
      "I am an apartment locator/AGENT. My services are FREE FREE, FREE ! You pay me nothing for my services. Whenever you lease at an apartment and put me as your referral source, the apartment complex pays me a commission for bringing them a qualified tenant. I will find all the best deals for you in the area and save you time",
      "I work with***",
      "RENTAL HOMES ( you must qualify)**",
      "Luxury apartments* CLICK HERE TO START: LEIGH.COREONEREALESTATE.COM",
      "Townhouse*",
      "High Rise*",
      "Penthouse*",
      "Section 8 vouchers*",
      "Eviction 2 YEARS OLD *",
      "Broken Lease 1 YEAR OLD *",
      "Most criminal offenses*",
      "FELONY 5 YEARS OLD*",
      "MISD. 1 YEAR OLD*",
      "We are a full-service real estate company. We also help with buying, selling and leasing homes and property management and all commercial property buying and selling pus management as well.",
      "If interested, please reply directly to this ad or contact me using the information in the attached business card. To get started, I just need to know what areas you are looking to move to, what your price range is, any pets, move date, and anything specific you want in your new apartment.",
      "tags: second chance, real estate, property manager, realtor, criminal background, broken leases, evictions, apartments, apartment locating, assistance, free, locator, homes, houses, rent, bad credit, Collin County, Dallas County, Tarrant County, Denton County, Hunt County, specials"
    ],
    "duplicates": [
      null
    ]
  }
]